[
{"id": "85010748568", "title": "HINMINE: heterogeneous information network mining with information retrieval heuristics", "authors": ["Kralj, J.", "Robnik-Šikonja, M.", "Lavrač, N."], "abstract": "The paper presents an approach to mining heterogeneous information networks by decomposing them into homogeneous networks. The proposed HINMINE methodology is based on previous work that classifies nodes in a heterogeneous network in two steps. In the first step the heterogeneous network is decomposed into one or more homogeneous networks using different connecting nodes. We improve this step by using new methods inspired by weighting of bag-of-words vectors mostly used in information retrieval. The methods assign larger weights to nodes which are more informative and characteristic for a specific class of nodes. In the second step, the resulting homogeneous networks are used to classify data either by network propositionalization or label propagation. We propose an adaptation of the label propagation algorithm to handle imbalanced data and test several classification algorithms in propositionalization. The new methodology is tested on three data sets with different properties. For each data set, we perform a series of experiments and compare different heuristics used in the first step of the methodology. We also use different classifiers which can be used in the second step of the methodology when performing network propositionalization. Our results show that HINMINE, using different network decomposition methods, can significantly improve the performance of the resulting classifiers, and also that using a modified label propagation algorithm is beneficial when the data set is imbalanced. © 2017, Springer Science+Business Media New York."},
{"id": "85023770506", "title": "Deformable Parts Correlation Filters for Robust Visual Tracking", "authors": ["Lukežič, A.", "Čehovin Zajc, L.", "Kristan, M."], "abstract": "Deformable parts models show a great potential in tracking by principally addressing nonrigid object deformations and self occlusions, but according to recent benchmarks, they often lag behind the holistic approaches. The reason is that potentially large number of degrees of freedom have to be estimated for object localization and simplifications of the constellation topology are often assumed to make the inference tractable. We present a new formulation of the constellation model with correlation filters that treats the geometric and visual constraints within a single convex cost function and derive a highly efficient optimization for maximum a posteriori inference of a fully connected constellation. We propose a tracker that models the object at two levels of detail. The coarse level corresponds a root correlation filter and a novel color model for approximate object localization, while the mid-level representation is composed of the new deformable constellation of correlation filters that refine the object location. The resulting tracker is rigorously analyzed on a highly challenging OTB, VOT2014, and VOT2015 benchmarks, exhibits a state-of-the-art performance and runs in real-time. © 2013 IEEE."},
{"id": "85028557499", "title": "Rewrite rules for debugging student programs in programming tutors", "authors": ["Lazar, T.", "Sadikov, A.", "Bratko, I."], "abstract": "Data-driven intelligent tutoring systems learn to provide feedback based on past student behavior, reducing the effort required for their development. A major obstacle to applying data-driven methods in the programming domain is the lack of meaningful observable actions for describing the students problem-solving process. We propose rewrite rules as a language-independent formalization of programming actions in terms of code edits. We describe a method for automatically extracting rewrite rules from students program-writing traces, and a method for debugging new programs using these rules. We used these methods to automatically provide hints in a web application for learning programming. In-class evaluation showed that students receiving automatic feedback solved problems faster and submitted fewer incorrect programs. We believe that rewrite rules provide a good basis for further research into how humans write and debug programs. © 2008-2011 IEEE."},
{"id": "85029153450", "title": "Robust Fusion of Color and Depth Data for RGB-D Target Tracking Using Adaptive Range-Invariant Depth Models and Spatio-Temporal Consistency Constraints", "authors": ["Xiao, J.", "Stolkin, R.", "Gao, Y.", "Leonardis, A."], "abstract": "This paper presents a novel robust method for single target tracking in RGB-D images, and also contributes a substantial new benchmark dataset for evaluating RGB-D trackers. While a target object's color distribution is reasonably motion-invariant, this is not true for the target's depth distribution, which continually varies as the target moves relative to the camera. It is therefore nontrivial to design target models which can fully exploit (potentially very rich) depth information for target tracking. For this reason, much of the previous RGB-D literature relies on color information for tracking, while exploiting depth information only for occlusion reasoning. In contrast, we propose an adaptive range-invariant target depth model, and show how both depth and color information can be fully and adaptively fused during the search for the target in each new RGB-D image. We introduce a new, hierarchical, two-layered target model (comprising local and global models) which uses spatio-temporal consistency constraints to achieve stable and robust on-the-fly target relearning. In the global layer, multiple features, derived from both color and depth data, are adaptively fused to find a candidate target region. In ambiguous frames, where one or more features disagree, this global candidate region is further decomposed into smaller local candidate regions for matching to local-layer models of small target parts. We also note that conventional use of depth data, for occlusion reasoning, can easily trigger false occlusion detections when the target moves rapidly toward the camera. To overcome this problem, we show how combining target information with contextual information enables the target's depth constraint to be relaxed. Our adaptively relaxed depth constraints can robustly accommodate large and rapid target motion in the depth direction, while still enabling the use of depth data for highly accurate reasoning about occlusions. For evaluation, we introduce a new RGB-D benchmark dataset with per-frame annotated attributes and extensive bias analysis. Our tracker is evaluated using two different state-of-the-art methodologies, VOT and object tracking benchmark, and in both cases it significantly outperforms four other state-of-the-art RGB-D trackers from the literature. © 2017 IEEE."},
{"id": "85029455059", "title": "Open-source robotic manipulator and sensory platform", "authors": ["Čehovin Zajc, L.", "Rezelj, A.", "Skočaj, D."], "abstract": "We present an open-source robotic platform for educational use that integrates multiple levels of interaction through the use of additional vision sensor. The environment can be used in virtual, augmented-reality and real-robot modes, enabling smooth transition from a virtual robot manipulator to a real one. We describe the main aspects of our platform that ensure low production costs and encourage openness of both its hardware and software. The main goal of our work was to create a viable low-cost robotic manipulator platform alternative for the university level courses in intelligent robotics, however, the application domain is very broad. © 2018, Springer International Publishing AG."},
{"id": "85030859587", "title": "Detecting concept drift in data streams using model explanation", "authors": ["Demšar, J.", "Bosnić, Z."], "abstract": "Learning from data streams (incremental learning) is increasingly attracting research focus due to many real-world streaming problems and due to many open challenges, among which is the detection of concept drift – a phenomenon when the data distribution changes and makes the current prediction model inaccurate or obsolete. Current state-of-the art detection methods can be roughly split into performance monitoring algorithms and distribution comparing algorithms. In this work we propose a novel concept drift detector that can be combined with an arbitrary classification algorithm. The proposed concept drift detector is based on computing multiple model explanations over time and observing the magnitudes of their changes. The model explanation is computed using a methodology that yields attribute-value contributions for prediction outcomes and thus provides insight into the model's decision-making process and enables its transparency. The evaluation has revealed that the methods surpass the baseline methods in terms of concept drift detection, accuracy, robustness and sensitivity. To even further augment interpretability, we visualized the detection of concept drift, enabling macro and micro views of the data. © 2017 Elsevier Ltd"},
{"id": "85032391183", "title": "Supporting smart construction with dependable edge computing infrastructures and applications", "authors": ["Kochovski, P.", "Stankovski, V."], "abstract": "The Internet of Things (IoT) such as the use of robots, sensors, actuators, electronic signalization and a variety of other Internet enabled physical devices may provide for new advanced smart applications to be used in construction in the very near future. Such applications require real-time responses and are therefore time-critical. Therefore, in order to support collaboration, control, monitoring, supply management, safety and other construction processes, they have to meet dependability requirements, including requirements for high Quality of Service (QoS). Dependability and high QoS can be achieved by using adequate number and quality of computing resources, such as processing, memory and networking elements, geographically close to the smart environments. The goal of this study is to develop a practical edge computing architecture and design, which can be used to support smart construction environments with high QoS. This study gives particular attention to the solution design, which relies on latest cloud and software engineering approaches and technologies, and provides elasticity, interoperability and adaptation to companies’ specific needs. Two edge computing applications supporting video communications and construction process documentation are developed and demonstrate a viable edge computing design for smart construction. © 2017 Elsevier B.V."},
{"id": "85033385351", "title": "Immediate, lag and time window effects of meteorological factors on ST-elevation myocardial infarction incidence", "authors": ["Ravljen, M.", "Hovelja, T.", "Vavpotič, D."], "abstract": "The influence of several meteorological parameters on acute myocardial infarction (AMI) incidences with immediately and/or delayed effects has been widely reported. It remains unknown whether the individual AMI subtypes reveal similar patterns. To date, generally seasonal variation in ST elevation MI (STEMI) has been investigated. However, these approaches couldn’t detect the effects of changes in multiple meteorological variables on STEMI incidence within a specific season. Therefore, the aim of our study is to explore immediate, delayed and cumulative effects of average daily temperature, atmospheric pressure and humidity on nation-wide STEMI hospital admissions. We linked daily hospitals’ STEMI admission data with meteorological stations’ data according to the patient’s permanent residence. Subsequently, a multivariate analysis based on a main effect generalised linear model, assuming a log-link function with a Poisson distribution, was conducted. With the help of lags, we were able to analyse delayed effects, while the cumulative effects of specific meteorological variables were analysed utilising time windows. As a result, we confirmed immediate and delayed negative effect of low temperature and low relative humidity for all observed lags as well as cumulative average effects of low temperature and low relative humidity for all observed time windows. However, no delayed, single-day effect for atmospheric pressure was detected. Nevertheless, the cumulative average effect was confirmed in all time windows suggesting that prolonged low pressure influences the incidence of STEMI. A novelty of our approach is the comparative examination of immediate, delayed and cumulative effect of specific meteorological variables on the incidence of STEMI. This approach enables us to gain a new insight into the phenomenon studied. © 2017 Taylor &amp; Francis Group, LLC."},
{"id": "85034017844", "title": "Cold chain and shelf life prediction of refrigerated fish – From farm to table", "authors": ["Trebar, M."], "abstract": "Fresh perishables are normally stored and distributed with a proper cold chain control in the supply chain from farm to retail. Usually, the consumers break the cold chain after the point of sale. The question is whether consumers are aware of requirements during the transport to and storage at home. The handling conditions and temperature changes can significantly decrease the shelf life and cause faster spoilage of food. The study presents two examples of shelf life prediction. The first one is based on temperature measurements of fish covered with ice in a Styrofoam box with supported information of environment temperatures in the cold store, uncooled car and refrigerator. In the second, measurements from first phase of storage on temperatures (0 °C–4 °C) were used with assumption of fish stored later on higher temperatures without ice. The results show important shortening of shelf life after the point of sale. © 2018, ICST Institute for Computer Sciences, Social Informatics and Telecommunications Engineering."},
{"id": "85034812567", "title": "Interpreting and linguistic inclusion–friends or foes? results from a field study", "authors": ["K.", "Čibej, J."], "abstract": "The article responds to the existing political claims that translation and interpreting reduce the incentive of recent immigrants to learn the language(s) of the host country and thereby impede their integration. To verify these claims, quantitative and qualitative research was conducted among asylum seekers in Slovenia, i.e. a group of recent immigrants who have access to free interpreting and translation services and free courses in the dominant language of the host country. A questionnaire was used to gather quantitative data on the language profiles of 127 current and former residents of the asylum seeker centres in Slovenia, while qualitative data were obtained through semi-structured interviews conducted with a representative group of 38 asylum seekers. The results show that all surveyed migrants had a positive attitude towards the host country language and that all of the interviewed migrants who had been in the host country for 7 months or more, regardless of their educational attainment, also took the state-funded course of the host country language. Additionally, although the provision of translation and interpreting is recognised as essential in high-risk situations, it is not the preferred communication strategy of the migrants, and therefore does not hinder their functional linguistic inclusion. © 2017, © 2017 Informa UK Limited, trading as Taylor &amp; Francis Group."},
{"id": "85037728402", "title": "Frame–based classification for cross-speed gait recognition", "authors": ["Kovač, J.", "Štruc, V.", "Peer, P."], "abstract": "The use of human gait as the means of biometric identification has gained a lot of attention in the past few years, mostly due to its enormous potential. Such biometrics can be captured at public places from a distance without subjects collaboration, awareness and even consent. However, there are still numerous challenges caused by influence of covariate factors like changes of walking speed, view, clothing, footwear etc., that have negative impact on recognition performance. In this paper we tackle walking speed changes with a skeleton model-based gait recognition system focusing on improving algorithm robustness and improving the performance at higher walking speed changes. We achieve these by proposing frame based classification method, which overcomes the main shortcoming of distance based classification methods, which are very sensitive to gait cycle starting point detection. The proposed technique is starting point invariant with respect to gait cycle starts and as such ensures independence of classification from gait cycle start positions. Additionally, we propose wavelet transform based signal approximation, which enables the analysis of feature signals on different frequency space resolutions and diminishes the need for using feature transformation that require training. With the evaluation on OU-ISIR gait dataset we demonstrate state of the art performance of proposed methods. © 2017, Springer Science+Business Media, LLC, part of Springer Nature."},
{"id": "85038124596", "title": "The Singular Bivariate Quartic Tracial Moment Problem", "authors": ["Bhardwaj, A.", "Zalar, A."], "abstract": "The (classical) truncated moment problem, extensively studied by Curto and Fialkow, asks to characterize when a finite sequence of real numbers indexes by words in commuting variables can be represented with moments of a positive Borel measure μ on R <sup>n</sup> . Burgdorf and Klep (J Oper Theory 68:141–163, 2012) introduced its tracial analog, the truncated tracial moment problem, which replaces commuting variables with non-commuting ones and moments of μ with tracial moments of matrices. In the bivariate quartic case, where indices run over words in two variables of degree at most four, every sequence with a positive definite 7 × 7 moment matrix M <sub>2</sub> can be represented with tracial moments (Burgdorf and Klep in C R Math Acad Sci Paris 348:721–726, 2010, 2012). In this article the case of singular M <sub>2</sub> is studied. For M <sub>2</sub> of rank at most 5 the problem is solved completely; namely, concrete measures are obtained whenever they exist and the uniqueness question of the minimal measures is answered. For M <sub>2</sub> of rank 6 the problem splits into four cases, in two of which it is equivalent to the feasibility problem of certain linear matrix inequalities. Finally, the question of a flat extension of the moment matrix M <sub>2</sub> is addressed. While this is the most powerful tool for solving the classical case, it is shown here by examples that, while sufficient, flat extensions are mostly not a necessary condition for the existence of a measure in the tracial case. © 2017, Springer International Publishing AG, part of Springer Nature."},
{"id": "85040453075", "title": "An application of machine learning to haematological diagnosis", "authors": ["Gunčar, G.", "Kukar, M.", "Notar, M.", "Brvar, M.", "Černelč, P.", "Notar, M.", "Notar, M."], "abstract": "Quick and accurate medical diagnoses are crucial for the successful treatment of diseases. Using machine learning algorithms and based on laboratory blood test results, we have built two models to predict a haematologic disease. One predictive model used all the available blood test parameters and the other used only a reduced set that is usually measured upon patient admittance. Both models produced good results, obtaining prediction accuracies of 0.88 and 0.86 when considering the list of five most likely diseases and 0.59 and 0.57 when considering only the most likely disease. The models did not differ significantly, which indicates that a reduced set of parameters can represent a relevant \"fingerprint\" of a disease. This knowledge expands the model's utility for use by general practitioners and indicates that blood test results contain more information than physicians generally recognize. A clinical test showed that the accuracy of our predictive models was on par with that of haematology specialists. Our study is the first to show that a machine learning predictive model based on blood tests alone can be successfully applied to predict haematologic diseases. This result and could open up unprecedented possibilities for medical diagnosis. © 2018 The Author(s)."},
{"id": "85040617560", "title": "k-Same-Net: K-Anonymity with generative deep neural networks for face deidentification", "authors": ["Meden, B.", "Emeršič, Ž.", "Štruc, V.", "Peer, P."], "abstract": "Image and video data are today being shared between government entities and other relevant stakeholders on a regular basis and require careful handling of the personal information contained therein. A popular approach to ensure privacy protection in such data is the use of deidentification techniques, which aim at concealing the identity of individuals in the imagery while still preserving certain aspects of the data after deidentification. In this work, we propose a novel approach towards face deidentification, called k-Same-Net, which combines recent Generative Neural Networks (GNNs) with the well-known k-Anonymitymechanism and provides formal guarantees regarding privacy protection on a closed set of identities. Our GNN is able to generate synthetic surrogate face images for deidentification by seamlessly combining features of identities used to train the GNN model. Furthermore, it allows us to control the image-generation process with a small set of appearance-related parameters that can be used to alter specific aspects (e.g., facial expressions, age, gender) of the synthesized surrogate images. We demonstrate the feasibility of k-Same-Net in comprehensive experiments on the XM2VTS and CK+ datasets. We evaluate the efficacy of the proposed approach through reidentification experiments with recent recognition models and compare our results with competing deidentification techniques from the literature. We also present facial expression recognition experiments to demonstrate the utility-preservation capabilities of k-Same-Net. Our experimental results suggest that k-Same-Net is a viable option for facial deidentification that exhibits several desirable characteristics when compared to existing solutions in this area. © 2018 by the authors."},
{"id": "85041065797", "title": "Genome sequence of a lethal strain of xylem-invading Verticillium nonalfalfae", "authors": ["Jakše, J.", "Jelen, V.", "Radišek, S.", "de Jonge, R.", "Mandelc, S.", "Majer, A.", "Curk, T.", "Zupan, B.", "Thomma, B.", "Javornik, B."], "abstract": "Verticillium nonalfalfae, a soilborne vascular phytopathogenic fungus, causes wilt disease in several crop species. Of great concern are outbreaks of highly aggressive V. nonalfalfae strains, which cause a devastating wilt disease in European hops. We report here the genome sequence and annotation of V. nonalfalfae strain T2, providing genomic information that will allow better understanding of the molecular mechanisms underlying the development of highly aggressive strains. © 2018 Jakše et al."},
{"id": "85041484333", "title": "Connectivity derived thalamic segmentation in deep brain stimulation for tremor", "authors": ["Akram, H.", "Dayal, V.", "Mahlknecht, P.", "Georgiev, D.", "Hyam, J.", "Foltynie, T.", "Limousin, P.", "De Vita, E.", "Jahanshahi, M.", "Ashburner, J.", "Behrens, T.", "Hariz, M.", "Zrinzo, L."], "abstract": "The ventral intermediate nucleus (VIM) of the thalamus is an established surgical target for stereotactic ablation and deep brain stimulation (DBS) in the treatment of tremor in Parkinson's disease (PD) and essential tremor (ET). It is centrally placed on a cerebello-thalamo-cortical network connecting the primary motor cortex, to the dentate nucleus of the contralateral cerebellum through the dentato-rubro-thalamic tract (DRT). The VIM is not readily visible on conventional MR imaging, so identifying the surgical target traditionally involved indirect targeting that relies on atlas-defined coordinates. Unfortunately, this approach does not fully account for individual variability and requires surgery to be performed with the patient awake to allow for intraoperative targeting confirmation. The aim of this study is to identify the VIM and the DRT using probabilistic tractography in patients that will undergo thalamic DBS for tremor. Four male patients with tremor dominant PD and five patients (three female) with ET underwent high angular resolution diffusion imaging (HARDI) (128 diffusion directions, 1.5 mm isotropic voxels and b value = 1500) preoperatively. Patients received VIM-DBS using an MR image guided and MR image verified approach with indirect targeting. Postoperatively, using parallel Graphical Processing Unit (GPU) processing, thalamic areas with the highest diffusion connectivity to the primary motor area (M1), supplementary motor area (SMA), primary sensory area (S1) and contralateral dentate nucleus were identified. Additionally, volume of tissue activation (VTA) corresponding to active DBS contacts were modelled. Response to treatment was defined as 40% reduction in the total Fahn-Tolosa-Martin Tremor Rating Score (FTMTRS) with DBS-ON, one year from surgery. Three out of nine patients had a suboptimal, long-term response to treatment. The segmented thalamic areas corresponded well to anatomically known counterparts in the ventrolateral (VL) and ventroposterior (VP) thalamus. The dentate-thalamic area, lay within the M1-thalamic area in a ventral and lateral location. Streamlines corresponding to the DRT connected M1 to the contralateral dentate nucleus via the dentate-thalamic area, clearly crossing the midline in the mesencephalon. Good response was seen when the active contact VTA was in the thalamic area with highest connectivity to the contralateral dentate nucleus. Non-responders had active contact VTAs outside the dentate-thalamic area. We conclude that probabilistic tractography techniques can be used to segment the VL and VP thalamus based on cortical and cerebellar connectivity. The thalamic area, best representing the VIM, is connected to the contralateral dentate cerebellar nucleus. Connectivity based segmentation of the VIM can be achieved in individual patients in a clinically feasible timescale, using HARDI and high performance computing with parallel GPU processing. This same technique can map out the DRT tract with clear mesencephalic crossing. © 2018 The Author(s)"},
{"id": "85042558506", "title": "Perfect discrete morse functions on connected sums", "authors": ["Varli, H.", "Pamuk, M.", "Kosta, N."], "abstract": "We study perfect discrete Morse functions on closed, connected, oriented n-dimensional manifolds.We show how to compose such functions on connected sums of manifolds of arbitrary dimensions and how to decompose them on connected sums of closed oriented surfaces. © 2018, International Press."},
{"id": "85042846690", "title": "The Sylvester graph and Moore graphs", "authors": ["Jurišić, A.", "Vidali, J."], "abstract": "The combinatorial structure of a famous graph with large girth, namely the Sylvester graph, is studied. Simple techniques, such as two-way counting, partitions, circuit chasing and covers are used to identify smaller structures and to show that there are no other graphs that share a small number of regularity properties with it. As a consequence, we show the same for the Hoffman–Singleton graph. We notice that some much larger graphs with large girth have similar properties, and could be studied using the same techniques. In particular, we show that just as the Hoffman–Singleton graph contains the Sylvester graph, a Moore graph of valency 57, whose existence is a famous open problem, must contain a subgraph with a structure that is similar to the one we derived for the Sylvester graph. © 2018 Elsevier Ltd"},
{"id": "85043268328", "title": "Glioblastoma in patients over 70 years of age", "authors": ["Smrdel, U.", "Vidmar, M.", "Smrdel, A."], "abstract": "Glioblastoma has in last 20 years seen the steady increase of incidence, which is most prominent in the group of older patients. These older than 70 years have significantly poorer prognosis than other patients and are considered a distinct group of glioblastoma patients. Modified prognostic factors are being used in these patients and this information is lately supplemented with the genetic and epigenetic information on tumour. The therapy is now often tailored accordingly. The aim of our study was to analyse the current treatment of the glioblastoma patients over 70 years of age to determine the impact of clinical prognostic factors. Among patients treated at the Institute of Oncology Ljubljana between 1997 and 2015, we found that 207 were older than 70 years. We analysed their survival, clinical prognostic factors (age, performance status) treatment modalities (extent of surgery, radiation dose, chemotherapy). Median survival of patients older than 70 years was 5.3 months which was statistically significant inferior to the survival of younger patients (p &lt; 0.001). The clinical prognostic factors that influenced survival the most were performance status (p &lt; 0.001), extent of surgical resection (p &lt; 0.001), addition of temozolomide (p &lt; 0.001) and addition of radiotherapy (p = 0.006). Patients receiving concomitant radiochemotherapy with temozolomide followed by adjuvant temozolomide, had same median survival as patients receiving adjuvant temozolomide after completion of radiotherapy. The increase of the number of older patients with glioblastoma corresponds to the increase in the life expectancy but in Slovenia also to the increased availability of diagnostic procedures. Clinical prognostic markers are helpful in decision on the aggressiveness of treatment. Radiotherapy and temozolomide have the biggest impact on survival, but the radiotherapy dose seems to be of secondary importance. In selected patients, chemotherapy alone might be sufficient to achieve an optimal effect. Patients that were fitter, had more aggressive surgery, and received temozolomide fared the best. The scheduling of the temozolomide seems to have limited impact on survival as in our study, there was no difference weather patients received temozolomide concomitant with radiotherapy or after the radiotherapy. Thus far, our findings corroborate the usefulness of recursive partitioning analysis (RPA) classes in clinical decisions. © 2018 Uros Smrdel, Marija Skoblar Vidmar, Ales Smrdel, published by Sciendo."},
{"id": "85044468411", "title": "MFAM: Multiple frequency adaptive model-based indoor localization method", "authors": ["Tuta, J.", "Juric, M."], "abstract": "This paper presents MFAM (Multiple Frequency Adaptive Model-based localization method), a novel model-based indoor localization method that is capable of using multiple wireless signal frequencies simultaneously. It utilizes indoor architectural model and physical properties of wireless signal propagation through objects and space. The motivation for developing multiple frequency localization method lies in the future Wi-Fi standards (e.g., 802.11ah) and the growing number of various wireless signals present in the buildings (e.g., Wi-Fi, Bluetooth, ZigBee, etc.). Current indoor localization methods mostly rely on a single wireless signal type and often require many devices to achieve the necessary accuracy. MFAM utilizes multiple wireless signal types and improves the localization accuracy over the usage of a single frequency. It continuously monitors signal propagation through space and adapts the model according to the changes indoors. Using multiple signal sources lowers the required number of access points for a specific signal type while utilizing signals, already present in the indoors. Due to the unavailability of the 802.11ah hardware, we have evaluated proposed method with similar signals; we have used 2.4 GHz Wi-Fi and 868 MHz HomeMatic home automation signals. We have performed the evaluation in a modern two-bedroom apartment and measured mean localization error 2.0 to 2.3 m and median error of 2.0 to 2.2 m. Based on our evaluation results, using two different signals improves the localization accuracy by 18% in comparison to 2.4 GHz Wi-Fi-only approach. Additional signals would improve the accuracy even further. We have shown that MFAM provides better accuracy than competing methods, while having several advantages for real-world usage. © 2018 by the authors. Licensee MDPI, Basel, Switzerland."},
{"id": "85044540595", "title": "Providing better feedback for students solving programming tasks using project tomo", "authors": ["Jerše, G.", "Lokar, M."], "abstract": "Systems for automatic assessment of programming tasks have become a popular choice in programming courses as several advantages of using automatic assessment in teaching and learning process have been observed. One of the most important is the immediate feedback students get. However, the quality of the feedback is essential to achieve good learning results. At the University of Ljubljana we use our proprietary system called Project Tomo as a teaching tool. One of the most important aspects of our system is the possibility to return a detailed feedback and to analyze the student's solution since every submission is stored on the server. Until now we have collected more than 110, 000 attempts along with their history. We are currently in the process of analyzing them. Currently we are concentrating on how to use this data to further improve the quality of the feedback given to the student. Some of the observations and the preliminary results are presented in the paper. © 2018 CEUR-WS. All rights reserved."},
{"id": "85044853287", "title": "A Bayesian hierarchical latent trait model for estimating rater bias and reliability in largescale performance assessment", "authors": ["Zupanc, K.", "Štrumbelj, E."], "abstract": "We propose a novel approach to modelling rater effects in scoring-based assessment. The approach is based on a Bayesian hierarchical model and simulations from the posterior distribution. We apply it to large-scale essay assessment data over a period of 5 years. Empirical results suggest that the model provides a good fit for both the total scores and when applied to individual rubrics. We estimate the median impact of rater effects on the final grade to be ± 2 points on a 50 point scale, while 10% of essays would receive a score at least ± 5 different from their actual quality. Most of the impact is due to rater unreliability, not rater bias. © 2018 Zupanc, Štrumbelj."},
{"id": "85044939684", "title": "Differential expression of microRNAs and other small RNAs in muscle tissue of patients with ALS and healthy age-matched controls", "authors": ["Kovanda, A.", "Leonardis, L.", "Zidar, J.", "Koritnik, B.", "Dolenc-Groselj, L.", "Ristic Kovacic, S.", "Curk, T.", "Rogelj, B."], "abstract": "Amyotrophic lateral sclerosis is a late-onset disorder primarily affecting motor neurons and leading to progressive and lethal skeletal muscle atrophy. Small RNAs, including microRNAs (miRNAs), can serve as important regulators of gene expression and can act both globally and in a tissue-/cell-type-specific manner. In muscle, miRNAs called myomiRs govern important processes and are deregulated in various disorders. Several myomiRs have shown promise for therapeutic use in cellular and animal models of ALS; however, the exact miRNA species differentially expressed in muscle tissue of ALS patients remain unknown. Following small RNA-Seq, we compared the expression of small RNAs in muscle tissue of ALS patients and healthy age-matched controls. The identified snoRNAs, mtRNAs and other small RNAs provide possible molecular links between insulin signaling and ALS. Furthermore, the identified miRNAs are predicted to target proteins that are involved in both normal processes and various muscle disorders and indicate muscle tissue is undergoing active reinnervation/compensatory attempts thus providing targets for further research and therapy development in ALS. © 2018 The Author(s)."},
{"id": "85045026580", "title": "Robust stride segmentation of inertial signals based on local cyclicity estimation", "authors": ["Šprager, S.", "Jurič, M."], "abstract": "A novel approach for stride segmentation, gait sequence extraction, and gait event detection for inertial signals is presented. The approach operates by combining different local cyclicity estimators and sensor channels, and can additionally employ a priori knowledge on the fiducial points of gait events. The approach is universal as it can work on signals acquired by different inertial measurement unit (IMU) sensor types, is template-free, and operates unsupervised. A thorough evaluation was performed with two datasets: our own collected FRIgait dataset available for open use, containing long-term inertial measurements collected from 57 subjects using smartphones within the span of more than one year, and an FAU eGait dataset containing inertial data from shoe-mounted sensors collected from three cohorts of subjects: healthy, geriatric, and Parkinson’s disease patients. The evaluation was performed in controlled and uncontrolled conditions. When compared to the ground truth of the labelled FRIgait and eGait datasets, the results of our evaluation revealed the high robustness, efficiency (F-measure of about 98%), and accuracy (mean absolute error MAE in about the range of one sample) of the proposed approach. Based on these results, we conclude that the proposed approach shows great potential for its applicability in procedures and algorithms for movement analysis. © 2018 by the authors. Licensee MDPI, Basel, Switzerland."},
{"id": "85045092804", "title": "AgroDSS: A decision support system for agriculture and farming", "authors": ["Rupnik, R.", "Kukar, M.", "Vračar, P.", "Košir, D.", "Pevec, D.", "Bosnić, Z."], "abstract": "Decision support systems, data analysis and data mining have become significant tools for improving business in professional world. The emerging technologies are making the precision agriculture omnipresent and allow potential for enriching it with computer-assisted decision support systems for farm management. In this paper we describe a novel system AgroDSS that bridges the gap between agricultural systems and state-of-the-art decision support methodology. The described system is intended for integration into the existing farm management information systems and provides a cloud-based decision support toolbox, allowing farmers to upload their own data, utilize several data analysis methods and retrieve their outputs. The implemented tools include predictive modeling with explanation, accuracy evaluation, time series clustering and decomposition, and structural change detection. They can help users make predictions for simulated scenarios and better understand the dependencies (interactions) within their domain. We apply the AgroDSS system on a case study of pest population dynamics, illustrating the potential for its use. © 2018 Elsevier B.V."},
{"id": "85045390940", "title": "LiverSex computational model: Sexual aspects in hepatic metabolism and abnormalities", "authors": ["Tomaš, T.", "Urlep, Ž.", "Moškon, M.", "Mraz, M.", "Rozman, D."], "abstract": "The liver is to date the best example of a sexually dimorphic non-reproductive organ. Over 1,000 genes are differentially expressed between sexes indicating that female and male livers are two metabolically distinct organs. The spectrum of liver diseases is broad and is usually prevalent in one or the other sex, with different contributing genetic and environmental factors. It is thus difficult to predict individual's disease outcomes and treatment options. Systems approaches including mathematical modeling can aid importantly in understanding the multifactorial liver disease etiology leading toward tailored diagnostics, prognostics and therapy. The currently established computational models of hepatic metabolism that have proven to be essential for understanding of non-alcoholic fatty liver disease (NAFLD) and hepatocellular carcinoma (HCC) are limited to the description of gender-independent response or reflect solely the response of the males. Herein we present LiverSex, the first sex-based multi-tissue and multi-level liver metabolic computational model. The model was constructed based on in silico liver model SteatoNet and the object-oriented modeling. The crucial factor in adaptation of liver metabolism to the sex is the inclusion of estrogen and androgen receptor responses to respective hormones and the link to sex-differences in growth hormone release. The model was extensively validated on literature data and experimental data obtained from wild type C57BL/6 mice fed with regular chow and western diet. These experimental results show extensive sex-dependent changes and could not be reproduced in silico with the uniform model SteatoNet. LiverSex represents the first large-scale liver metabolic model, which allows a detailed insight into the sex-dependent complex liver pathologies, and how the genetic and environmental factors interact with the sex in disease appearance and progression. We used the model to identify the most important sex-dependent metabolic pathways, which are involved in accumulation of triglycerides representing initial steps of NAFLD. We identified PGC1A, PPARa, FXR, and LXR as regulatory factors that could become important in sex-dependent personalized treatment of NAFLD. © 2018 Cvitanovic Tomaš, Urlep, Moškon, Mraz and Rozman."},
{"id": "85045622668", "title": "Early machine learning research in ljubljana", "authors": ["Kononenko, I."], "abstract": "We describe early machine learning research in Ljubljana, motivated by medical diagnostic problems, in the areas of building decision trees with Assistant, the development of Naïve and Semi-Naïve Bayesian classifier and its explanations of individual predictions, and the development of ReliefF and RReliefF algorithms for non-myopic evaluation of attributes in classification and regression, respectively. Povzetek: V članku opišemo zgodnje raziskave na področju strojnega učenja v Ljubljani, ki so bile motivirane z medicinskimi diagnostičnimi problemi. Razvili smo sistem Asistent za gradnjo odločitvenih dreves, naivni in delno naivni Bayesov klasifikator in metodo razlage njunih napovedi ter algoritma ReliefF in RReliefF za nekratkovidno ocenjevanje atributov v klasifikaciji in regresiji. © 2018 Slovene Society Informatika. All rights reserved."},
{"id": "85045624452", "title": "Convolutional encoder-decoder networks for pixel-wise ear detection and segmentation", "authors": ["Emeršič, Ž.", "Gabriel, L.", "Štruc, V.", "Peer, P."], "abstract": "Object detection and segmentation represents the basis for many tasks in computer and machine vision. In biometric recognition systems the detection of the region-of-interest (ROI) is one of the most crucial steps in the processing pipeline, significantly impacting the performance of the entire recognition system. Existing approaches to ear detection, are commonly susceptible to the presence of severe occlusions, ear accessories or variable illumination conditions and often deteriorate in their performance if applied on ear images captured in unconstrained settings. To address these shortcomings, we present a novel ear detection technique based on convolutional encoder-decoder networks (CEDs). We formulate the problem of ear detection as a two-class segmentation problem and design and train a CED-network architecture to distinguish between imagepixels belonging to the ear and the non-ear class. Unlike competing techniques, our approach does not simply return a bounding box around the detected ear, but provides detailed, pixel-wise information about the location of the ears in the image. Experiments on a dataset gathered from the web (a.k.a. in the wild) show that the proposed technique ensures good detection results in the presence of various covariate factors and significantly outperforms competing methods from the literature. © The Institution of Engineering and Technology 2018."},
{"id": "85045634479", "title": "Explanation of prediction models with explain prediction", "authors": ["Robnik-Šikonja, M."], "abstract": "State-of-the-art prediction models are getting increasingly complex and incomprehensible for humans. This is problematic for many application areas, especially those where knowledge discovery is just as important as predictive performance, for example medicine or business consulting. As machine learning and artificial intelligence are playing an increasingly large role in the society through data based decision making, this is problematic also from broader perspective and worries general public as well as legislators. As a possible solution, several explanation methods have been recently proposed, which can explain predictions of otherwise opaque models. These methods can be divided into two main approaches: gradient based approaches limited to neural networks, and more general perturbation based approaches, which can be used with arbitrary prediction models. We present an overview of perturbation based approaches, and focus on a recently introduced implementation of two successful methods developed in Slovenia, EXPLAIN and IME. We first describe their working principles and visualizations of explanations, followed by the implementation in ExplainPrediction package for R environment. © 2018 Slovene Society Informatika. All rights reserved."},
{"id": "85045646700", "title": "On the optimal top-down evaluation of semantic rules", "authors": ["Slivnik, B."], "abstract": "In syntax-directed translation based on context-free grammars, a top-down construction of a derivation tree, where subtrees are constructed from left to right, is often preferred to other strategies. It makes formulation of semantic rules simpler and provides a better foundation for error recovery. In the parsing theory, it is modelled by computation producing the left parse of the input string derivation. In this paper, a criterion for the optimal printout of the left parse is defined regarding the interleaving of parser actions and printout of individual productions comprising the resulting left parse. In some cases, parsing cannot be done at all without at least some semantic rule evaluation, while in most cases interleaving of parsing and semantic rule evaluation can significantly improve error recovery and the quality of error messages. Finally, the criterion is applied to some of the most important contemporary parsing algorithms. It is shown that not all algorithms support full interleaving. © 2018 Electrotechnical Society of Slovenia. All rights reserved."},
{"id": "85046022650", "title": "Analysis of medications change in Parkinson’s disease progression data", "authors": ["Valmarska, A.", "Miljkovic, D.", "Lavrač, N.", "Robnik-Šikonja, M."], "abstract": "(2018) Journal of Intelligent Information Systems, 51 (2), pp. 339-340."},
{"id": "85046028662", "title": "A Bayesian approach to forecasting daily air-pollutant levels", "authors": ["Faganeli Pucer, J.", "Pirš, G.", "Štrumbelj, E."], "abstract": "Forecasting air-pollutant levels is an important issue, due to their adverse effects on public health, and often a legislative necessity. The advantage of Bayesian methods is their ability to provide density predictions which can easily be transformed into ordinal or binary predictions given a set of thresholds. We develop a Bayesian approach to forecasting PM<sub>10</sub> and O<sub>3</sub> levels that efficiently deals with extensive amounts of input parameters, and test whether it outperforms classical models and experts. The new approach is used to fit models for PM<sub>10</sub> and O<sub>3</sub> level forecasting that can be used in daily practice. We also introduce a novel approach for comparing models to experts based on estimated cost matrices. The results for diverse air quality monitoring sites across Slovenia show that Bayesian models outperform classical models in both PM<sub>10</sub> and O<sub>3</sub> predictions. The proposed models perform better than experts in PM<sub>10</sub> and are on par with experts in O<sub>3</sub> predictions—where experts already base their predictions on predictions from a statistical model. A Bayesian approach—especially using Gaussian processes—offers several advantages: superior performance, robustness to overfitting, more information, and the ability to efficiently adapt to different cost matrices. © 2018, Springer-Verlag London Ltd., part of Springer Nature."},
{"id": "85046449858", "title": "Deep brain stimulation of the subthalamic nucleus does not affect the decrease of decision threshold during the choice process when there is no conflict, time pressure, or reward", "authors": ["Leimbach, F.", "Georgiev, D.", "Litvak, V.", "Antoniades, C.", "Limousin, P.", "Jahanshahi, M.", "Bogacz, R."], "abstract": "During a decision process, the evidence supporting alternative options is integrated over time, and the choice is made when the accumulated evidence for one of the options reaches a decision threshold. Humans and animals have an ability to control the decision threshold, that is, the amount of evidence that needs to be gathered to commit to a choice, and it has been proposed that the subthalamic nucleus (STN) is important for this control. Recent behavioral and neurophysiological data suggest that, in some circumstances, the decision threshold decreases with time during choice trials, allowing overcoming of indecision during difficult choices. Here we asked whether this within-trial decrease of the decision threshold is mediated by the STN and if it is affected by disrupting information processing in the STN through deep brain stimulation (DBS). We assessed 13 patients with Parkinson disease receiving bilateral STN DBS six or more months after the surgery, 11 age-matched controls, and 12 young healthy controls. All participants completed a series of decision trials, in which the evidence was presented in discrete time points, which allowed more direct estimation of the decision threshold. The participants differed widely in the slope of their decision threshold, ranging from constant threshold within a trial to steeply decreasing. However, the slope of the decision threshold did not depend on whether STN DBS was switched on or off and did not differ between the patients and controls. Furthermore, there was no difference in accuracy and RT between the patients in the on and off stimulation conditions and healthy controls. Previous studies that have reported modulation of the decision threshold by STN DBS or unilateral subthalamotomy in Parkinson disease have involved either fast decision-making under conflict or time pressure or in anticipation of high reward. Our findings suggest that, in the absence of reward, decision conflict, or time pressure for decision-making, the STN does not play a critical role in modulating the within-trial decrease of decision thresholds during the choice process. © 2018 Massachusetts Institute of Technology."},
{"id": "85046735659", "title": "Stereo obstacle detection for unmanned surface vehicles by IMU-assisted semantic segmentation", "authors": ["Bovcon, B.", "Mandeljc, R.", "Perš, J.", "Kristan, M."], "abstract": "A new obstacle detection algorithm for unmanned surface vehicles (USVs) is presented. A state-of-the-art graphical model for semantic segmentation is extended to incorporate boat pitch and roll measurements from the on-board inertial measurement unit (IMU), and a stereo verification algorithm that consolidates tentative detections obtained from the segmentation is proposed. The IMU readings are used to estimate the location of horizon line in the image, which automatically adjusts the priors in the probabilistic semantic segmentation model. We derive the equations for projecting the horizon into images, propose an efficient optimization algorithm for the extended graphical model, and offer a practical IMU–camera–USV calibration procedure. Using an USV equipped with multiple synchronized sensors, we captured a new challenging multi-modal dataset, and annotated its images with water edge and obstacles. Experimental results show that the proposed algorithm significantly outperforms the state of the art, with nearly 30% improvement in water-edge detection accuracy, an over 21% reduction of false positive rate, an almost 60% reduction of false negative rate, and an over 65% increase of true positive rate, while its Matlab implementation runs in real-time. © 2018 Elsevier B.V."},
{"id": "85046893275", "title": "Grohar: Automated Visualization of Genome-Scale Metabolic Models and Their Pathways", "authors": ["Moškon, M.", "Zimic, N.", "Mraz, M."], "abstract": "Genome-scale metabolic models (GEMs) have become a powerful tool for the investigation of the entire metabolism of the organism in silico. These models are, however, often extremely hard to reconstruct and also difficult to apply to the selected problem. Visualization of the GEM allows us to easier comprehend the model, to perform its graphical analysis, to find and correct the faulty relations, to identify the parts of the system with a designated function, etc. Even though several approaches for the automatic visualization of GEMs have been proposed, metabolic maps are still manually drawn or at least require large amount of manual curation. We present Grohar, a computational tool for automatic identification and visualization of GEM (sub)networks and their metabolic fluxes. These (sub)networks can be specified directly by listing the metabolites of interest or indirectly by providing reference metabolic pathways from different sources, such as KEGG, SBML, or Matlab file. These pathways are identified within the GEM using three different pathway alignment algorithms. Grohar also supports the visualization of the model adjustments (e.g., activation or inhibition of metabolic reactions) after perturbations are induced. © Mary Ann Liebert, Inc."},
{"id": "85047253343", "title": "Symptoms and medications change patterns for Parkinson's disease patients stratification", "authors": ["Valmarska, A.", "Miljkovic, D.", "Konitsiotis, S.", "Gatsios, D.", "Lavrač, N.", "Robnik-Šikonja, M."], "abstract": "Quality of life of patients with Parkinson's disease degrades significantly with disease progression. This paper presents a step towards personalized management of Parkinson's disease patients, based on discovering groups of similar patients. Similarity is based on patients’ medical conditions and changes in the prescribed therapy when the medical conditions change. We present two novel approaches. The first algorithm discovers symptoms’ impact on Parkinson's disease progression. Experiments on the Parkinson Progression Markers Initiative (PPMI) data reveal a subset of symptoms influencing disease progression which are already established in Parkinson's disease literature, as well as symptoms that are considered only recently as possible indicators of disease progression by clinicians. The second novelty is a methodology for detecting patterns of medications dosage changes based on the patient status. The methodology combines multitask learning using predictive clustering trees and short time series analysis to better understand when a change in medications is required. The experiments on PPMI data demonstrate that, using the proposed methodology, we can identify some clinically confirmed patients’ symptoms suggesting medications change. In terms of predictive performance, our multitask predictive clustering tree approach is mostly comparable to the random forest multitask model, but has the advantage of model interpretability. © 2018 Elsevier B.V."},
{"id": "85047409502", "title": "Discriminative Correlation Filter Tracker with Channel and Spatial Reliability", "authors": ["Lukežič, A.", "Vojíř, T.", "Čehovin Zajc, L.", "Matas, J.", "Kristan, M."], "abstract": "Short-term tracking is an open and challenging problem for which discriminative correlation filters (DCF) have shown excellent performance. We introduce the channel and spatial reliability concepts to DCF tracking and provide a learning algorithm for its efficient and seamless integration in the filter update and the tracking process. The spatial reliability map adjusts the filter support to the part of the object suitable for tracking. This both allows to enlarge the search region and improves tracking of non-rectangular objects. Reliability scores reflect channel-wise quality of the learned filters and are used as feature weighting coefficients in localization. Experimentally, with only two simple standard feature sets, HoGs and colornames, the novel CSR-DCF method—DCF with channel and spatial reliability—achieves state-of-the-art results on VOT 2016, VOT 2015 and OTB100. The CSR-DCF runs close to real-time on a CPU. © 2018, Springer Science+Business Media, LLC, part of Springer Nature."},
{"id": "85047735851", "title": "Parallelization of ant system for GPU under the PRAM model", "authors": ["Brodnik, A.", "Grgurovič, M."], "abstract": "We study the parallelized ant system algorithm solving the traveling salesman problem on n cities. First, following the series of recent results for the graphics processing unit, we show that they translate to the PRAM (parallel random access machine) model. In addition, we develop a novel pheromone matrix update method under the PRAM CREW (concurrent-read exclusive-write) model and translate it to the graphics processing unit without atomic instructions. As a consequence, we give new asymptotic bounds for the parallel ant system, resulting in step complexities 0(n lglgn) on CRCW (concurrent-read concurrent-write) and O(nlgn) on CREW variants of PRAM using n <sup>2</sup> processors in both cases. Finally, we present an experimental comparison with the currently known pheromone matrix update methods on the graphics processing unit and obtain encouraging results. © Slovak Academy of Sciences - Institute of Informatics."},
{"id": "85047956118", "title": "Geographical mapping of visitor flow in tourism: A user-generated content approach", "authors": ["Cvelbar, L.", "Mayr, M.", "Vavpotic, D."], "abstract": "The available technology enables us to access a large amount of data shared by tourists on tourism web platforms. Such data include the exact geographical location visited, the time of a visit, and the identifier of a visitor. This article aims to identify the visitor flows in the North East Adriatic region. Visitor flows are groups of repetitive movements of visitors through the geographical space within a certain travel. We identified 31 groups of strategic visitor flows between 188 destinations in the region. The proposed methodological approach is unique and had not been used in this context before. By connecting new approaches in destination management and economic planning, we aim to improve the theoretical and practical knowledge in this field. © The Author(s) 2018."},
{"id": "85048205212", "title": "Convexity in complex networks", "authors": ["Marc, T.", "Šubelj, L."], "abstract": "Metric graph properties lie in the heart of the analysis of complex networks, while in this paper we study their convexity through mathematical definition of a convex subgraph. A subgraph is convex if every geodesic path between the nodes of the subgraph lies entirely within the subgraph. According to our perception of convexity, convex network is such in which every connected subset of nodes induces a convex subgraph. We show that convexity is an inherent property of many networks that is not present in a random graph. Most convex are spatial infrastructure networks and social collaboration graphs due to their tree-like or clique-like structure, whereas the food web is the only network studied that is truly non-convex. Core-periphery networks are regionally convex as they can be divided into a non-convex core surrounded by a convex periphery. Random graphs, however, are only locally convex meaning that any connected subgraph of size smaller than the average geodesic distance between the nodes is almost certainly convex. We present different measures of network convexity and discuss its applications in the study of networks. © 2018 Cambridge University Press."},
{"id": "85048623179", "title": "Impact of subthalamic deep brain stimulation frequency on upper limb motor function in Parkinson's disease", "authors": ["Momin, S.", "Mahlknecht, P.", "Georgiev, D.", "Foltynie, T.", "Zrinzo, L.", "Hariz, M.", "Zacharia, A.", "Limousin, P."], "abstract": "Background: Whilst changes in the frequency of subthalamic deep brain stimulation (STN-DBS) have been proposed to improve control of tremor or axial motor features in Parkinson's disease (PD), little is known about the effects of frequency changes on upper limb motor function, particularly bradykinesia. Objective: To investigate the acute effects of various STN-DBS frequencies (40-160 Hz, 40 Hz intervals) on upper limb motor function. Methods: We carried out a randomised, double-blind study on 20 PD patients with chronic STN-DBS using the Simple and Assembly components of the Purdue Pegboard (PP) test and a modified upper limb version of the UPDRS-III (UL-UPDRS-III). Results: There was no significant effect of frequency on bradykinesia on the Simple PP task or the UL-UPDRS-III. There was an effect of frequency on the Assembly PP score when comparing all frequencies (p = 0.019) and between 80 Hz and 130 Hz (p = 0.007), with lower frequencies yielding a better performance. Rigidity and Tremor scores were significantly reduced with higher (80 Hz) compared to lower (40 Hz) frequencies. Conclusions: Our findings suggest that a wide range of frequencies are efficacious in improving acute upper-limb motor function. Reducing the frequency of stimulation down to 80 Hz is safe and has a similar clinical effect to higher frequencies. Therefore, a wider range of frequencies are available when it comes adjusting patients' acute settings without the risk of worsening bradykinesia. © 2018-IOS Press and the authors. All rights reserved."},
{"id": "85048828630", "title": "Graphlet counting", "authors": ["Hočevar, T."], "abstract": "Graphlet analysis describes a graph's topology by observing frequencies of 4-or 5-node induced subgraphs (graphlets) in the graph. We developed a graphlet counting approach based on a system of linear equations that relate the graphlet counts. For sparse large networks, such as those appearing in bioinformatics, the resulting algorithm is an order of magnitude faster than the existing approaches. © 2018 Slovak University of Technology in Bratislava. All rights reserved."},
{"id": "85048878604", "title": "Identifying typical approaches and errors in Prolog programming with argument-based machine learning", "authors": ["Možina, M.", "Lazar, T.", "Bratko, I."], "abstract": "Students learn programming much faster when they receive feedback. However, in programming courses with high student-teacher ratios, it is practically impossible to provide feedback to all homeworks submitted by students. In this paper, we propose a data-driven tool for semi-automatic identification of typical approaches and errors in student solutions. Having a list of frequent errors, a teacher can prepare common feedback to all students that explains the difficult concepts. We present the problem as supervised rule learning, where each rule corresponds to a specific approach or error. We use correct and incorrect submitted programs as the learning examples, where patterns in abstract syntax trees are used as attributes. As the space of all possible patterns is immense, we needed the help of experts to select relevant patterns. To elicit knowledge from the experts, we used the argument-based machine learning (ABML) method, in which an expert and ABML interactively exchange arguments until the model is good enough. We provide a step-by-step demonstration of the ABML process, present examples of ABML questions and corresponding expert's answers, and interpret some of the induced rules. The evaluation on 42 Prolog exercises further shows the usefulness of the knowledge elicitation process, as the models constructed using ABML achieve significantly better accuracy than the models learned from human-defined patterns or from automatically extracted patterns. © 2018 Elsevier Ltd"},
{"id": "85049077640", "title": "Extreme value correction: a method for correcting optimistic estimations in rule learning", "authors": ["Možina, M.", "Demšar, J.", "Bratko, I.", "Žabkar, J."], "abstract": "Machine learning algorithms rely on their ability to evaluate the constructed hypotheses for choosing the optimal hypothesis during learning and assessing the quality of the model afterwards. Since these estimates, in particular the former ones, are based on the training data from which the hypotheses themselves were constructed, they are usually optimistic. The paper shows three different solutions; two for the artificial boundary cases with the smallest and the largest optimism and a general correction procedure called extreme value correction (EVC) based on extreme value distribution. We demonstrate the application of the technique to rule learning, specifically to estimating classification accuracy of a single rule, and evaluate it on an artificial data set and on a number of UCI data sets. We observed that the correction successfully improved the accuracy estimates. We also describe an approach for combining rules into a linear global classifier and show that using EVC estimates leads to more accurate classifiers. © 2018, The Author(s)."},
{"id": "85049181019", "title": "Computational modelling of liver metabolism and its applications in research and the clinics", "authors": ["Tomaš, T.", "Moškon, M.", "Mraz, M.", "Rozman, D."], "abstract": "Computational models of liver metabolism are gaining an increasing importance within the research community. Moreover, their first clinical applications have been reported in recent years in the context of personalised and systems medicine. Herein, we survey selected experimental models together with the computational modelling approaches that are used to describe the metabolic processes of the liver in silico. We also review the recent developments in the large-scale hepatic computational models where we focus on object-oriented models as a part of our research. The object-oriented modelling approach is beneficial in efforts to describe the interactions between the tissues, such as how metabolism of the liver interacts with metabolism of other tissues via blood. Importantly, this modelling approach can account as well for transcriptional and post-translational regulation of metabolic reactions which is a difficult task to achieve. The current and potential clinical applications of large-scale hepatic models are also discussed. We conclude with the future perspectives within the systems and translational medicine research community. © 2018 Slovensko Kemijsko Drustvo. All Rights Reserved."},
{"id": "85049325715", "title": "Open-source tool for interactive digitisation of pluviograph strip charts", "authors": ["Sušin, N.", "Peer, P."], "abstract": "The analysis of weather requires data collected over long periods of time. Rainfall intensity is one of the basic weather measurements. Paper strip charts were used in the past, and in some parts of the world are used even today, to record rainfall intensity over a given period of time. Since most modern analysis takes place on computers, we need a way to digitise historical data to be able to process it. An existing automated algorithm was adapted and implemented in an interactive program to solve this task. The algorithm automatically processes images of rainfall charts and allows users to manually correct any errors, resulting in a very accurate reading. This paper documents how the program works, the results it gives and the underlying problem itself. It also offers some commentary on computer-aided digitisation of other strip charts. The software is freely available on the web under an open-source license and serves as a base for continued growth and evolution by contributions from the community. © 2017 Royal Meteorological Society"},
{"id": "85049332347", "title": "“It's so vital to learn Slovene”: Mediation choices by asylum seekers in Slovenia", "authors": ["Pokorn, N.", "Čibej, J."], "abstract": "Short-time migrants, who stay in the host country from one to 12 months, use mediation strategies including lingua francas, public-service interpreting and translation, translation technologies, intercomprehension, and learning the host country's dominant language. The choices made by asylum seekers in Slovenia, a country of transit for the majority of asylum seekers, are analyzed on the basis of questionnaires answered by 127 current and former residents of the Slovene asylum seeker centers in 2016, followed up by semi-structured interviews with a representative group of 34 asylum seekers. The results show that the majority of newly arrived migrants regard the use of lingua francas as a helpful but not desired long-term strategy. They define host-country language learning as the most desirable strategy for linguistic and social inclusion. Surprisingly, they are reluctant to use translation technologies and interpreters because they either doubt the accuracy of the transfer or they consider such mediation (interpreting in particular) a hindrance to their independence. © John Benjamins Publishing Company."},
{"id": "85049343765", "title": "BPMN extensions for automating cloud environments using a two-layer orchestration approach", "authors": ["Dukaric, R.", "Juric, M."], "abstract": "Cloud orchestration describes the automated arrangement, coordination, and management of complex cloud systems, middleware and services, and is realized by orchestrating workflows. To achieve an end-to-end cloud orchestration, workflow designers usually have to cope with integration challenges between two different technologies – one that entails technical cloud orchestration and another comprising business-level orchestration. This however presents a complex undertaking for workflow designers, as they have to gain sufficient knowledge and expertise of two diverse technologies in order to automate cloud-specific tasks across two different domains. Introduction of a unified orchestration platform would solve these issues, as it would deliver a common vocabulary for different types of workflow designers and would provide them with a single platform for orchestrating both business and technical activities, without having to face the integration complexities. The main objective of this paper is to provide support for cloud-specific workflows in BPMN business process engines. To achieve this objective we (1) define a meta-model for modeling cloud workflows, (2) extend BPMN 2.0.2 specification to orchestrate cloud-specific workflow activities, and (3) implement a meta-model with BPMN extensions by showing how cloud orchestration workflow elements (i.e. activities and workflow control) map onto extended BPMN elements. As a part of the evaluation we measure process size and complexity of two process models using various process metrics. The results have shown that when using our proposed BPMN extensions, the overall size and complexity of the use case process under test has been reduced by more than half on an average. We also improve the readability of BPMN process. © 2018 Elsevier Ltd"},
{"id": "85049345150", "title": "“Do I want to learn a language spoken by two million people?”: Mediation choices by mid-term and long-term migrants", "authors": ["Pokorn, N.", "Čibej, J."], "abstract": "Migrants' intended length of stay influences their choices between using a lingua franca, language technology, ad-hoc interpreters and translators, intercomprehension, or learning the host country's dominant language. To study this influence, data were collected through a questionnaire, semi-structured interviews, and a focus-group discussion from 15 long-term migrants (university language teachers) and eight mid-term migrants (teachers at two international schools) working in Slovenia. The results show that the long-term migrants all learned the host language, while the most common mediation strategy of the mid-term migrants was use of a lingua franca. Ad-hoc interpreters and translators were used not only in healthcare but also for the translations of official documents. Moreover, the French-speaking mid-term migrants attempted to learn the host language and often ended up learning English, while the group of native English speakers tended to form a linguistic enclave. It is argued that the preferred mediation strategy depends not just on the intended length of stay but also on the status of the migrant's L1 in the particular host country. © John Benjamins Publishing Company."},
{"id": "85049360954", "title": "Syntax-based analysis of programming concepts in python", "authors": ["Možina, M.", "Lazar, T."], "abstract": "Writing programs is essential to learning programming. Most programming courses encourage students to practice with lab and homework assignments. By analyzing solutions to these exercises teachers can discover mistakes and concepts students are struggling with, and use that knowledge to improve the course. Students however tend to submit many different programs even for simple exercises, making such analysis difficult. We propose using tree regular expressions to encode common patterns in programs. Based on these patterns we induce rules describing common approaches and mistakes for a given assignment. In this paper we present a case study of rule-based analysis for an introductory Python exercise. We show that our rules are easy to interpret, and can be learned from a relatively small set of programs. © Springer International Publishing AG, part of Springer Nature 2018."},
{"id": "85049510055", "title": "Impact of changes in climate on air pollution in Slovenia between 2002 and 2017", "authors": ["Faganeli Pucer, J.", "Štrumbelj, E."], "abstract": "Air pollutant levels depend on emissions but can also be affected by the meteorological situation. We examined air pollutant trends (PM<sub>10</sub>, NO<sub>2</sub>, O<sub>3</sub> and SO<sub>2</sub>) in Slovenia, where in the past the main issue were SO<sub>2</sub> levels. Now, the population is still exposed to PM<sub>10</sub> and ozone levels that are above the recommended levels. Our goal was to assess if the levels of air pollutants were decreasing from 2002 to 2017 due to emission ceilings or were more influenced by changes in the meteorological situation. We modelled the relationship between levels, meteorological parameters, and seasonality and then used the models with the best estimated generalisation to adjust levels for meteorology. Models showed a significant relationship between meteorological parameters and PM<sub>10</sub>, NO<sub>2</sub>, and O<sub>3</sub> levels, but not SO<sub>2</sub>. We analysed trends of raw and adjusted levels and compared them. Trends of PM<sub>10</sub> and SO<sub>2</sub> were decreasing at all locations for raw and adjusted data. The largest decrease was observed in SO<sub>2</sub> levels where the largest decrease in emissions occurred. Trends of NO<sub>2</sub> were also significant and negative at most locations. Levels of O<sub>3</sub> did not exhibit a significant trend at most locations. Results show that changes in the meteorological situation affected PM<sub>10</sub> levels the most, especially where the entire period (2002–2017) could be observed. There is strong empirical evidence that changes in meteorological parameters contributed to the decrease in PM<sub>10</sub> levels while the decrease in NO<sub>2</sub> and SO<sub>2</sub> levels can be attributed to emission ceilings. © 2018 Elsevier Ltd"},
{"id": "85049896571", "title": "Process models of interrelated speech intentions from online health-related conversations", "authors": ["Epure, E.", "Compagno, D.", "Salinesi, C.", "Deneckere, R.", "Bajec, M.", "Žitnik, S."], "abstract": "Being related to the adoption of new beliefs, attitudes and, ultimately, behaviors, analyzing online communication is of utmost importance for medicine. Multiple health care, academic communities, such as information seeking and dissemination and persuasive technologies, acknowledge this need. However, in order to obtain understanding, a relevant way to model online communication for the study of behavior is required. In this paper, we propose an automatic method to reveal process models of interrelated speech intentions from conversations. Specifically, a domain-independent taxonomy of speech intentions is adopted, an annotated corpus of Reddit conversations is released, supervised classifiers for speech intention prediction from utterances are trained and assessed using 10-fold cross validation (multi-class, one-versus-all and multi-label setups) and an approach to transform conversations into well-defined, representative logs of verbal behavior, needed by process mining techniques, is designed. The experimental results show that: (1) the automatic classification of intentions is feasible (with Kappa scores varying between 0.52 and 1); (2) predicting pairs of intentions, also known as adjacency pairs, or including more utterances from even other heterogeneous corpora can improve the predictions of some classes; and (3) the classifiers in the current state are robust to be used on other corpora, although the results are poorer and suggest that the input corpus may not sufficiently capture varied ways of expressing certain speech intentions. The extracted process models of interrelated speech intentions open new views on grasping the formation of beliefs and behavioral intentions in and from speech, but in-depth evaluation of these conversational models is further required. © 2018 Elsevier B.V."},
{"id": "85049998882", "title": "Application for viral hepatitis infection risk assessment-HEPY", "authors": ["Ajanović, A.", "Ulčar, A.", "Peterlin, A.", "Počivavšek, K.", "Fele-Žorž, G.", "Gradišek, A.", "Gams, M.", "Matičič, M."], "abstract": "We present a web application to inform users about different types of viral hepatitises. The core of the application is a questionnaire about past behavior and risk factors. Based on the answers, it produces a personalised overview of any risky actions that the user might have taken in the past. The site also contains general information about these diseases, which can help users identify them or seek proper precautions in order to avoid them. © 2018 Slovene Society Informatika. All rights reserved."},
{"id": "85050187845", "title": "Effective collection and selection of research articles for a systematic review", "authors": ["Rozanc, I."], "abstract": "The first step in any research work is to gain a better understanding of selected research topic and its placement in the research field. To achieve this a Systematic Review (SR) is usually performed in one of two forms. A Systematic Literature Review (SLR) addresses a specific research question by providing insight into selected literature, while a Systematic Mapping Study (SMS) uses a principle of classification of a large number of collected articles to present a wider picture of the research topic. In both cases, the collection and selection of proper articles are crucial. Due to a lot of available articles from different sources and its diverse quality, a lot of tedious (often manual) work is required. This article addresses the issues of effective collection and selection of an appropriate set of articles. First, the importance of using suitable guidelines for conducting an SR is presented. Then, the practical considerations for the collection of articles are shown with an emphasis on effective search in Digital Libraries (DLs). Finally, the issues connected with an effective selection of an appropriate set of articles (from all collected) is described. In this part, we advise to collect as many articles as possible and perform sequential three-step selection to efficiently eliminate the obviously incorrect ones without a tedious manual screening of entire article contents. © 2018 Croatian Society MIPRO."},
{"id": "85050249609", "title": "A web-based virtual reality environment for medical visualization", "authors": ["Kokelj, Z.", "Bohak, C.", "Marolt, M."], "abstract": "In this paper, we present a novel approach to integrating virtual reality (VR) into a web-based medical visualization framework. The framework supports visualization of volumetric data, such as 3D scalar fields acquired by a CT, MRI or PET scanners. To improve users' perception, understanding and manipulation of 3D volumes, we adapted the traditional 2D screen representation with support for visualization of data in a VR environment. By providing complete visual immersion, VR can help users to gain better insights and understanding of the visualized data. Our main goal was to allow users to view the medical data in VR and interact with it with hand-held controllers for better immersion and spatial perception. In the paper, we present a novel approach to implementation of VR for medical imaging, which combines WebGL-based hardware accelerated web visualization with VR. This allows users to use the visualization framework with or without a VR headset by switching between 'standard' and 'VR' modes. Since visualization runs in a web browser, it is portable, easy to use on different devices and therefore accessible to a broad number of users. The visualization system was tested with real medical scans to assess its performance and usability. © 2018 Croatian Society MIPRO."},
{"id": "85050290453", "title": "Web-Based Vascular Flow Simulation Visualization with Lossy Data Compression for Fast Transmission", "authors": ["Oblak, R.", "Bohak, C.", "Marolt, M."], "abstract": "In this paper, we present a web-based system for visualization of flow simulation results in the vascular system for use with consumer-level hardware. The presented tool allows users to design, execute and visualize a flow simulation with a simple workflow on a desktop computer or a mobile device. The web interface allows users to select a vascular model, define the flow simulation parameters, execute the simulation, and interactively visualize the simulation results in real time using multiple visualization techniques. The server-side prepares the model for simulation and performs the simulation using SimVascular. To provide a more efficient transfer of the large amounts of simulation results to the web client, as well as reduce storage requirements on the server, we introduce a novel hybrid lossy compression method. The method uses an octree data subdivision approach combined with an iterative approach that regresses the data points to a B-Spline volume. The evaluation results show that our method achieves compression ratios of up to 5.7 for the tested examples at a given error rate, comparable to other approaches while specifically intended for visualization purposes. © 2018, Springer International Publishing AG, part of Springer Nature."},
{"id": "85050341447", "title": "Vulkan abstraction layer for large data remote rendering system", "authors": ["Lavrič, P.", "Bohak, C.", "Marolt, M."], "abstract": "New graphics APIs require users to implement a lot of needed functionality, such as memory management, by themselves. In this paper we present an abstraction layer build on top of such API, in our case the Vulkan API, for purpose of off-screen rendering of large data. We also present a use case for such abstraction layer implementation – a remote rendering system for simple Path Tracing accessible through web-based client-side application. The preliminary evaluation results show that implementation of simple Path Tracer is significantly faster then comparable implementation in OpenCL. In conclusion we also present possible extension and improvements of the developed abstraction layer. © Springer International Publishing AG, part of Springer Nature 2018."},
{"id": "85050367700", "title": "Web-based real-time LADAR data visualization with multi-user collaboration support", "authors": ["Bohak, C.", "Kim, B.", "Kim, M."], "abstract": "In this paper we present a web-based visualization system developed for visualizing real-time point cloud data obtained from LADAR (or other) sensors. The system allows direct visualization of captured data, visualization of data from database or visualization of preprocessed data (e.g. labeled or classified data). The system allows the concurrent visualization from same or different data-sources on multiple clients in the web browser. Due to the use of modern web technologies the client can also be used on mobile devices. The system is developed using modern client- and server-side web technologies. The system allows connection with an existing LADAR sensor grabber applications through use of UDP sockets. Both server- and client-side parts of the system are modular and allow the integration of newly developed modules and designing a specific work-flow scenarios for target end-user groups. The system allows the interactive visualization of datasets with millions of points as well as streaming visualization with high throughput speeds. © Springer International Publishing AG, part of Springer Nature 2018."},
{"id": "85050504512", "title": "Dependability of Container-Based Data-Centric Systems", "authors": ["Kochovski, P.", "Stankovski, V."], "abstract": "Nowadays, many Cloud computing systems and applications have to be designed to be able to cope with the four Vs of the Big Data problem: volume, variety, veracity, and velocity. In this context, an important property in such systems is dependability. Dependability is a measure of the availability, reliability, tractability, response time, durability, security, and other aspects of the system. Dependability has been well established as an important property in services science and systems engineering; however, data-centric systems may have some specific requirements due to a variety of technologies that are still maturing and evolving. The goal of the present work is to establish the main aspects of dependability in data-centric systems and to analyze to what extent various Cloud computing technologies can be used to achieve this property. Particular attention is given to the use of container-based technologies that represent a novel, lightweight form of virtualization. The practical part of the chapter presents examples of highly dependable data-centric systems, such as ENTICE and SWITCH, suitable for the Internet of Things (IoT) and the Big Data era. © 2018 2018 Elsevier Inc. All rights reserved."},
{"id": "85050549463", "title": "Accurate indoor sound level measurement on a low-power and low-cost wireless sensor node", "authors": ["Risojević, V.", "Rozman, R.", "Pilipović, R.", "Češnovar, R.", "Bulić, P."], "abstract": "Wireless sensor networks can provide a cheap and flexible infrastructure to support the measurement of noise pollution. However, the processing of the gathered data is challenging to implement on resource-constrained nodes, because each node has its own limited power supply, low-performance and low-power micro-controller unit and other limited processing resources, as well as limited amount of memory. We propose a sensor node for monitoring of indoor ambient noise. The sensor node is based on a hardware platform with limited computational resources and utilizes several simplifications to approximate more complex and costly signal processing stage. Furthermore, to reduce the communication between the sensor node and a sink node, as well as the power consumed by the IEEE 802.15.4 (ZigBee) transceiver, we perform digital A-weighting filtering and non-calibrated calculation of the sound pressure level on the node. According to experimental results, the proposed sound level meter can accurately measure the noise levels of up to 100 dB, with the mean difference of less than 2 dB compared to Class 1 sound level meter. The proposed device can continuously monitor indoor noise for several days. Despite the limitations of the used hardware platform, the presented node is a promising low-cost and low-power solution for indoor ambient noise monitoring. © 2018 by the authors. Licensee MDPI, Basel, Switzerland."},
{"id": "85050646459", "title": "Real-Time interactive platform-Agnostic volumetric path tracing in WebGL 2.0", "authors": ["Lesar, Ž.", "Bohak, C.", "Marolt, M."], "abstract": "Path tracing has become a de facto standard for photo-realistic rendering due to its conceptual and algorithmic simplicity. Over the last few years, it has been successfully applied to the rendering of participating media, although it has not seen widespread adoption. Most implementations are targeted at speciic platforms or hardware, which makes them diicult to deploy or extend. However, recent advancements in web technologies enable us to access graphics hardware from a web browser in a platform-agnostic manner. Therefore, in this paper, we present an implementation of a state-ofthe-art volumetric path tracer developed in JavaScript using WebGL 2.0. The presented solution supports the use of arbitrary 2D transfer functions and heterogeneous volumetric data, aims to be interactive, platform-agnostic, easily extensible, and runs in real-time - both on desktop and mobile devices. © 2018 Association for Computing Machinery."},
{"id": "85050807989", "title": "A topological approach to delineation and arrhythmic beats detection in unprocessed long-term ECG signals", "authors": ["Faganeli Pucer, J.", "Kukar, M."], "abstract": "Background and objective: Arrhythmias are one of the most common symptoms of cardiac failure. They are usually diagnosed using ECG recordings, particularly long ambulatory recordings (AECG). These recordings are tedious to interpret by humans due to their extent (up to 48 h) and the relative scarcity of arrhythmia events. This makes automated systems for detecting various AECG anomalies indispensable. In this work we present a novel procedure based on topological principles (Morse theory) for detecting arrhythmic beats in AECG. It works in nearly real-time (delayed by a 14 s window), and can be applied to raw (unprocessed) ECG signals. Methods: The procedure is based on a subject-specific adaptation of the one-dimensional discrete Morse theory (ADMT), which represents the signal as a sequence of its most important extrema. The ADMT algorithm is applied twice; for low-amplitude, high-frequency noise removal, and for detection of the characteristic waves of individual ECG beats. The waves are annotated using the ADMT algorithm and template matching. The annotated beats are then compared to the adjacent beats with two measures of similarity: the distance between two beats, and the difference in shape between them. The two measures of similarity are used as inputs to a decision tree algorithm that classifies the beats as normal or abnormal. The classification performance is evaluated with the leave-one-record-out cross-validation method. Results: Our approach was tested on the MIT-BIH database, where it exhibited a classification accuracy of 92.73%, a sensitivity of 73.35%, a specificity of 96.70%, a positive predictive value of 88.01%, and a negative predictive value of 95.73%. Conclusions: Compared to related studies, our algorithm requires less preprocessing while retaining the capability to detect and classify beats in almost real-time. The algorithm exhibits a high degree of accuracy in beats detection and classification that are at least comparable to state-of-the-art methods. © 2018 Elsevier B.V."},
{"id": "85050871091", "title": "Social media comparison and analysis: The best data source for research?", "authors": ["Blagus, N.", "Žitnik, S."], "abstract": "In the past decade, social media has become an important part of our everyday life. The employment of different social media changes the way we communicate, collaborate, gather information and consequently perceive the world around us. Thus, researchers from different fields exploit the social media to provide deeper insight into human behaviour. Each social media possesses its own privacy politics and access to publicly available data. In this paper, we present a generic framework along with the tools to analyse different social media. The analysis shows basic usage statistics, reach and engagement differences, language, sentiment and gender identification of each social network data. We compare data from Twitter, Facebook, Tumblr, Google+ and YouTube. The results reveal specifics of each social media, which to some extent also depend on the data available and the selected seed keywords. We uncover that popularity of selected topics in social media is proportional to the number of hits on Google, celebrities and politicians are the most talked topics and that behaviour of users across social media is different. For example, Twitter users prefer to post more, while Facebook and Youtube users prefer to comment. The majority of all social media posts are in English, larger number of them are negative and often written by male users. The results of the proposed framework should serve as a tool to identify the appropriate source of data for the representative analysis of social media. © 2018 IEEE."},
{"id": "85050945099", "title": "Compression of convolutional neural networks: A short survey", "authors": ["Pilipović, R.", "Bulić, P.", "Risojević, V."], "abstract": "Nowadays, convolutional neural networks (CNN) are considered as the state-of-the-art algorithms for various tasks, especially for image classification and recognition. Because of that, more and more attention is aimed towards implementation of CNNs on embedded systems. Main obstacles for implementing CNNs on embedded systems are their large model size and large number of operations needed for inference. In order to surpass these obstacles, algorithms for CNN compression tend to lower model size and number of operations needed for inference. In this paper we review the state-of-the-art in CNN compression. To this end we divided all approaches for CNN compression into three groups: precision reduction, network pruning and design of compact network architectures. After presenting the main approaches in each group we conclude that the future CNN compression algorithms should be co-designed with hardware which will process deep learning algorithms. © 2018 IEEE."},
{"id": "85050962059", "title": "A Compact Convolutional Neural Network for Textured Surface Anomaly Detection", "authors": ["Racki, D.", "Tomazevic, D.", "Skocaj, D."], "abstract": "Convolutional neural methods have proven to outperform other approaches in various computer vision tasks. In this paper we apply the deep learning technique to the domain of automated visual surface inspection. We design a unified CNN-based framework for segmentation and detection of surface anomalies. We investigate whether a compact CNN architecture, which exhibit fewer parameters that need to be learned, can be used, while retaining high classification accuracy. We propose and evaluate a compact CNN architecture on a dataset consisting of diverse textured surfaces with variously-shaped weakly-labeled anomalies. The proposed approach achieves state-of-the-art results in terms of anomaly segmentation as well as classification. © 2018 IEEE."},
{"id": "85050981395", "title": "SSBC 2018: Sclera segmentation benchmarking competition", "authors": ["Das, A.", "Pal, U.", "Ferrer, M.", "Blumenstein, M.", "Stepec, D.", "Rot, P.", "Emersic, Z.", "Peer, P.", "Struc, V."], "abstract": "This paper summarises the results of the Sclera Segmentation Benchmarking Competition (SSBC 2018). It was organised in the context of the 11th IAPR International Conference on Biometrics (ICB 2018). The aim of this competition was to record the developments on sclera segmentation in the cross-sensor environment (sclera trait captured using multiple acquiring sensors). Additionally, the competition also aimed to gain the attention of researchers on this subject of research. For the purpose of benchmarking, we have developed two datasets of sclera images captured using different sensors. The first dataset was collected using a DSLR camera and the second one was collected using a mobile phone camera. The first dataset is the Multi-Angle Sclera Dataset (MASD version 1), which was used in the context of the previous versions of sclera segmentation competitions. The images in the second dataset were captured using.a mobile phone rear camera of 8-megapixel. As baseline manual segmentation mask of the sclera images from both the datasets were developed. Precision and recall-based statistical measures were employed to evaluate the effectiveness of the submitted segmentation technique and to rank them. Six algorithms were submitted towards the segmentation task. This paper analyses the results produced by these algorithms/system and defines a way forward for this subject of research. Both the datasets along with some of the accompanying ground truth/baseline mask will be freely available for research purposes upon request to authors by email. © 2018 IEEE."},
{"id": "85051631744", "title": "Generating inter-dependent data streams for recommender systems", "authors": ["Jakomin, M.", "Curk, T.", "Bosnić, Z."], "abstract": "Recommender systems are essential tools in modern e-commerce, streaming services, search engines, social networks and many other areas including the scientific community. However, lack of publicly available data hinders the development and evaluation of recommender algorithms. To address this problem, we propose a Generator of Inter-dependent Data Streams (GIDS), capable of generating multiple temporal and inter-dependent synthetic datasets of relational data. The generator is able to simulate a collection of time-changing data streams, helping to effectively evaluate a variety of recommender systems, data fusion algorithms and incremental algorithms. The evaluation using recommender and data fusion algorithms showed that our generator can successfully mimic real datasets in terms of statistical data properties, and achieved performance of recommender systems. © 2018"},
{"id": "85052330915", "title": "From hype to reality: Data science enabling personalized medicine", "authors": ["Fröhlich, H.", "Balling, R.", "Beerenwinkel, N.", "Kohlbacher, O.", "Kumar, S.", "Lengauer, T.", "Maathuis, M.", "Moreau, Y.", "Murphy, S.", "Przytycka, T.", "Rebhan, M.", "Röst, H.", "Schuppert, A.", "Schwab, M.", "Spang, R.", "Stekhoven, D.", "Sun, J.", "Weber, A.", "Ziemek, D.", "Zupan, B."], "abstract": "Background: Personalized, precision, P4, or stratified medicine is understood as a medical approach in which patients are stratified based on their disease subtype, risk, prognosis, or treatment response using specialized diagnostic tests. The key idea is to base medical decisions on individual patient characteristics, including molecular and behavioral biomarkers, rather than on population averages. Personalized medicine is deeply connected to and dependent on data science, specifically machine learning (often named Artificial Intelligence in the mainstream media). While during recent years there has been a lot of enthusiasm about the potential of 'big data' and machine learning-based solutions, there exist only few examples that impact current clinical practice. The lack of impact on clinical practice can largely be attributed to insufficient performance of predictive models, difficulties to interpret complex model predictions, and lack of validation via prospective clinical trials that demonstrate a clear benefit compared to the standard of care. In this paper, we review the potential of state-of-the-art data science approaches for personalized medicine, discuss open challenges, and highlight directions that may help to overcome them in the future. Conclusions: There is a need for an interdisciplinary effort, including data scientists, physicians, patient advocates, regulatory agencies, and health insurance organizations. Partially unrealistic expectations and concerns about data science-based solutions need to be better managed. In parallel, computational methods must advance more to provide direct benefit to clinical practice. © 2018 The Author(s)."},
{"id": "85052705123", "title": "Sliding suffix tree", "authors": ["Brodnik, A.", "Jekovec, M."], "abstract": "We consider a sliding windowW over a stream of characters from some alphabet of constant size. We want to look up a pattern in the current sliding window content and obtain all positions of the matches. We present an indexed version of the sliding window, based on a suffix tree. The data structure of size Θ(|W|) has optimal time queries Θ(m + occ) and amortized constant time updates, where m is the length of the query string and occ is its number of occurrences. © 2018 by the authors."},
{"id": "85052788545", "title": "Characterization and automatic classification of preterm and term uterine records", "authors": ["Jager, F.", "Libenšek, S.", "Geršak, K."], "abstract": "Predicting preterm birth is uncertain, and numerous scientists are searching for noninvasive methods to improve its predictability. Current researches are based on the analysis of ElectroHysteroGram (EHG) records, which contain information about the electrophysiological properties of the uterine muscle and uterine contractions. Since pregnancy is a long process, we decided to also characterize, for the first time, non-contraction intervals (dummy intervals) of the uterine records, i.e., EHG signals accompanied by a simultaneously recorded external tocogram measuring mechanical uterine activity (TOCO signal). For this purpose, we developed a new set of uterine records, TPEHGT DS, containing preterm and term uterine records of pregnant women, and uterine records of non-pregnant women. We quantitatively characterized contraction intervals (contractions) and dummy intervals of the uterine records of the TPEHGT DS in terms of the normalized power spectra of the EHG and TOCO signals, and developed a new method for predicting preterm birth. The results on the characterization revealed that the peak amplitudes of the normalized power spectra of the EHG and TOCO signals of the contraction and dummy intervals in the frequency band 1.0-2.2 Hz, describing the electrical and mechanical activity of the uterus due to the maternal heart (maternal heart rate), are high only during term pregnancies, when the delivery is still far away; and they are low when the delivery is close. However, these peak amplitudes are also low during preterm pregnancies, when the delivery is still supposed to be far away (thus suggesting the danger of preterm birth); and they are also low or barely present for non-pregnant women. We propose the values of the peak amplitudes of the normalized power spectra due to the influence of the maternal heart, in an elec-tro-mechanical sense, in the frequency band 1.0-2.2 Hz as a new biophysical marker for the preliminary, or early, assessment of the danger of preterm birth. The classification of preterm and term, contraction and dummy intervals of the TPEHGT DS, for the task of the automatic prediction of preterm birth, using sample entropy, the median frequency of the power spectra, and the peak amplitude of the normalized power spectra, revealed that the dummy intervals provide quite comparable and slightly higher classification performances than these features obtained from the contraction intervals. This result suggests a novel and simple clinical technique, not necessarily to seek contraction intervals but using the dummy intervals, for the early assessment of the danger of preterm birth. Using the publicly available TPEHG DB database to predict preterm birth in terms of classifying between preterm and term EHG records, the proposed method outperformed all currently existing methods. The achieved classification accuracy was 100% for early records, recorded around the 23rd week of pregnancy; and 96.33%, the area under the curve of 99.44%, for all records of the database. Since the proposed method is capable of using the dummy intervals with high classification accuracy, it is also suitable for clinical use very early during pregnancy, around the 23rd week of pregnancy, when contractions may or may not be present. © 2018 Jager et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited."},
{"id": "85052969699", "title": "Is science driven by principal investigators?", "authors": ["Kastrin, A.", "Klisara, J.", "Lužar, B.", "Povh, J."], "abstract": "In this paper we consider the question what is the scientific and career performance of principal investigators (PI’s) of publicly funded research projects compared to scientific performance of all researchers. Our study is based on high quality data about (1) research projects awarded in Slovenia in the period 1994–2016 (7508 projects with 2725 PI’s in total) and (2) about scientific productivity of all researchers in Slovenia that were active in the period 1970–2016—there are 19,598 such researchers in total, including the PI’s. We compare average productivity, collaboration, internationality and interdisciplinarity of PI’s and of all active researchers. Our analysis shows that for all four indicators the average performance of PI’s is much higher compared to average performance of all active researchers. Additionally, we analyze careers of both groups of researchers. The results show that the PI’s have on average longer and more fruitful career compared to all active researchers, with regards to all career indicators. The PI’s that have received a postdoc grant have at the beginning outstanding scientific performance, but later deviate towards average. On long run, the PI’s leading the research programs (the most prestigious grants) on average demonstrate the best scientific performance. In the last part of the paper we study 23 co-authorship networks, spanned by all active researchers in the periods 1970–1994, .., 1970–2016. We find out that they are well connected and that PI’s are well distributed across these networks forming their backbones. Even more, PI’s generate new PI’s, since more than 90% of new PI’s are connected (have at least one joint scientific publication) with existing PI’s. We believe that our study sheds new light to the relations between the public funding of the science and the scientific output and can be considered as an affirmative answer to the question posed in the title. © 2018, Akadémiai Kiadó, Budapest, Hungary."},
{"id": "85053149276", "title": "Convex skeletons of complex networks", "authors": ["Šubelj, L."], "abstract": "A convex network can be defined as a network such that every connected induced subgraph includes all the shortest paths between its nodes. A fully convex network would therefore be a collection of cliques stitched together in a tree. In this paper, we study the largest high-convexity part of empirical networks obtained by removing the least number of edges, which we call a convex skeleton. A convex skeleton is a generalization of a network spanning tree in which each edge can be replaced by a clique of arbitrary size. We present different approaches for extracting convex skeletons and apply them to social collaboration and protein interactions networks, autonomous systems graphs and food webs. We show that the extracted convex skeletons retain the degree distribution, clustering, connectivity, distances, node position and also community structure, while making the shortest paths between the nodes largely unique. Moreover, in the Slovenian computer scientists coauthorship network, a convex skeleton retains the strongest ties between the authors, differently from a spanning tree or high-betweenness backbone and high-salience skeleton. A convex skeleton thus represents a simple definition of a network backbone with applications in coauthorship and other social collaboration networks. © 2018 The Author(s) Published by the Royal Society. All rights reserved."},
{"id": "85053444802", "title": "The General Explanation Method with NMR Spectroscopy Enables the Identification of Metabolite Profiles Specific for Normal and Tumor Cell Lines", "authors": ["Pečnik, K.", "Todorović, V.", "Bošnjak, M.", "Čemažar, M.", "Kononenko, I.", "Serša, G.", "Plavec, J."], "abstract": "Machine learning models in metabolomics, despite their great prediction accuracy, are still not widely adopted owing to the lack of an efficient explanation for their predictions. In this study, we propose the use of the general explanation method to explain the predictions of a machine learning model to gain detailed insight into metabolic differences between biological systems. The method was tested on a dataset of <sup>1</sup>H NMR spectra acquired on normal lung and mesothelial cell lines and their tumor counterparts. Initially, the random forests and artificial neural network models were applied to the dataset, and excellent prediction accuracy was achieved. The predictions of the models were explained with the general explanation method, which enabled identification of discriminating metabolic concentration differences between individual cell lines and enabled the construction of their specific metabolic concentration profiles. This intuitive and robust method holds great promise for in-depth understanding of the mechanisms that underline phenotypes as well as for biomarker discovery in complex diseases. © 2018 The Authors. Published by Wiley-VCH Verlag GmbH &amp; Co. KGaA."},
{"id": "85053485171", "title": "Increasing accuracy of automated essay grading by grouping similar graders", "authors": ["Zupanc, K.", "Bosnić, Z."], "abstract": "Automated essay evaluation is a widely used practical solution for replacing time-consuming manual grading of student essays. Automated systems are used in combination with human graders in different high-stake assessments, where grading models are learned on essays datasets scored by different graders. Despite the unified grading rules, human graders can unintentionally introduce subjective bias into scores. Consequently, a grading model has to learn from a data that represents a noisy relationship between essay attributes and its grade. We propose an approach for separating a set of essays into subsets that represent similar graders, which uses an explanation methodology and clustering. The results confirm our assumption that learning from the ensemble of separated models can significantly improve the average prediction accuracy on artificial and real-world datasets. © 2018 Copyright held by the owner/author(s)."},
{"id": "85053504027", "title": "Teaching with Open-Source Robotic Manipulator", "authors": ["Čehovin Zajc, L.", "Rezelj, A.", "Skočaj, D."], "abstract": "In this paper we present and evaluate the usage of an open-source robotic manipulator platform, that we have developed, in the context of various educational scenarios that we have conducted. The system was tested in multiple diverse learning scenarios, ranging from a summer school for primary-school students, to the course at the university level study. We show that the introduction of the system in the educational process improves the motivation as well as acquired knowledge of the participants. © 2019, Springer Nature Switzerland AG."},
{"id": "85053659347", "title": "Initial state perturbations as a validation method for data-driven fuzzy models of cellular networks", "authors": ["Magdevska, L.", "Mraz, M.", "Zimic, N.", "Moškon, M."], "abstract": "Background: Data-driven methods that automatically learn relations between attributes from given data are a popular tool for building mathematical models in computational biology. Since measurements are prone to errors, approaches dealing with uncertain data are especially suitable for this task. Fuzzy models are one such approach, but they contain a large amount of parameters and are thus susceptible to over-fitting. Validation methods that help detect over-fitting are therefore needed to eliminate inaccurate models. Results: We propose a method to enlarge the validation datasets on which a fuzzy dynamic model of a cellular network can be tested. We apply our method to two data-driven dynamic models of the MAPK signalling pathway and two models of the mammalian circadian clock. We show that random initial state perturbations can drastically increase the mean error of predictions of an inaccurate computational model, while keeping errors of predictions of accurate models small. Conclusions: With the improvement of validation methods, fuzzy models are becoming more accurate and are thus likely to gain new applications. This field of research is promising not only because fuzzy models can cope with uncertainty, but also because their run time is short compared to conventional modelling methods that are nowadays used in systems biology. © 2018 The Author(s)."},
{"id": "85054391142", "title": "Towards automated scyphistoma census in underwater imagery: A useful research and monitoring tool", "authors": ["Vodopivec, M.", "Mandeljc, R.", "Makovec, T.", "Malej, A.", "Kristan, M."], "abstract": "Manual annotation and counting of entities in underwater photographs is common in many branches of marine biology. With a marked increase of jellyfish populations worldwide, understanding the dynamics of the polyp (scyphistoma) stage of their life-cycle is becoming increasingly important. In-situ studies of polyp population dynamics are scarce due to small size of the polyps and tedious manual work required to annotate and count large numbers of items in underwater photographs. We devised an experiment which shows a large variance between human annotators, as well as in annotations made by the same annotator. We have tackled this problem, which is present in many areas of marine biology, by developing a method for automated detection and counting. Our polyp counter (PoCo) uses a two-stage approach with a fast detector (Aggregated Channel Features) and a precise classifier consisting of a pre-trained Convolutional Neural Network and a Support Vector Machine. PoCo was tested on a year-long image dataset and performed with accuracy comparable to human annotators but with 70-fold reduction in time. The algorithm can be used in many marine biology applications, vastly reducing the amount of manual labor and enabling processing of much larger datasets. The source code is freely available on GitHub. © 2018"},
{"id": "85054394355", "title": "Simplicity matters: user evaluation of the Slovene reference corpus", "authors": ["Arhar Holdt, Š.", "Dobrovoljc, K.", "Logar, N."], "abstract": "The latest reference corpus of written Slovene, the Gigafida corpus, was created as part of the ‘Communication in Slovene’ project. In the same project, a web concordancer was designed for the broadest possible use, and tailored to the needs and abilities of user groups such as translators, writers, proofreaders and teachers. Two years after the corpus was published within the new tool, its features were assessed by the users. With an average rate of 4.36 on a scale between 1 and 5 (1 = I strongly disagree, 5 = I strongly agree), the results indicate that most survey participants agreed or strongly agreed with positive statements about the new implementations (e.g. “The corpus results are displayed in a clear manner”). This is a considerable improvement in user experience from the previous reference corpus of Slovene, i.e. the FidaPLUS corpus within the ASP32 concordancer (rated with 3.67). In the user feedback, the simplicity of search options and the interface clarity are highlighted as the main advantages, while for the future development, advanced visualizations of corpus data and improved search of word-phrases are suggested. The evaluation also highlighted some relevant user habits, such as not taking the time to learn systematically about the tool before they start using it. The findings will be implemented in future editions of the Gigafida corpus, but are relevant to any project that aims at facilitating a wider use of reference corpora and corpus-based resources. © 2018, Springer Nature B.V."},
{"id": "85054488866", "title": "Localization of Facial Landmarks in Depth Images Using Gated Multiple Ridge Descent", "authors": ["Krizaj, J.", "Emersic, Z.", "Dobrisek, S.", "Peer, P.", "Struc, V."], "abstract": "A novel method for automatic facial landmark localization is presented. The method builds on the supervised descent framework, which was shown to successfully localize landmarks in the presence of large expression variations and mild occlusions, but struggles when localizing landmarks on faces with large pose variations. We propose an extension of the supervised descent framework that trains multiple descent maps and results in increased robustness to pose variations. The performance of the proposed method is demonstrated on the Bosphorus, the FRGC and the UND data sets for the problem of facial landmark localization from 3D data. Our experimental results show that the proposed method exhibits increased robustness to pose variations, while retaining high performance in the case of expression and occlusion variations. © 2018 IEEE."},
{"id": "85054492162", "title": "Towards Accessories-Aware Ear Recognition", "authors": ["Emersic, Z.", "Playa, N.", "Struc, V.", "Peer, P."], "abstract": "Automatic ear recognition is gaining popularity within the research community due to numerous desirable properties, such as high recognition performance, the possibility of capturing ear images at a distance and in a covert manner, etc. Despite this popularity and the corresponding research effort that is being directed towards ear recognition technology, open problems still remain. One of the most important issues stopping ear recognition systems from being widely available are ear occlusions and accessories. Ear accessories not only mask biometric features and by this reduce the overall recognition performance, but also introduce new non-biometric features that can be exploited for spoofing purposes. Ignoring ear accessories during recognition can, therefore, present a security threat to ear recognition and also adversely affect performance. Despite the importance of this topic there has been, to the best of our knowledge, no ear recognition studies that would address these problems. In this work we try to close this gap and study the impact of ear accessories on the recognition performance of several state-of-the-art ear recognition techniques. We consider ear accessories as a tool for spoofing attacks and show that CNN-based recognition approaches are more susceptible to spoofing attacks than traditional descriptor-based approaches. Furthermore, we demonstrate that using inpainting techniques or average coloring can mitigate the problems caused by ear accessories and slightly outperforms (standard) black color to mask ear accessories. © 2018 IEEE."},
{"id": "85054493732", "title": "Deep Multi-class Eye Segmentation for Ocular Biometrics", "authors": ["Rot, P.", "Emersic, Z.", "Struc, V.", "Peer, P."], "abstract": "Segmentation techniques for ocular biometrics typically focus on finding a single eye region in the input image at the time. Only limited work has been done on multi-class eye segmentation despite a number of obvious advantages. In this paper we address this gap and present a deep multi-class eye segmentation model build around the SegNet architecture. We train the model on a small dataset (of 120 samples) of eye images and observe it to generalize well to unseen images and to ensure highly accurate segmentation results. We evaluate the model on the Multi-Angle Sclera Database (MASD) dataset and describe comprehensive experiments focusing on: i) segmentation performance, ii) error analysis, iii) the sensitivity of the model to changes in view direction, and iv) comparisons with competing single-class techniques. Our results show that the proposed model is viable solution for multi-class eye segmentation suitable for recognition (multi-biometric) pipelines based on ocular characteristics. © 2018 IEEE."},
{"id": "85054500219", "title": "Selective Face Deidentification with End-to-End Perceptual Loss Learning", "authors": ["Medcn, B.", "Peer, P.", "Struc, V."], "abstract": "Privacy is a highly debatable topic in the modern technological era. With the advent of massive video and image data (which in a lot of cases contains personal information on the recorded subjects), there is an imminent need for efficient privacy protection mechanisms. To this end, we develop in this work a novel Face Deidentification Network (FaDeNet) that is able to alter the input faces in such a way that automated recognition fail to recognize the subjects in the images, while this is still possible for human observers. FaDeNet is based an encoder-decoder architecture that is trained to auto-encode the input image, while (at the same time) minimizing the recognition performance of a secondary network that is used as an socalled identity critic in FaDeNet. We present experiments on the Radbound Faces Dataset and observe encouraging results. © 2018 IEEE."},
{"id": "85054514877", "title": "Analysis of Content-Aware Image Compression with VGG16", "authors": ["Selimovic, A.", "Meden, B.", "Peer, P.", "Hladnik, A."], "abstract": "Content-aware compression based on the use of saliency maps aims to improve the interpretability of an image by encoding the more relevant image regions with a higher quality than the rest of the image. This paper revisits two convolutional neural network (CNN) models based on VGG16, multi-structure region of interest (MS-ROI) and class activation map (CAM), which enable the localization of salient image regions. While the MS-ROI model allows for the localization of multiple salient image regions, the CAM model, on the other hand, tends to localize only the most relevant class. We use the contextual information provided by the obtained saliency maps to guide the compression. By encoding more important image regions at a higher bitrate and less important ones at a lower bitrate, different qualities of compression for the regions of interest and the background are obtained, while also achieving smooth transitions from salient to non-salient regions. The performance of both models is evaluated on images from the MIT Saliency Benchmark dataset and the General-100 dataset, and the results of the compression are compared to the standard JPEG compression at different quality factors. Experimental results show that for the files of approximately same size, the compression methods based on the two CNN models outperform the standard JPEG compression. When comparing the compression based on the MS-ROI model to the compression based on the CAM model, the former is characterized by a higher PSNR and a better visual quality of the obtained images. © 2018 IEEE."},
{"id": "85054541808", "title": "End-to-End Iris Segmentation Using U-Net", "authors": ["Lozej, J.", "Meden, B.", "Struc, V.", "Peer, P."], "abstract": "Iris segmentation is an important research topic that received significant attention from the research community over the years. Traditional iris segmentation techniques have typically been focused on hand-crafted procedures that, nonetheless, achieved remarkable segmentation performance even with images captured in difficult settings. With the success of deep-learning models, researchers are increasingly looking towards convolutional neural networks (CNNs) to further improve on the accuracy of existing iris segmentation techniques and several CNN-based techniques have already been presented recently in the literature. In this paper we also consider deep-learning models for iris segmentation and present an iris segmentation approach based on the popular U-Net architecture. Our model is trainable end-to-end and, hence, avoids the need for hand designing the segmentation procedure. We evaluate the model on the CASIA dataset and report encouraging results in comparison to existing techniques used in this area. © 2018 IEEE."},
{"id": "85054641549", "title": "Parkinsonian signs in patients with cervical dystonia treated with pallidal deep brain stimulation", "authors": ["Mahlknecht, P.", "Georgiev, D.", "Akram, H.", "Brugger, F.", "Vinke, S.", "Zrinzo, L.", "Hariz, M.", "Bhatia, K.", "Hariz, G.", "Willeit, P.", "Rothwell, J.", "Foltynie, T.", "Limousin, P."], "abstract": "Pallidal deep brain stimulation is an established treatment in patients with dystonia. However, evidence from case series or uncontrolled studies suggests that it may lead in some patients to specific parkinsonian symptoms such as freezing of gait, micrographia, and bradykinesia. We investigated parkinsonian signs using the Movement Disorder Society Unified Parkinson's Disease Rating Scale motor score by means of observer-blinded video ratings in a group of 29 patients treated with pallidal stimulation and a non-surgical control group of 22 patients, both with predominant cervical dystonia. Additional assessments included MRI-based models of volume of neural tissue activated to investigate areas of stimulation related to dystonic symptom control and those likely to induce parkinsonian signs as well as an EMG analysis to investigate functional vicinity of stimulation fields to the pyramidal tract. Compared with controls, stimulated patients had significantly higher motor scores (median, 25th-75th percentile: 14.0, 8.0-19.5 versus 3.0, 2.0-8.0; P &lt; 0.0001), as well as bradykinesia (8.0, 6.0-14.0 versus 2.0, 0.0-3.0; P &lt; 0.0001) and axial motor subscores (2.0, 1.0-4.0 versus 0.0, 0.0-1.0; P = 0.0002), while rigidity and tremor subscores were not different between groups. Parkinsonian signs were partially reversible upon switching stimulation off for a median of 90 min in a subset of 19 patients tolerating this condition. Furthermore, the stimulation group reported more features of freezing of gait on a questionnaire basis. Quality of life was better in stimulated patients compared with control patients, but parkinsonian signs were negatively associated with quality of life. In the descriptive imaging analysis maximum efficacy for dystonia improvement projected to the posteroventrolateral internal pallidum with overlapping clusters driving severity of bradykinesia and axial motor symptoms. The severities of parkinsonian signs were not correlated with functional vicinity to the pyramidal tract as assessed by EMG. In conclusion, parkinsonian signs, particularly bradykinesia and axial motor signs, due to pallidal stimulation in dystonic patients are frequent and negatively impact on motor functioning and quality of life. Therefore, patients with pallidal stimulation should be monitored closely for such signs both in clinical routine and future clinical trials. Spread of current outside the internal pallidum is an unlikely explanation for this phenomenon, which seems to be caused by stimulation of neural elements within the stimulation target volume. © 2018 The Author(s)."},
{"id": "85055185975", "title": "Modeling ischemia with finite elements and automated machine learning", "authors": ["Robnik-Šikonja, M.", "Radović, M.", "Đorović, S.", "Anđelković-Ćirković, B.", "Filipović, N."], "abstract": "The main purpose of this study was to noninvasively detect and localize ischemic cardiac disease using the finite element method (FEM) in combination with machine learning approach. The forward FEM simulations of cardiac ischemia in different heart segments enabled the creation of a virtual database which consisted of corresponding body surface potentials. Two sets of experiments were performed on the database in order to select the best method for determining the existence of ischemia and then to predict the location of ischemia. Using Auto-WEKA and R caret package, several machine learning algorithms were tested. The best first phase model returned the classification accuracy of 95.3%, while the best second phase model determined the correct ischemia location with 95% accuracy. Considerable modeling and computational time are needed to create a training database and perform training, but once trained, the models will instantly return results. Thus, the main advantage of the proposed approach to ischemic detection and localization is a real-time availability of results and a novel, two-phase design which guides the selection of an adequate treatment. © 2018 Elsevier B.V."},
{"id": "85055612279", "title": "Machine Learning for Predicting Cognitive Diseases: Methods, Data Sources and Risk Factors", "authors": ["Bratić, B.", "Kurbalija, V.", "Ivanović, M.", "Oder, I.", "Bosnić, Z."], "abstract": "Machine learning and data mining approaches are being successfully applied to different fields of life sciences for the past 20 years. Medicine is one of the most suitable application domains for these techniques since they help model diagnostic information based on causal and/or statistical data and therefore reveal hidden dependencies between symptoms and illnesses. In this paper we give a detailed overview of the recent machine learning research and its applications for predicting cognitive diseases, especially the Alzheimer’s disease, mild cognitive impairment and the Parkinson’s disease. We survey different state-of-the-art methodological approaches, data sources and public data, and provide their comparative analysis. We conclude by identifying the open problems within the field that include an early detection of the cognitive diseases and inclusion of machine learning tools into diagnostic practice and therapy planning. © 2018, Springer Science+Business Media, LLC, part of Springer Nature."},
{"id": "85055638376", "title": "Sense classification of shallow discourse relations with focused RNNs", "authors": ["Weiss, G.", "Bajec, M."], "abstract": "Understanding the sense of discourse relations between segments of text is essential to truly comprehend any natural language text. Several automated approaches have been suggested, but all rely on external resources, linguistic feature engineering, and their processing pipelines are built from substantially different models. In this paper, we introduce a novel system for sense classification of shallow discourse relations (FR system) based on focused recurrent neural networks (RNNs). In contrast to existing systems, FR system consists of a single end-to-end trainable model for handling all types and senses of discourse relations, requires no feature engineering or external resources, is language-independent, and can be applied at the word and even character levels. At its core, we present our novel generalization of the focused RNNs layer, the first multi-dimensional RNN-attention mechanism for constructing text/argument embeddings. The filtering/gating RNN enables downstream RNNs to focus on different aspects of the input sequence and project it into several embedding subspaces. These argument embeddings are then used to perform sense classification. FR system has been evaluated using the official datasets and methodology of CoNLL 2016 Shared Task. It does not fall a lot behind state-of-the-art performance on English, the most researched and supported language, but it outperforms existing best systems by 2.5% overall results on the Chinese blind dataset."},
{"id": "85055878156", "title": "Average Step Length Estimation Models' Evaluation Using Inertial Sensors: A Review", "authors": ["Vezocnik, M.", "Juric, M."], "abstract": "Inertial sensors of smartphones and other Internet-of-Things devices present a very promising tool to monitor users' activity including their step length. In this review paper, we deal with an in-depth analysis and comparison of 13 representative step length estimation models using smartphone inertial sensors: step-frequency-based, acceleration-based, angle-based, and multiparameter. Hereby, we have studied the influence of different walking speeds and four typical sensor positions on the models' performance. Results indicate that smartphone position affected the performance of most acceleration-based models derived from a gait model. Their performance deteriorated if smartphone was carried in hand or pocket. Walking speed affected the performance of models that include step frequency when tuned with personalized sets of constants. Most of them performed better for fast and normal walking speeds. During this research, we also established an open-source dataset that contains over 22 km of gait measurements obtained from a group of 15 healthy adults. © 2001-2012 IEEE."},
{"id": "85056406585", "title": "V-RBNN based small drone detection in augmented datasets for 3D LADAR system", "authors": ["Kim, B.", "Khan, D.", "Bohak, C.", "Choi, W.", "Lee, H.", "Kim, M."], "abstract": "A common countermeasure to detect threatening drones is the electro-optical infrared (EO/IR) system. However, its performance is drastically reduced in conditions of complex background, saturation and light reflection. 3D laser sensor LiDAR is used to overcome the problems of 2D sensors like EO/IR, but it is not enough to detect small drones at a very long distance because of low laser energy and resolution. To solve this problem, A 3D LADAR sensor is under development. In this work, we study the detection methodology adequate to the LADAR sensor which can detect small drones at up to 2 km. First, a data augmentation method is proposed to generate a virtual target considering the laser beam and scanning characteristics, and to augment it with the actual LADAR sensor data for various kinds of tests before full hardware system developed. Second, a detection algorithm is proposed to detect drones using voxel-based background subtraction and variable radially bounded nearest neighbor (V-RBNN) method. The results show that 0.2 m L2 distance and 60% expected average overlap (EAO) indexes are satisfied for the required specification to detect 0.3 m size of small drones. © 2018 by the authors. Licensee MDPI, Basel, Switzerland."},
{"id": "85056655170", "title": "Ladar data generation fused with virtual targets and visualization for small drone detection system", "authors": ["Kim, B.", "Khan, D.", "Bohak, C.", "Kim, J.", "Choi, W.", "Lee, H.", "Kim, M."], "abstract": "For detection of a small target using electro-optical systems, multi-band 2D image sensors are used such as visible, NIR, MWIR, and LWIR. However, 2D imaging systems are not capable to detect a very small target and they are also not capable of calculating target 3D position coordinates to develop the strategic counter method. 3D sensors (e.g. Lidar, RGBD and stereo camera) are utilized to control unmanned vehicles for detecting threats and response for specific situations. Conventional Lidar systems are unable to detect small drone threat at distances higher than their maximum detecting range of 100 ?1/4 120 meters. To overcome this limitation, laser radar (LADAR) systems are being developed, which allow the detection at distances up to 2 kilometers. In the development of LADAR, it is difficult to acquire datasets that contain cases of long distant targets. In this study, a fusion data generation with virtual targets technique based on minimum real LADAR initial map dataset is proposed, and precise small target detection method using voxel-based clustering and classification are studied. We present the process of data fusion generation and the experimental results for a small target detection. The presented approach also includes effective visualization of high-resolution 3D data and the results of small target detection in real time. This study is expected to contribute to the optimization of a drone threat detection system for various environments and characteristics. © 2018 SPIE."},
{"id": "85056707453", "title": "A multi-attribute modelling approach to evaluate the efficient implementation of ICT in schools", "authors": ["Čampelj, B.", "Karnet, I.", "Brodnik, A.", "Jereb, E.", "Rajkovič, U."], "abstract": "Comprehensive implementation of Information and Communication Technologies in schools is a key factor in empowering students in the European Union (EU) for their future roles. The framework, DigCompOrg, was proposed in 2015 under the direction of the European Commission to encourage self-assessment within EU schools and to update the level of digitalization. This article presents a computer-supported model based on this framework and a multi-attribute decision-making methodology named, DEX. The model was built by a group of experts and tested on selected schools in Slovenia. The main advantages of the model are: the use of qualitative value scales for attributes which do not have exact values; the use of a hierarchical structure for attributes; a transparent presentation of the interconnectedness of these attributes; and the use of simple if–then aggregation rules to allow the use of non-fixed weights. An application of our model to a selected school demonstrates the potential for knowledge modelling to facilitate upgrades of existing assessment tools and to provide a better understanding and analysis of assessment results. © 2018, Springer-Verlag GmbH Germany, part of Springer Nature."},
{"id": "85056783729", "title": "Implementation of a training-model simulator with free tools", "authors": ["Ilc, N.", "Lotri, U."], "abstract": "One of the important modern concepts in production optimization is implementation and usage of digital twins - virtual copies of physical setups. There are many tools on the market targeting at the digital twin concept, but are payable and for small projects it is di cult to justify the initial investment. For the needs of a faculty course, we developed our own simulator with a 3D visualization of physical training models based on the Unity game engine. The simulator imitates the physical devices well enough to enable students developing e cient programs for industrial controllers and practicing integration with higher-level systems. The simulator greatly alleviates the work on project tasks and contributes to more accomplished final projects. The tools and procedures used to create the simulator present a good base for the development of more complex simulators of other training models or even industrial systems. © 2018 Electrotechnical Society of Slovenia. All rights reserved."},
{"id": "85056788665", "title": "Cloud integration platform as a concept for integration of applications and systems in farming", "authors": ["Rupnik, R."], "abstract": "There are various applications and systems available for farming where each of them cover a niche area and farming processes: ERP (Enterprise Resource Planning) system for farming, application for winegrowers, systems collecting data from various sensors, etc. The problem is that those applications and systems only enable farmers to perform analyses on application or system data. Farmers therefore cannot perform analyses on data of more than one application or system. The EU project AgroIT was defined and executed to solve the problem of standardized integration of applications and systems for farming. The concept of integration of applications and systems is a cloud integration platform where applications and systems do not integrate directly, but through a cloud integration platform based on a standard defined in the project. The paper introduces realization of goals of the AgroIT project and the cloud integration platform as a key achievement of the project. © 2018 Electrotechnical Society of Slovenia. All rights reserved."},
{"id": "85056790181", "title": "Searching for pattern graphs using a search plan in the presence of automorphisms", "authors": ["Fürst, L.", "Čibej, U.", "Mihelič, J."], "abstract": "The subgraph isomorphism problem, the goal of which is to find the occurrences of a given pattern graph in a given host graph, is, owing to the pervasiveness of large networks, becoming increasingly important. However, the problem is NP-complete, and the search efficiency may also be negatively affected by symmetries in the pattern graph. In this paper, we present an algorithm for solving the subgraph isomorphism problem using a search plan, a sequence of instructions for a systematic traversal of the pattern graph. The presented algorithm pays attention to the symmetries in the pattern graph and thus performs more efficiently than its straightforward counterpart which merely follows the search plan instructions in all possible ways. By testing our algorithm on artificial and real-world graphs, we empirically confirm its advantage over the naive approach and answer several research questions. © 2018 Electrotechnical Society of Slovenia. All rights reserved."},
{"id": "85056794860", "title": "Emulation of the iskra delta partner computer", "authors": ["Horvat, M.", "Mihelič, J."], "abstract": "In the 1980s, the computer industry in Slovenia was at its peak of development, and nowadays its achievements are practicaly nowhere to be found. Preservation of the Slovene computer heritage is of great importance from several perspectives, from educational and research to preservation of the national identity. In this paper we present various activities that we carried out for the conservation of one of the most important Slovenian computers, the Iskra Delta Partner. In doing so, we focus primarily on creating a computer emulator, which involves emulation of the processor and several related devices. We created the emulator in the C programming language, thus enabling its efficiency and portability, while with the help of appropriate tools, it can also be executed within a Web browser environment. In the first part of the paper we discuss the basic concepts of emulation and briefly examine the emulated computer. In the main part we present the emulator, its construction, and give a detailed description of the emulated devices. © 2018 Electrotechnical Society of Slovenia. All rights reserved."},
{"id": "85057214432", "title": "Mobility-aware cross-layer routing for peer-to-peer networks", "authors": ["Deokate, B.", "Lal, C.", "Trček, D.", "Conti, M."], "abstract": "In remote locations, the best way to establish a communication infrastructure is to deploy Peer-to-Peer (P2P) network over Mobile Ad-hoc Network (MANET). However, the node mobility and efficient cross-layer communication between the overlay and MANET routing protocols remains a challenge for reliable data transmission. In this paper, we propose a novel Mobility Aware Cross-layer Routing approach for Peer-to-Peer Networks (MACARON) over MANET. MACARON provides reliable communication and high lifetime routes to support efficient data transmission in the network. For this purpose, it uses cross-layer communications to share routing updates between MANET and overlay routing protocols. MACARON provides guaranteed routes with low path stretch by maintaining O˜(n) routing entries per node, where n is the number of nodes in the network. It provides scalability without using any landmark directory to store routing state, and it can effectively handle moderate mobility by using Last Encounter Routing (LER) protocol. © 2018 Elsevier Ltd"},
{"id": "85057343571", "title": "FTsim: A 3D tool for teaching automation concepts", "authors": ["Ile, N.", "Lotric, U."], "abstract": "To improve efficiency and reduce costs, industry rapidly adopts the concepts promoted by Industry 4.0 paradigm. For the future engineers it is important to meet these concepts already during their study. To better prepare them for their careers, we have included some of the new concepts in the Process automation course. With a small group of students, we have developed a 3D visualization and simulation tool, which other students can use instead of real devices. The presented 3D simulator FTsim is built using Unity 3D game engine and mimics the behaviour of three Fischertechnik training models. The simulator succeeds to imitate the physical devices to sufficient detail and allows students to heavily reduce the time spent with a physical teaching platform, yet still devise robust applications. We have experienced very positive feedback from the students, including bug reports and improvement requests. The simulator is based on freely available tools and can be easily expanded to bigger models, other teaching platforms, or even to industrial set-ups. © 2018 IEEE."},
{"id": "85057344172", "title": "Number of instances for reliable feature ranking in a given problem", "authors": ["Bohanec, M.", "Borštnar, M.", "Robnik-Šikonja, M."], "abstract": "Background: In practical use of machine learning models, users may add new features to an existing classification model, reflecting their (changed) empirical understanding of a field. New features potentially increase classification accuracy of the model or improve its interpretability. Objectives: We have introduced a guideline for determination of the sample size needed to reliably estimate the impact of a new feature. Methods/Approach: Our approach is based on the feature evaluation measure ReliefF and the bootstrap-based estimation of confidence intervals for feature ranks. Results: We test our approach using real world qualitative business-to-business sales forecasting data and two UCI data sets, one with missing values. The results show that new features with a high or a low rank can be detected using a relatively small number of instances, but features ranked near the border of useful features need larger samples to determine their impact. Conclusions: A combination of the feature evaluation measure ReliefF and the bootstrap-based estimation of confidence intervals can be used to reliably estimate the impact of a new feature in a given problem. © 2018 Walter de Gruyter GmbH. All rights reserved."},
{"id": "85057585433", "title": "Convexity in scientific collaboration networks", "authors": ["Šubelj, L.", "Fiala, D.", "Ciglarič, T.", "Kronegger, L."], "abstract": "Convexity in a network (graph) has been recently defined as a property of each of its subgraphs to include all shortest paths between the nodes of that subgraph. It can be measured on the scale [0, 1] with 1 being assigned to fully convex networks. The largest convex component of a graph that emerges after the removal of the least number of edges is called a convex skeleton. It is basically a tree of cliques, which has been shown to have many interesting features. In this article the notions of convexity and convex skeletons in the context of scientific collaboration networks are discussed. More specifically, we analyze the co-authorship networks of Slovenian researchers in computer science, physics, sociology, mathematics, and economics and extract convex skeletons from them. We then compare these convex skeletons with the residual graphs (remainders) in terms of collaboration frequency distributions by various parameters such as the publication year and type, co-authors' birth year, status, gender, discipline, etc. We also show the top-ranked scientists by four basic centrality measures as calculated on the original networks and their skeletons and conclude that convex skeletons may help detect influential scholars that are hardly identifiable in the original collaboration network. As their inherent feature, convex skeletons retain the properties of collaboration networks. These include high-level structural properties but also the fact that the same authors are highlighted by centrality measures. Moreover, the most important ties and thus the most important collaborations are retained in the skeletons. © 2018 Elsevier Ltd. All rights reserved."},
{"id": "85058159495", "title": "A Nordhaus–Gaddum conjecture for the minimum number of distinct eigenvalues of a graph", "authors": ["Levene, R.", "Oblak, P.", "Šmigoc, H."], "abstract": "We propose a Nordhaus–Gaddum conjecture for q(G), the minimum number of distinct eigenvalues of a symmetric matrix corresponding to a graph G: for every graph G excluding four exceptions, we conjecture that q(G)+q(G<sup>c</sup>)≤|G|+2, where G<sup>c</sup> is the complement of G. We compute q(G<sup>c</sup>) for all trees and all graphs G with q(G)=|G|−1, and hence we verify the conjecture for trees, unicyclic graphs, graphs with q(G)≤4, and for graphs with |G|≤7. © 2018 Elsevier Inc."},
{"id": "85058189198", "title": "Sensory trick efficacy in cervical dystonia is linked to processing of neck proprioception", "authors": ["Brugger, F.", "Peters, A.", "Georgiev, D.", "Kägi, G.", "Balint, B.", "Bhatia, K.", "Day, B."], "abstract": "Background: Muscle vibration activates muscle spindles and when applied over posterior neck muscles during stance modulates global body orientation. This is characterised by a tonic forward sway response that is reportedly diminished or absent in patients with idiopathic cervical dystonia. Objective: To investigating the impact of the sensory trick on vibration-induced postural responses. Methods: 20 patients with idiopathic cervical dystonia and a sensory trick, 15 patients without a trick, and 16 healthy controls were recruited. Neck muscle vibration was applied bilaterally over the upper trapezius under three different conditions: 1) Quiet standing; 2) standing while performing the trick (or trick-like movement in non-responders); 3) standing while elevating the flexed arm without touching any part of the body. Centre of pressure position and whole-body orientation in the sagittal plane were analysed. Results: Patients with a sensory trick responded similarly to healthy controls: neck muscle vibration led to an initial forward sway of the body that slowly increased during the prolonged vibration for all three conditions. This response was mainly mediated by ankle flexion. In patients without a trick, the initial sagittal sway was significantly reduced in all three conditions and the later slow increase was absent. Performance of the trick did not have an effect on any aspect of the response in either cervical dystonia group. Conclusions: The whole-body response to neck vibration in cervical dystonia differs depending on the effectiveness of the sensory trick to alleviate the dystonic neck posture. Variable pathophysiology of proprioceptive processing may be the common factor. © 2018 Elsevier Ltd"},
{"id": "85058300105", "title": "Wi-Mind: Wireless mental effort inference", "authors": ["Matkovič, T.", "Pejović, V."], "abstract": "From not disturbing a focused programmer, to entertaining a restless commuter waiting for a train, ubiquitous computing devices could greatly enhance their interaction with humans, should they only be aware of the user's cognitive load. However, current means of assessing cognitive load are, with a few exceptions, based on intrusive methods requiring physical contact of the measurement equipment and the user. In this paper we propose Wi-Mind, a system for remote cognitive load assessment through wireless sensing. Wi-Mind is based on a software-defined radio-based radar that measures sub-millimeter movements related to a person's breathing and heartbeats, which, in turn allow us to infer the person's cognitive load. We built and tested the system with 23 volunteers engaged in different tasks. Initial results show that while Wi-Mind manges to detect whether one is engaged in a cognitively demanding task, the inference of the exact cognitive load level remains challenging. © 2018 Copyright held by the owner/author(s). Publication rights licensed to ACM."},
{"id": "85058303163", "title": "My watch says I'm busy: Inferring cognitive load with low-cost wearables", "authors": ["Gjoreski, M.", "Luštrek, M.", "Pejović, V."], "abstract": "To prevent undesirable effects of attention grabbing at times when a user is occupied with a difficult task, ubiquitous computing devices should be aware of the user's cognitive load. However, inferring cognitive load is extremely challenging, especially when performed without obtrusive, expensive, and purpose-built equipment. In this study we examine the potential for inferring one's cognitive load using merely cheap wearable sensing devices. We subject 25 volunteers to varying cognitive load using six different Primary tasks. In parallel, we collect physiological data with a cheap device, extract features, and then construct machine learning models for cognitive load prediction. As metrics for the load we use one subjective measure, the NASA Task Load Index (NASA-TLX), and two objective measures: task difficulty and reaction time. The leave-one-subject-out evaluation shows a significant influence of the task type and the chosen cognitive load metric on the prediction accuracy. © Copyright held by the owner/author(s)."},
{"id": "85058537308", "title": "Influence of dexmedetomidine and lidocaine on perioperative opioid consumption in laparoscopic intestine resection: a randomized controlled clinical trial", "authors": ["Andjelković, L.", "Novak-Jankovič, V.", "Požar-Lukanovič, N.", "Bosnić, Z.", "Spindler-Vesel, A."], "abstract": "Objective: The consumption of opioid analgesics could be reduced by the use of analgesics with different mechanisms of action. We investigated whether additional treatment with dexmedetomidine or lidocaine could reduce opioid consumption. Methods: We randomized 59 study participants into three groups and examined: (i) fentanyl consumption, (ii) consumption of piritramide, and (iii) cognitive function and neuropathic pain. The control group received continuous propofol infusion and fentanyl boluses. Continuous intravenous infusion of dexmedetomidine (0.5 µg/kg/h) was administered to the dexmedetomidine group and lidocaine (1.5 mg/kg/h) was administered to the lidocaine group. Results: No reduction in fentanyl consumption was observed among the groups. However, we noted a significantly lower consumption of piritramide on the first and second postoperative day in the lidocaine group. Total consumption of piritramide was significantly lower in the lidocaine group compared with the control group. Conclusions: Lidocaine and dexmedetomidine reduced intraoperative propofol consumption, while lidocaine reduced postoperative piritramide consumption. Clinical trial registration: NCT02616523. © The Author(s) 2018."},
{"id": "85058676745", "title": "The Image of the Monolingual Dictionary Across Europe. Results of the European Survey of Dictionary use and Culture", "authors": ["Kosem, I.", "Lew, R.", "Müller-Spitzer, C.", "Silveira, M.", "Wolfer, S.", "Dorn, A.", "Gurrutxaga, A.", "Ceberio, K.", "Etxeberria, E.", "Lefer, M.", "Geeraerts, D.", "Despot, K.", "Stojanov, T.", "Ljubešić, N.", "Škrabal, M.", "Štěpánková, B.", "Vodrážková, V.", "Lorentzen, H.", "Trap-Jensen, L.", "Kallas, J.", "Tuulik, M.", "Koppel, K.", "Langemets, M.", "Heinonen, T.", "Thomas, I.", "Margilitadze, T.", "Markantonatou, S.", "Giouli, V.", "Mulhall, C.", "Kernerman, I.", "Ben-Moshe, Y.", "Sadan, T.", "Abel, A.", "Curcio, M.", "Tanturovska, L.", "Nikovska, B.", "Tiberius, C.", "Grønvik, O.", "Hovdenak, M.", "Berg-Olsen, S.", "Karlsen, K.", "Ore, C.", "Biesaga, M.", "Kuhn, T.", "Silvestre, J.", "Tamba, E.", "Haja, G.", "Clim, M.", "Patrascu, M.", "Tasovac, T.", "Petrović, S.", "Holdt, Š.", "Riveiro, C.", "Vázquez, M.", "Volodina, E.", "Pilán, I.", "Sköldberg, E.", "Holmer, L.", "Nesi, H."], "abstract": "The article presents the results of a survey on dictionary use in Europe, focusing on general monolingual dictionaries. The survey is the broadest survey of dictionary use to date, covering close to 10,000 dictionary users (and non-users) in nearly thirty countries. Our survey covers varied user groups, going beyond the students and translators who have tended to dominate such studies thus far. The survey was delivered via an online survey platform, in language versions specific to each target country. It was completed by 9,562 respondents, over 300 respondents per country on average. The survey consisted of the general section, which was translated and presented to all participants, as well as country-specific sections for a subset of 11 countries, which were drafted by collaborators at the national level. The present report covers the general section. © 2018 Oxford University Press. All rights reserved."},
{"id": "85058690919", "title": "OpenSPA - An open and extensible protocol for single packet authorization", "authors": ["Krmelj, G.", "Pančur, M.", "Grohar, M.", "Ciglarič, M."], "abstract": "Applications are vulnerable. Opening such applications to the Internet creates a big attack surface for potential exploit. The use of common network defenses such asfi rewalls helps mitigate the risks, however possibility of a secure scalable system that assigns network access to a service purely by identifying a device by a static IP address is a delusion. Firewalls need to improve to support dynamic allocation of device access. Such a techniquewould allowservices to be hidden to the general public, unauthorized to access them, but would at the same time allow authorized users global connectivity. Single Packet Authorization (SPA) is an approach, building on firewall functionality which hides services from unauthorized users and helps mitigate common network attacks such as Distributed Denial of Service (DDoS) attacks by stopping them earlier in the network stack. In this paper we introduce OpenSPA, a SPA protocol suitable for deployment in various complex networking environments and enabling flexibility to support different network policies. With support for IPv6 aswell as extensible support for custom user programmable authentication, authorization and rewall logic. © 2018 Copyright held by the owner/author(s)."},
{"id": "85059018486", "title": "Deep ear recognition pipeline", "authors": ["Emeršič, Ž.", "Križaj, J.", "Štruc, V.", "Peer, P."], "abstract": "Ear recognition has seen multiple improvements in recent years and still remains very active today. However, it has been approached from recognition and detection perspective separately. Furthermore, deep-learning-based approaches that are popular in other domains have seen limited use in ear recognition and even more so in ear detection. Moreover, to obtain a usable recognition system a unified pipeline is needed. The input in such system should be plain images of subjects and the output identities based only on ear biometrics. We conduct separate analysis through detection and identification experiments on the challenging dataset and, using the best approaches, present a novel, unified pipeline. The pipeline is based on convolutional neural networks (CNN) and presents, to the best of our knowledge, the first CNN-based ear recognition pipeline. The pipeline incorporates both, the detection of ears on arbitrary images of people, as well as recognition on these segmented ear regions. The experiments show that the presented system is a state-of-the-art system and, thus, a good foundation for future real-word ear recognition systems. © Springer Nature Switzerland AG 2019."},
{"id": "85059357704", "title": "Researching dictionary needs of language users through social media: A semi-automatic approach", "authors": ["Cˇibej, J.", "Holdt, S."], "abstract": "With the rise of digital media in the last decades, many language-related discussions have found home on various fora and social media such as Facebook, where users can participate in a shared-interest group to discuss language use, problems and resources. The posts in these groups are formulated by language users as a genuine response to a specific disruption in language use and offer an empirical starting point for studying language problems. We propose an automatic approach to extracting questions from language-related Facebook groups and describe the procedure in consecutive steps. We also address the issues of copyright, privacy and ethical constraints, and propose ways to overcome them. We present the extraction method on a case of two Slovene language-related Facebook groups: Za vsaj priblizˇno pravilno rabo slovensˇcine and Drusˇtvo ljubiteljskih pravopisarjev in slovnicarjev. Both groups allow users to discuss language-related problems and find answers to their questions within the community. Our first extraction from these groups yielded approximately 1,900 posts (written by approximately 500 users) and 13,000 comments (posted by more than 900 users), providing ample material that can be analyzed to reveal the users' most frequent language problems. © Lexicography in Global Contexts."},
{"id": "85059376313", "title": "Thesaurus of modern Slovene: By the community for the community", "authors": ["Holdt, S.", "Cˇibej, J.", "Dobrovoljc, K.", "Gantar, P.", "Gorjanc, V.", "Klemenc, B.", "Kosem, I.", "Krek, S.", "Laskowski, C.", "Robnik-Sˇikonja, M."], "abstract": "By presenting the Thesaurus of Modern Slovene, the largest open-access collection of Slovene synonyms, this paper describes the concept of a responsive dictionary, a dictionary that allows its data to continuously respond to the changes in language and the feedback from the language community. We begin by briefly summarizing the method of its construction and its technical aspects. A great deal of deliberation and work has been put into interface design, with the aim to make the Thesaurus as user-friendly as possible for all digital media. This is followed by a more detailed description of the types of user input (e.g. synonym suggestions, synonym votes) and feedback (interface improvement suggestions) collected as part of development, as well as the methodology for their implementation. We also touch upon a series of dissemination activities aimed specifically at community building and user involvement. In conclusion, we describe our plans for the future, such as updates to be implemented in version 1.1 of the Thesaurus. © Lexicography in Global Contexts."},
{"id": "85059425119", "title": "Collocations dictionary of modern Slovene", "authors": ["Kosem, I.", "Krek, S.", "Gantar, P.", "Holdt, S.", "Cˇibej, J.", "Laskowski, C."], "abstract": "The paper presents the compilation of the Collocations Dictionary of Modern Slovene, a new resource targeting the language production needs of Slovene speakers. An important aspect of the compilation of the dictionary is the immediate publication of all the entries, from automatic, postprocessed, finalized by lexicographers and so on, and indicating to the users their status, i.e. the stage in the compilation process. Furthermore, we discuss the introduction of crowdsourcing into the lexicographic workflow. The paper also focuses the development and presentation of the interface, which introduces new approaches to collocation presentation. The aim was to develop a collocation-driven interface that would allow different types of users a great deal of flexibility and customizability in exploring collocational information about words. In this way, the interface represents a hybrid between a more corpus-based presentation of collocations (e.g. in tools such as Word Sketch) and a traditional sense-driven presentation of collocations as found in existing collocations dictionaries. © Lexicography in Global Contexts."},
{"id": "85059470027", "title": "Segmentation and Reconstruction of 3D Models from a Point Cloud with Deep Neural Networks", "authors": ["Slabanja, J.", "Meden, B.", "Peer, P.", "Jaklič, A.", "Solina, F."], "abstract": "The need to model visual information with compact representations has existed since the early days of computer vision. We implemented in the past a segmentation and model recovery method for range images which is unfortunately too slow for current size of 3D point clouds and type of applications. Recently, neural networks have become the popular choice for quick and effective processing of visual data. In this article we demonstrate that with a convolutional neural network we could achieve comparable results, that is to determine and model all objects in a given 3D point cloud scene. We started off with a simple architecture that could predict the parameters of a single object in a scene. Then we expanded it with an architecture similar to Faster R-CNN, that could predict the parameters for any number of objects in a scene. The results of the initial neural network were satisfactory. The second network, that performed also segmentation, still gave decent results comparable to the original method, but compared to the initial one, performed somewhat worse. Results, however, are encouraging but further experiments are needed to build CNNs that will be able to replace the state-of-the-art method. © 2018 IEEE."},
{"id": "85059593169", "title": "IT Governance Mechanisms and Contingency Factors: Towards an Adaptive IT Governance Model", "authors": ["Levstek, A.", "Hovelja, T.", "Pucihar, A."], "abstract": "Background and Purpose: In this paper, we aim to propose a guideline for further research towards development of an adaptive strategic IT governance (ITG) model for small and medium-sized enterprises (SMEs). The use of IT has the potential to be the major driver for success, as well it provides an opportunity to achieve competitive advantage and support digital transformation. In order to achieve IT benefits, enterprises need an effective and successful ITG model, which follows and adapts to business needs. Available ITG models are too generic and do not differentiate for enterprises of different industry, size, maturity etc. Methodology: In order to review existing ITG mechanisms, their definitions and identify contingency factors, we performed an extensive literature review (LR). For the initial set of databases, we used the list of journals, which are indexed in the Journal Citation Reports. We also used Web of Science to identify articles with the highest number of citations. Results: This paper provides the most important definitions of ITG and proposes its comprehensive definition. Next to this, we introduce ITG mechanisms, which are crucial for the effective implementation and use of ITG. Lastly, we identify contingency factors that influence ITG implementation and its use. Conclusion: Despite extensive research in ITG area, considerable work is still needed to improve understanding of ITG, its definition and mechanisms. Multiple efforts to develop methods for governing IT failed to achieve any significant adoption rate of ITG mechanisms. To enable ITG to become an integral part of Corporate Governance, further research needs to focus on the development of an adaptive strategic ITG model. In this paper, we propose a next step for more practical method for ITG implementation and its use. © 2018 Aleš Levstek et al."},
{"id": "85059624344", "title": "Computational trust management in economics phenomena research", "authors": ["Trček, D."], "abstract": "Economics phenomena are notably governed by dynamic, non-linear, bottom-up processes emerging from agents’ interactions. Therefore traditional top-down approaches provide a rather limited insight into these phenomena. Further, research in economics has been mostly focused on addressing tangible factors, while human agents in economic settings often do not adhere to rational reasoning, and trust is one such kind of reasoning. Thanks to recent technological advancements new approaches are enabled, and this paper proposes a novel and anticipatory research methodology for studying economics phenomena that enables inclusion of trust. The methodology, called auxiliary composite simulations, builds upon recent advancements in computational trust management. By doing so it enables bottom-up simulations of trust driven economic phenomena. The paper provides also epistemic evaluation of the methodology and ends up with an example application of the proposed apparatus. © 2018 The Author(s)."},
{"id": "85059767654", "title": "Collocations in the developmental corpus šolar", "authors": ["Rozman, T.", "Holdt, S.", "Pollak, S.", "Kosem, I."], "abstract": "The paper investigates the possibilities of using the developmental Šolar corpus for determining various ways in which collocations are acquired in Slovenian, and considers potential applications of the findings for teaching Slovenian as Li. Using the combinations adjective + noun and noun + noun, we tested two methods: a) quantitative comparative analysis of the Solar corpus and the Kres corpus was used to determine similarities and differences in collocation use in school essays and general written Slovenian; b) qualitative analysis of teacher corrections was made to determine the collocations that cause difficulties among students. The results show a number of atypical uses of collocations by students - uses that are detected by teachers only to a certain extent - and confirm the usefulness of a corpus-based approach in language acquisition. © 2018 Zveza Zgodovinskih Drustev Slovenije. All rights reserved."},
{"id": "85059819610", "title": "Formal Quality of Service assurances, ranking and verification of cloud deployment options with a probabilistic model checking method", "authors": ["Kochovski, P.", "Drobintsev, P.", "Stankovski, V."], "abstract": "Context: Existing software workbenches allow for the deployment of cloud applications across a variety of Infrastructure-as-a-Service (IaaS) providers. The expected workload, Quality of Service (QoS) and Non-Functional Requirements (NFRs) must be considered before an appropriate infrastructure is selected. However, this decision-making process is complex and time-consuming. Moreover, the software engineer needs assurances that the selected infrastructure will lead to an adequate QoS of the application. Objective: The goal is to develop a new method for selection of an optimal cloud deployment option, that is, an infrastructure and configuration for deployment and to verify that all hard and as many soft QoS requirements as possible will be met at runtime. Method: A new Formal QoS Assurances Method (FoQoSAM), which relies on stochastic Markov models is introduced to facilitate an automated decision-making process. For a given workload, it uses QoS monitoring data and a user-related metric in order to automatically generate a probabilistic model. The probabilistic model takes the form of a finite automaton. It is further used to produce a rank list of cloud deployment options. As a result, any of the cloud deployment options can be verified by applying a probabilistic model checking approach. Results: Testing was performed by ranking deployment options for two cloud applications, File Upload and Video-conferencing. The FoQoSAM method was compared to a baseline Analytic Hierarchy Process (AHP). The results show that the first ranked cloud deployment options satisfy all hard and at least one of the soft requirements for both methods, however, the FoQoSAM method always satisfies at least an additional QoS requirement compared to the baseline AHP method. Conclusions: The proposed new FoQoSAM method is appropriate and can be used in decision-making when ranking and verifying cloud deployment options. Due to its practical utility it was integrated into the SWITCH workbench. © 2019 Elsevier B.V."},
{"id": "85060210152", "title": "An OpenCL library for parallel random number generators", "authors": ["Ciglarič, T.", "Češnovar, R.", "Štrumbelj, E."], "abstract": "We present a library of 22 pseudo-random number generators on the GPU. The library is implemented in OpenCL and all generators are tested using the TestU01 and PractRand libraries. We evaluated the efficiency of all generators on five different computing devices. Among the generators that pass all tests, Tyche-i was the fastest on most devices and on average. Tyche-i and several other generators from our library can be used to generate random numbers several times faster than generators from existing libraries. © 2019, Springer Science+Business Media, LLC, part of Springer Nature."},
{"id": "85060402072", "title": "An ancient germ cell-specific RNA-binding protein protects the germline from cryptic splice site poisoning", "authors": ["Ehrmann, I.", "Crichton, J.", "Gazzara, M.", "James, K.", "Liu, Y.", "Grellscheid, S.", "Curk, T.", "de Rooij, D.", "Steyn, J.", "Cockell, S.", "Adams, I.", "Barash, Y.", "Elliott, D."], "abstract": "Male germ cells of all placental mammals express an ancient nuclear RNA binding protein of unknown function called RBMXL2. Here we find that deletion of the retrogene encoding RBMXL2 blocks spermatogenesis. Transcriptome analyses of age-matched deletion mice show that RBMXL2 controls splicing patterns during meiosis. In particular, RBMXL2 represses the selection of aberrant splice sites and the insertion of cryptic and premature terminal exons. Our data suggest a Rbmxl2 retrogene has been conserved across mammals as part of a splicing control mechanism that is fundamentally important to germ cell biology. We propose that this mechanism is essential to meiosis because it buffers the high ambient concentrations of splicing activators, thereby preventing poisoning of key transcripts and disruption to gene expression by aberrant splice site selection. © 2019, Ehrmann et al."},
{"id": "85060883520", "title": "Leksikalne novosti v besedilih računalniško posredovane komunikacije", "authors": ["Gantar, P.", "Holdt, Š.", "Pollak, S."], "abstract": "This article presents a lexical analysis of data extracted for a specific collocation window from the Janes and Kres corpora of Slovene. The results of the analysis are shown to be of interest in the monitoring of lexical innovations in Slovene vocabulary and for updating dictionaries. The extracted data were compared with existing dictionaries of Slovene in terms of new vocabulary, typical collocations, and set phrases, as well as semantic shifts. The linguistic analysis of the extracted collocations shows, among other things, that a contrastive comparison can be used to idenitfy the main characteristics and trends regarding lexical innovations, as well as to highlight their problematic aspects-e.g., when lexical innovations-particularly when under the influence of foreign language elements-also introduce changes in spelling and syntactic roles. © 2018 Slavisticna Drustvo Slovenije. All Rights Reserved."},
{"id": "85060934821", "title": "Real-time Large Scale Traffic Sign Detection", "authors": ["Avramovic, A.", "Tabernik, D.", "Skocaj, D."], "abstract": "Automatic traffic sign detection and recognition has achieved good results using convolutional neural networks. Novel architectures are still being proposed in order to improve accuracy of detection and segmentation of traffic sings. In this paper, we are examining the possibility for traffic sign detection and recognition in real-time. For that purpose, we employed a novel YOLOv3 architecture, which has been proven to be fast and accurate method for object detection. It was shown that real-time detection can be achieved, even on HD images, with mAP above 88%. © 2018 IEEE."},
{"id": "85061065196", "title": "Automatic segmentation of ethnomusicological field recordings", "authors": ["Marolt, M.", "Bohak, C.", "Kavčič, A.", "Pesek, M."], "abstract": "The article presents a method for segmentation of ethnomusicological field recordings. Field recordings are integral documents of folk music performances captured in the field, and typically contain performances, intertwined with interviews and commentaries. As these are live recordings, captured in non-ideal conditions, they usually contain significant background noise. We present a segmentation method that segments field recordings into individual units labelled as speech, solo singing, choir singing, and instrumentals. Classification is based on convolutional deep networks, and is augmented with a probabilistic approach for segmentation. We describe the dataset gathered for the task and the tools developed for gathering the reference annotations. We outline a deep network architecture based on residual modules for labelling short audio segments and compare it to the more standard feature based approaches, where an improvement in classification accuracy of over 10% was obtained. We also present the SeFiRe segmentation tool that incorporates the presented segmentation method. © 2019 by the authors."},
{"id": "85061212953", "title": "Effect of low versus high frequency subthalamic deep brain stimulation on speech intelligibility and verbal fluency in Parkinson's disease: A double-blind study", "authors": ["Grover, T.", "Georgiev, D.", "Kalliola, R.", "Mahlknecht, P.", "Zacharia, A.", "Candelario, J.", "Hyam, J.", "Zrinzo, L.", "Hariz, M.", "Foltynie, T.", "Limousin, P.", "Jahanshahi, M.", "Tripoliti, E."], "abstract": "Background: Subthalamic deep brain stimulation (STN-DBS) is an established treatment for late stage Parkinson's disease (PD). Speech intelligibility (SI) and verbal fluency (VF) have been shown to deteriorate following chronic STN-DBS. It has been suggested that speech might respond favourably to low frequency stimulation (LFS). Objective: We examined how SI, perceptual speech characteristics, phonemic and semantic VF and processes underlying it (clustering and switching) respond to LFS of 60 and 80 Hz in comparison to high frequency stimulation (HFS) (110, 130 and 200 Hz). Methods: In this double-blind study, 15 STN-DBS PD patients (mean age 65, SD = 5.8, 14 right handed, three females), were assessed at five stimulation frequencies: 60 Hz, 80 Hz, 110 Hz, 130 Hz and 200 Hz. In addition to the clinical neurological assessment of speech, VF and SI were assessed. Results: SI and in particular articulation, respiration, phonation and prosody improved with LFS (all p &lt; 0.05). Phonemic VF switching improved with LFS (p = 0.005) but this did not translate to an improved phonemic VF score. A trend for improved semantic VF was found. A negative correlation was found between perceptual characteristics of speech and duration of chronic stimulation (all p &lt; 0.05). Conclusions: These findings highlight the need for meticulous programming of frequency to maximise SI in chronic STNDBS. The findings further implicate stimulation frequency in changes to specific processes underlying VF, namely phonemic switching and demonstrate the potential to address such deficits through advanced adjustment of stimulation parameters. © 2019 IOS Press and the authors. All rights reserved."},
{"id": "85061750502", "title": "The sixth visual object tracking VOT2018 challenge results", "authors": ["Kristan, M.", "Leonardis, A.", "Matas, J.", "Felsberg, M.", "Pflugfelder, R.", "Zajc, L.", "Vojír̃, T.", "Bhat, G.", "Lukežič, A.", "Eldesokey, A.", "Fernández, G.", "García-Martín, Á.", "Iglesias-Arias, Á.", "Alatan, A.", "González-García, A.", "Petrosino, A.", "Memarmoghadam, A.", "Vedaldi, A.", "Muhič, A.", "He, A.", "Smeulders, A.", "Perera, A.", "Li, B.", "Chen, B.", "Kim, C.", "Xu, C.", "Xiong, C.", "Tian, C.", "Luo, C.", "Sun, C.", "Hao, C.", "Kim, D.", "Mishra, D.", "Chen, D.", "Wang, D.", "Wee, D.", "Gavves, E.", "Gundogdu, E.", "Velasco-Salido, E.", "Khan, F.", "Yang, F.", "Zhao, F.", "Li, F.", "Battistone, F.", "De Ath, G.", "Subrahmanyam, G.", "Bastos, G.", "Ling, H.", "Galoogahi, H.", "Lee, H.", "Li, H.", "Zhao, H.", "Fan, H.", "Zhang, H.", "Possegger, H.", "Li, H.", "Lu, H.", "Zhi, H.", "Li, H.", "Lee, H.", "Chang, H.", "Drummond, I.", "Valmadre, J.", "Martin, J.", "Chahl, J.", "Choi, J.", "Li, J.", "Wang, J.", "Qi, J.", "Sung, J.", "Johnander, J.", "Henriques, J.", "Choi, J.", "van de Weijer, J.", "Herranz, J.", "Martínez, J.", "Kittler, J.", "Zhuang, J.", "Gao, J.", "Grm, K.", "Zhang, L.", "Wang, L.", "Yang, L.", "Rout, L.", "Si, L.", "Bertinetto, L.", "Chu, L.", "Che, M.", "Maresca, M.", "Danelljan, M.", "Yang, M.", "Abdelpakey, M.", "Shehata, M.", "Kang, M.", "Lee, N.", "Wang, N.", "Miksik, O.", "Moallem, P.", "Vicente-Moñivar, P.", "Senna, P.", "Li, P.", "Torr, P.", "Raju, P.", "Ruihe, Q.", "Wang, Q.", "Zhou, Q.", "Guo, Q.", "Martín-Nieto, R.", "Gorthi, R.", "Tao, R.", "Bowden, R.", "Everson, R.", "Wang, R.", "Yun, S.", "Choi, S.", "Vivas, S.", "Bai, S.", "Huang, S.", "Wu, S.", "Hadfield, S.", "Wang, S.", "Golodetz, S.", "Ming, T.", "Xu, T.", "Zhang, T.", "Fischer, T.", "Santopietro, V.", "Štruc, V.", "Wei, W.", "Zuo, W.", "Feng, W.", "Wu, W.", "Zou, W.", "Hu, W.", "Zhou, W.", "Zeng, W.", "Zhang, X.", "Wu, X.", "Wu, X.", "Tian, X.", "Li, Y.", "Lu, Y.", "Law, Y.", "Wu, Y.", "Demiris, Y.", "Yang, Y.", "Jiao, Y.", "Li, Y.", "Zhang, Y.", "Sun, Y.", "Zhang, Z.", "Zhu, Z.", "Feng, Z.", "Wang, Z.", "He, Z."], "abstract": "The Visual Object Tracking challenge VOT2018 is the sixth annual tracker benchmarking activity organized by the VOT initiative. Results of over eighty trackers are presented; many are state-of-the-art trackers published at major computer vision conferences or in journals in the recent years. The evaluation included the standard VOT and other popular methodologies for short-term tracking analysis and a “real-time” experiment simulating a situation where a tracker processes images as if provided by a continuously running sensor. A long-term tracking subchallenge has been introduced to the set of standard VOT sub-challenges. The new subchallenge focuses on long-term tracking properties, namely coping with target disappearance and reappearance. A new dataset has been compiled and a performance evaluation methodology that focuses on long-term tracking capabilities has been adopted. The VOT toolkit has been updated to support both standard short-term and the new long-term tracking subchallenges. Performance of the tested trackers typically by far exceeds standard baselines. The source code for most of the trackers is publicly available from the VOT page. The dataset, the evaluation kit and the results are publicly available at the challenge website (http://votchallenge.net). © Springer Nature Switzerland AG 2019."},
{"id": "85062329074", "title": "Genetic variability of inflammation and oxidative stress genes does not play a major role in the occurrence of adverse events of dopaminergic treatment in Parkinson's disease", "authors": ["Redenšek, S.", "Flisar, D.", "Kojović, M.", "Kramberger, M.", "Georgiev, D.", "Pirtošek, Z.", "Trošt, M.", "Dolžan, V."], "abstract": "Background: Inflammation and oxidative stress are recognized as important contributors to Parkinson's disease pathogenesis. As such, genetic variability in these pathways could have a role in susceptibility for the disease as well as in the treatment outcome. Dopaminergic treatment is effective in management of motor symptoms, but poses a risk for motor and non-motor adverse events. Our aim was to evaluate the impact of selected single-nucleotide polymorphisms in genes involved in inflammation and oxidative stress on Parkinson's disease susceptibility and the occurrence of adverse events of dopaminergic treatment. Methods: In total, 224 patients were enrolled, and their demographic and clinical data on the disease course were collected. Furthermore, a control group of 146 healthy Slovenian blood donors were included for Parkinson's disease' risk evaluation. Peripheral blood was obtained for DNA isolation. Genotyping was performed for NLRP3 rs35829419, CARD8 rs2043211, IL1β rs16944, IL1β rs1143623, IL6 rs1800795, CAT rs1001179, CAT rs10836235, SOD2 rs4880, NOS1 rs2293054, NOS1 rs2682826, TNF-α rs1800629, and GPX1 rs1050450. Logistic regression was used for analysis of possible associations. Results: We observed a nominally significant association of the IL1β rs1143623 C allele with the risk for Parkinson's disease (OR = 0.59; 95%CI = 0.38-0.92, p = 0.021). CAT rs1001179 A allele was significantly associated with peripheral edema (OR = 0.32; 95%CI = 0.15-0.68; p = 0.003). Other associations observed were only nominally significant after adjustments: NOS1 rs2682826 A allele and excessive daytime sleepiness and sleep attacks (OR = 1.75; 95%CI = 1.00-3.06, p = 0.048), SOD2 rs4880 T allele and nausea/vomiting (OR = 0.49, 95%CI = 0.25-0.94; p = 0.031), IL1β rs1143623 C allele and orthostatic hypotension (OR = 0.57, 95%CI = 0.32-1.00, p = 0.050), and NOS1 rs2682826 A allele and impulse control disorders (OR = 2.59; 95%CI = 1.09-6.19; p = 0.032). We did not find any associations between selected polymorphisms and motor adverse events. Conclusions: Apart from some nominally significant associations, one significant association between CAT genetic variability and peripheral edema was observed as well. Therefore, the results of our study suggest some links between genetic variability in inflammation- and oxidative stress-related pathways and non-motor adverse events of dopaminergic treatment. However, the investigated polymorphisms do not play a major role in the occurrence of the disease and the adverse events of dopaminergic treatment. © 2019 The Author(s)."},
{"id": "85062642330", "title": "Approximate multiple kernel learning with least-angle regression", "authors": ["Stražar, M.", "Curk, T."], "abstract": "Kernel methods provide a principled way for general data representations. Multiple kernel learning and kernel approximation are often treated as separate tasks, with considerable savings in time and memory expected if the two are performed simultaneously. Our proposed Mklaren algorithm selectively approximates multiple kernel matrices in regression. It uses Incomplete Cholesky Decomposition and Least-angle regression (LAR) to select basis functions, achieving linear complexity both in the number of data points and kernels. Since it approximates kernel matrices rather than functions, it allows to combine an arbitrary set of kernels. Compared to single kernel-based approximations, it selectively approximates different kernels in different regions of the input spaces. The LAR criterion provides a robust selection of inducing points in noisy settings, and an accurate modelling of regression functions in continuous and discrete input spaces. Among general kernel matrix decompositions, Mklaren achieves minimal approximation rank required for performance comparable to using the exact kernel matrix, at a cost lower than 1% of required operations. Finally, we demonstrate the scalability and interpretability in settings with millions of data points and thousands of kernels. © 2019 The Authors"},
{"id": "85062696925", "title": "Kanban in software engineering education: An outline of the literature", "authors": ["Mahnič, V."], "abstract": "Kanban, an agile software development methodology, is growing increasingly popular in the software industry. In order to meet industry needs, universities must find a way to integrate Kanban into their software engineering courses. In this article is provided an outline of existing literature on this topic. The search of studies in the Scopus database revealed 13 papers that were identified as primary studies relevant to this research. These studies are classified by their main topic into four groups, viz. 1) teaching Kanban through practical work on student projects; 2)teaching Kanban through educational games; 3) reporting students' perceptions of Kanban and/or Scrumban(a related methodology) and 4) position papers. A short description of each study and its main results are provided. It was found that the literature on the use of Kanban in software engineering education is sparse and of limited quality. Only a few studies contain discussions on teaching the most important Kanban concepts (i.e. the structure of the Kanban board, setting of work-in-progress limits, maximising workflow and measuring lead time) in sufficient detail. © 2019 WIETE."},
{"id": "85062854132", "title": "Spatially-Adaptive Filter Units for Deep Neural Networks", "authors": ["Tabemik, D.", "Kristan, M.", "Leonardis, A."], "abstract": "Classical deep convolutional networks increase receptive field size by either gradual resolution reduction or application of hand-crafted dilated convolutions to prevent increase in the number of parameters. In this paper we propose a novel displaced aggregation unit (DAU) that does not require hand-crafting. In contrast to classical filters with units (pixels) placed on a fixed regular grid, the displacement of the DAUs are learned, which enables filters to spatially-adapt their receptive field to a given problem. We extensively demonstrate the strength of DAUs on a classification and semantic segmentation tasks. Compared to ConvNets with regular filter, ConvNets with DAUs achieve comparable performance at faster convergence and up to 3-times reduction in parameters. Furthermore, DAUs allow us to study deep networks from novel perspectives. We study spatial distributions of DAU filters and analyze the number of parameters allocated for spatial coverage in a filter. © 2018 IEEE."},
{"id": "85062940045", "title": "Obstacle Detection for USVs by Joint Stereo-View Semantic Segmentation", "authors": ["Bovcon, B.", "Kristan, M."], "abstract": "We propose a stereo-based obstacle detection approach for unmanned surface vehicles. Obstacle detection is cast as a scene semantic segmentation problem in which pixels are assigned a probability of belonging to water or non-water regions. We extend a single-view model to a stereo system by adding a constraint which prefers consistent class labels assignment to pixels in the left and right camera images corresponding to the same parts of a 3D scene. Our approach jointly fits a semantic model to both images, leading to an improved class-label posterior map from which obstacles and water edge are extracted. In overall F-measure, our approach outperforms the current state-of-the-art monocular approach by 0.495, a monocular CNN by 0.798 and their stereo extensions by 0.059 and 0.515, respectively on the task of obstacle detection while running real-time on a single CPU. © 2018 IEEE."},
{"id": "85062980257", "title": "Deep Learning-Based Channel Prediction in Realistic Vehicular Communications", "authors": ["Joo, J.", "Park, M.", "Han, D.", "Pejovic, V."], "abstract": "Access to reliable estimates of the wireless channel, such as the channel state information (CSI) and the received signal strength would open opportunities for timely adaptation of transmission parameters and consequently increased throughput and transmission efficiency in vehicular communications. To design the adaptive transmission schemes, it is important to understand the realistic channel properties, especially in vehicular environments where the mobility of communication devices causes rapid channel variation. However, getting CSI estimates is challenging due to the lack of support for obtaining CSI from the chipset. In this paper, we present our efforts towards enabling reliable, up-to-date channel estimates in vehicular communications. We begin by designing and conducting a measurement campaign where we collect IQ (in-phase and quadrature) samples of the IEEE 802.11p transmission and implement CSI extraction algorithms to obtain and analyze wireless channel estimates from various real-world environments. We then propose a deep learning-based channel prediction for predicting future CSI and received signal levels. The trace-based evaluation demonstrates that our prediction approach improves the future power level estimate by 15% to 25% in terms of the root-mean-square-error compared to the latest known channel properties, thus, providing a sound basis for future efforts in anticipatory vehicular communication transmission adaptation. © 2019 IEEE."},
{"id": "85063055727", "title": "Smart contracts for container based video conferencing services: Architecture and implementation", "authors": ["Gec, S.", "Lavbič, D.", "Bajec, M.", "Stankovski, V."], "abstract": "Today, container-based virtualization is very popular due to the lightweight nature of containers and the ability to use them flexibly in various heterogeneously composed systems. This makes it possible to collaboratively develop services by sharing various types of resources, such as infrastructures, software and digitalized content. In this work, our home made video-conferencing (VC) system is used to study resource usage optimisation in business context. An application like this, does not provide monetization possibilities to all involved stakeholders including end users, cloud providers, software engineers and similar. Blockchain related technologies, such as Smart Contracts (SC) offer a possibility to address some of these needs. We introduce a novel architecture for monetization of added-value according to preferences of the stakeholders that participate in joint software service offers. The developed architecture facilitates use case scenarios of service and resource offers according to fixed and dynamic pricing schemes, fixed usage period, prepaid quota for flexible usage, division of income, consensual decisions among collaborative service providers, and constrained based usage of resources or services. Our container-based VC service, which is based on the Jitsi Meet Open Source software is used to demonstrate the proposed architecture and the benefits of the investigated use cases. © 2019, Springer Nature Switzerland AG."},
{"id": "85063335992", "title": "Discovering language of the stocks", "authors": ["Poženel, M.", "Lavbič, D."], "abstract": "Stock prediction has always been attractive area for researchers and investors since the financial gains can be substantial. However, stock prediction can be a challenging task since stocks are influenced by a multitude of factors whose influence vary rapidly through time. This paper proposes a novel approach (Word2Vec) for stock trend prediction combining NLP and Japanese candlesticks. First, we create a simple language of Japanese candlesticks from the source OHLC data. Then, sentences of words are used to train the NLP Word2Vec model where training data classification also takes into account trading commissions. Finally, the model is used to predict trading actions. The proposed approach was compared to three trading models Buy &amp; Hold, MA and MACD according to the yield achieved. We first evaluated Word2Vec on three shares of Apple, Microsoft and Coca-Cola where it outperformed the comparative models. Next we evaluated Word2Vec on stocks from Russell Top 50 Index where our Word2Vec method was also very successful in test phase and only fall behind the Buy &amp; Hold method in validation phase. Word2Vec achieved positive results in all scenarios while the average yields of MA and MACD were still lower compared to Word2Vec. © 2019 The authors and IOS Press."},
{"id": "85063458254", "title": "Relationship between particulate matter pollution and acute coronary syndrome incidence", "authors": ["Ravljen, M.", "Hovelja, T.", "Vavpotič, D."], "abstract": "(1) Background: In recent decades, studies have reported on the increased cardiovascular risk associated with increased levels of air pollutants, especially particulate matters (PM). It remains unclear whether the specific subgroups share the same involvement and whether the effect is delayed. (2) Methods: Data for acute coronary syndrome (ACS) incidences from 2008 to 2011 were gathered in two major medical centres in Slovenia. A time series analysis was conducted in which daily ACS incidence data were linked with daily concentrations of PM<sub>10</sub> (PM with a median aerodynamic diameter less than 10 μm) using a well-established generalized linear model with a log link function and a Poisson distribution of ACS.We specifically focused on groups based simultaneously on age and gender. (3) Results: On the basis of the presented models, it appears that daily average concentrations of PM<sub>10</sub> have a significant impact on ACS incidence for the entire population, with a higher impact on older populations and the highest impact on older men. The analysis of the delayed effect in PM<sub>10</sub>-related ACS incidences observed the strongest effect at a one day lag. (4) Conclusions: Our study detected the presence of a \"rise and fall\" lag pattern observed in three aforementioned population groups; however, no significant association was detected for women and younger populations. © 2019 by the authors. Licensee MDPI, Basel, Switzerland."},
{"id": "85063776392", "title": "Semi-quantitative Modelling of Gene Regulatory Processes with Unknown Parameter Values Using Fuzzy Logic and Petri Nets", "authors": ["Bordon, J.", "Moskon, M.", "Zimic, N.", "Mraz, M."], "abstract": "Petri nets are a well-established modelling framework in life sciences and have been widely applied to systems and synthetic biology in recent years. With the various extensions they serve as graphical and simulation interface for both qualitative and quantitative modelling approaches. In terms of quantitative approaches, Stochastic and Continuous Petri nets are extensively used for modelling biological system's dynamics if underlying kinetic data are known. However, these are often only vaguely defined or even missing. In this paper we present a fuzzy approach, which can be used to model biological processes with unknown kinetic data in order to still obtain quantitatively relevant simulation results. We define fuzzy firing rate functions, which can be used in Continuous Petri nets and are able to describe different processes that govern the dynamics of gene expression networks. They can be used in combination with the conventional firing rate functions and applied only in the parts of the system for which the kinetic data are missing. The case study of the proposed approach is performed on models of a hypothetical repressilator and Neurospora circadian rhythm. © 2018 IOS Press. All rights reserved."},
{"id": "85064093147", "title": "sonicLamination – From a concept to artistic binding of visual and sound domains by using advanced technology", "authors": ["Trček, D.", "Trček, G."], "abstract": "Layers can be considered as powerful mental concept with proven suitability in numerous areas ranging from fine arts to engineering. To further expand their potential and apply them to computers-based art, sonicLamination method is presented here. The method builds upon computer-based (programmatic) transformations that take into account various enriching perspectives, e.g., physiological laws of human perception. By doing so, it achieves higher levels of semantic relationships when binding visual and sound domains. Put another way, sonicLamination is not just about a new kind of conceptual art, but about exploring new venues in fine arts through technology. Therefore, this paper presents how sonicLamination can be used to exceed its conceptual roots in order to lead to new ways of artistic deployment ranging from enhancing humans sensations to artificially generated soundscapes. This is due to the fact that the core principles of sonicLamination can be naturally extended to provide means for a plethora of artistic approaches when technologically transforming visual inputs into their sonic representations. Copyright © 2019 Inderscience Enterprises Ltd."},
{"id": "85064596582", "title": "Affective experience of music emotional and color perception of folk and other musical genres", "authors": ["Strle, G.", "Pesek, M.", "Marolt, M."], "abstract": "The article presents an experimental study of the emotional and color perception of music, focusing on folk music in comparison with other musical genres. The analysis showed that some musical emotions are conveyed differently between different genres. Overall, Folk genre had the most balanced distribution of the emotions used in the ratings, along with Pop and Rock. On the other hand, Punk and Metal had over 40% of their ratings represented by only two emotions, liveliness and anger. This is further reflected in the emotion-color associations. The presented findings point to the genre specificity of musical emotions. © 2018 Zalozba Z R C. All rights reserved."},
{"id": "85064811447", "title": "Lightning may pose a danger to patients receiving deep brain stimulation: Case report", "authors": ["Prezelj, N.", "Trošt, M.", "Georgiev, D.", "Flisar, D."], "abstract": "Deep brain stimulation (DBS) is an established treatment option for advanced stages of Parkinson’s disease and other movement disorders. It is known that DBS is susceptible to strong electromagnetic fields (EMFs) that can be generated by various electrical devices at work, home, and in medical environments. EMFs can interfere with the proper functioning of implantable pulse generators (IPGs). Very strong EMFs can generate induction currents in implanted electrodes and even damage the brain. Manufacturers of DBS devices have issued a list of warnings on how to avoid this danger. Strong EMFs can result from natural forces as well. The authors present the case of a 66-year-old woman who was being treated with a rechargeable DBS system for neck dystonia when her apartment was struck by lightning. Domestic electronic devices that were operating during the event were burned and destroyed. The woman’s IPG switched off but remained undamaged, and she suffered no neurological consequences. ©AANS 2019."},
{"id": "85065130799", "title": "Cardiac autonomic regulation and PR interval determination for enhanced atrial fibrillation risk prediction after cardiac surgery", "authors": ["Kališnik, J.", "Avbelj, V.", "Vratanar, J.", "Santarpino, G.", "Geršak, B.", "Fischlein, T.", "Trobec, R.", "Žibert, J."], "abstract": "Background: Changes in cardiac autonomic regulation and P-wave characteristics are associated with the occurrence of atrial fibrillation. The purpose of this study was to evaluate whether combined preoperative non-invasive determination of cardiac autonomic regulation and PR interval allows for the identification of patients at risk of new-onset atrial fibrillation after cardiac surgery. Methods: RR, PR and QT intervals, and linear and non-linear heart rate variability parameters from 20 min high-resolution electrocardiographic recordings were determined one day before surgery in 150 patients on chronic beta blockers undergoing elective coronary artery bypass grafting, aortic valve replacement, or both, electively. Results: Thirty-one patients (21%)developed postoperative atrial fibrillation. In the atrial fibrillation group, more arterial hypertension, a greater age, a higher EuroSCORE II, a higher heart rate variability index (pNN50: 9 ± 20 vs. 4 ± 10, p = 0.050), a short PR interval (156 ± 23 vs. 173 ± 31 ms; p = 0.011), and a reduced short-term scaling exponent of the detrended fluctuation analysis (DFA1, 0.96 ± 0.36 vs. 1.11 ± 0.30 ms; p = 0.032)were found compared to the sinus rhythm group. Logistic regression modeling confirmed PR interval, DFA1 and age as the strongest preoperative predictors of postoperative atrial fibrillation (area under the receiver operating characteristic curve = 0.804). Conclusions: Patients developing atrial fibrillation after cardiac surgery presented with severe cardiac autonomic derangement and a short PR interval preoperatively. The observed state characterizes both altered heart rate regulation and arrhythmic substrate and is strongly related to an increased risk of postoperative atrial fibrillation. © 2019 Elsevier B.V."},
{"id": "85065487045", "title": "Dopaminergic pathway genes influence adverse events related to dopaminergic treatment in Parkinson's disease", "authors": ["Redenšek, S.", "Flisar, D.", "Kojovic, M.", "Kramberger, M.", "Georgiev, D.", "Pirtošek, Z.", "Trošt, M.", "Dolžan, V."], "abstract": "Dopaminergic pathway is the most disrupted pathway in the pathogenesis of Parkinson's disease. Several studies reported associations of dopaminergic genes with the occurrence of adverse events of dopaminergic treatment. However, none of these studies adopted a pathway based approach. The aim of this study was to comprehensively evaluate the influence of selected single nucleotide polymorphisms of key dopaminergic pathway genes on the occurrence of motor and non-motor adverse events of dopaminergic treatment in Parkinson's disease. In total, 231 Parkinson's disease patients were enrolled. Demographic and clinical data were collected. Genotyping was performed for 16 single nucleotide polymorphisms from key dopaminergic pathway genes. Logistic and Cox regression analyses were used for evaluation. Results were adjusted for significant clinical data. We observed that carriers of at least one COMT rs165815 C allele had lower odds for developing visual hallucinations (OR = 0.34; 95% CI = 0.16-0.72; p = 0.004), while carriers of at least one DRD3 rs6280 C allele and CC homozygotes had higher odds for this adverse event (OR = 1.88; 95% CI = 1.00-3.54; p = 0.049 and OR = 3.31; 95% CI = 1.37-8.03; p = 0.008, respectively). Carriers of at least one DDC rs921451 C allele and CT heterozygotes had higher odds for orthostatic hypotension (OR = 1.86; 95% CI = 1.07-3.23; p = 0.028 and OR = 2.30; 95% CI = 1.26-4.20; p = 0.007, respectively). Heterozygotes for DDC rs3837091 and SLC22A1 rs628031 AA carriers also had higher odds for orthostatic hypotension (OR = 1.94; 95% CI = 1.07 - 3.51; p = 0.028 and OR = 2.57; 95% CI = 1.11 - 5.95; p = 0.028, respectively). Carriers of the SLC22A1 rs628031 AA genotype had higher odds for peripheral edema and impulse control disorders (OR = 4.00; 95% CI = 1.62 - 9.88; p = 0.003 and OR = 3.16; 95% CI = 1.03 - 9.72; p = 0.045, respectively). Finally, heterozygotes for SLC22A1 rs628031 and carriers of at least one SLC22A1 rs628031 A allele had lower odds for dyskinesia (OR = 0.48; 95% CI = 0.24 - 0.98, p = 0.043 and OR = 0.48; 95% CI = 0.25 - 0.92; p = 0.027, respectively). Gene-gene interactions, more specifically DDC-COMT, SLC18A2-SV2C, and SLC18A2-SLC6A3, also significantly influenced the occurrence of some adverse events. Additionally, haplotypes of COMT and SLC6A3 were associated with the occurrence of visual hallucinations (AT vs. GC: OR = 0.34; 95% CI = 0.16 - 0.72; p = 0.005) and orthostatic hypotension (ATG vs. ACG: OR = 2.48; 95% CI: 1.01 - 6.07; p = 0.047), respectively. Pathway based approach allowed us to identify new potential candidates for predictive biomarkers of adverse events of dopaminergic treatment in Parkinson's disease, which could contribute to treatment personalization. © 2007 - 2019 Frontiers Media S.A. All Rights Reserved."},
{"id": "85065573982", "title": "Prediction of music pairwise preferences from facial expressions", "authors": ["Tkalčič, M.", "Elahi, M.", "Maleki, N.", "Ricci, F.", "Pesek, M.", "Marolt, M."], "abstract": "Users of a recommender system may be requested to express their preferences about items either with evaluations of items (e.g. a rating) or with comparisons of item pairs. In this work we focus on the acquisition of pairwise preferences in the music domain. Asking the user to explicitly compare music, i.e., which, among two listened tracks, is preferred, requires some user effort. We have therefore developed a novel approach for automatically extracting these preferences from the analysis of the facial expressions of the users while listening to the compared tracks. We have trained a predictor that infers user's pairwise preferences by using features extracted from these data. We show that the predictor performs better than a commonly used baseline, which leverages the user's listening duration of the tracks to infer pairwise preferences. Furthermore, we show that there are differences in the accuracy of the proposed method between users with different personalities and we have therefore adapted the trained model accordingly. Our work shows that by introducing a low user effort preference elicitation approach, which, however, requires to access information that may raise potential privacy issues (face expression), one can obtain good prediction accuracy of pairwise music preferences. © 2019 Copyright held by the owner/author(s). Publication rights licensed to ACM."},
{"id": "85065842141", "title": "Chronic subthalamic nucleus stimulation in Parkinson's disease: Optimal frequency for gait depends on stimulation site and axial symptoms", "authors": ["Giulio, I.", "Kalliolia, E.", "Georgiev, D.", "Peters, A.", "Voyce, D.", "Akram, H.", "Foltynie, T.", "Limousin, P.", "Day, B."], "abstract": "Axial symptoms emerge in a significant proportion of patients with Parkinson's disease (PD) within 5 years of deep brain stimulation (STN-DBS). Lowering the stimulation frequency may reduce these symptoms. The objectives of the current study were to establish the relationship between gait performance and STN-DBS frequency in chronically stimulated patients with PD, and to identify factors underlying variability in this relationship. Twenty-four patients treated chronically with STN-DBS (&gt;4 years) were studied off-medication. The effect of stimulation frequency (40–140 Hz, 20 Hz-steps, constant energy) on gait was assessed in 6 sessions spread over 1 day. Half of the trials/session involved walking through a narrow doorway. The influence of stimulation voltage was investigated separately in 10 patients. Gait was measured using 3D motion capture and axial symptoms severity was assessed clinically. A novel statistical method established the optimal frequency(ies) for each patient by operating on frequency-tuning curves for multiple gait parameters. Narrowly-tuned optimal frequencies (20 Hz bandwidth) were found in 79% of patients. Frequency change produced a larger effect on gait performance than voltage change. Optimal frequency varied between patients (between 60 and 140 Hz). Contact site in the right STN and severity of axial symptoms were independent predictors of optimal frequency (P = 0.009), with lower frequencies associated with more dorsal contacts and worse axial symptoms. We conclude that gait performance is sensitive to small changes in STN-DBS frequency. The optimal frequency varies considerably between patients and is associated with electrode contact site and severity of axial symptoms. Between-subject variability of optimal frequency may stem from variable pathology outside the basal ganglia. Copyright © 2019 Di Giulio, Kalliolia, Georgiev, Peters, Voyce, Akram, Foltynie, Limousin and Day."},
{"id": "85066755727", "title": "Implementation and evaluation of algorithms with ALGATOr", "authors": ["Dobravec, T."], "abstract": "In this paper we present an automatic algorithm evaluation system called ALGATOR, which was developed to facilitate the algorithm design and evaluation process. The system enables unbiased tests of the correctness of the algorithm’s results on given test cases and comparisons of the quality of implemented algorithms for solving various kinds of problems (e.g. sorting data, matrix multiplication, traveler salesman problem, shortest path problem, and the like). Within the ALGATOR one can define a problem by specifying the problem descriptors, test sets with corresponding test cases, input parameters and output indicators, algorithm specifications and criteria for measuring the quality of algorithms. When a user of the system submits an algorithm for solving a given problem, ALGATOR automatically executes this algorithm on predefined tests, measures the quality indicators and prepares the results to be compared with the results of other algorithms in the system. The ALGATOR is meant to be used by algorithm developers to perform independent quality tests for their solutions. © 2019 Slovene Society Informatika. All rights reserved."},
{"id": "85067019320", "title": "Fast optimization of non-negative matrix tri-factorization", "authors": ["Čopar, A.", "Zupan, B.", "Zitnik, M."], "abstract": "Non-negative matrix tri-factorization (NMTF) is a popular technique for learning low-dimensional feature representation of relational data. Currently, NMTF learns a representation of a dataset through an optimization procedure that typically uses multiplicative update rules. This procedure has had limited success, and its failure cases have not been well understood. We here perform an empirical study involving six large datasets comparing multiplicative update rules with three alternative optimization methods, including alternating least squares, projected gradients, and coordinate descent. We find that methods based on projected gradients and coordinate descent converge up to twenty-four times faster than multiplicative update rules. Furthermore, alternating least squares method can quickly train NMTF models on sparse datasets but often fails on dense datasets. Coordinate descent-based NMTF converges up to sixteen times faster compared to well-established methods. © 2019 Čopar et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited."},
{"id": "85067228450", "title": "Learning by arguing in argument-based machine learning framework", "authors": ["Guid, M.", "Možina, M.", "Pavlič, M.", "Turšič, K."], "abstract": "We propose an approach for the development of argument-based intelligent tutoring systems in which a domain that can be successfully addressed by supervised machine learning is taught in an interactive learning environment. The system is able to automatically select relevant examples and counter-examples to be explained by the students. The students learn by explaining specific examples, and the system provides automated feedback on students’ arguments, including generating hints. The role of an argument-based intelligent tutoring system is then to train the students to find the most relevant arguments. The students learn about the high-level domain concepts and then use them to argue about automatically selected examples. We demonstrate our approach in an online application that allows students to learn through arguments with the goal of improving their understanding of financial statements. © Springer Nature Switzerland AG 2019."},
{"id": "85067358569", "title": "FuCoLoT – A Fully-Correlational Long-Term Tracker", "authors": ["Lukežič, A.", "Zajc, L.", "Vojíř, T.", "Matas, J.", "Kristan, M."], "abstract": "We propose FuCoLoT – a Fully Correlational Long-term Tracker. It exploits the novel DCF constrained filter learning method to design a detector that is able to re-detect the target in the whole image efficiently. FuCoLoT maintains several correlation filters trained on different time scales that act as the detector components. A novel mechanism based on the correlation response is used for tracking failure estimation. FuCoLoT achieves state-of-the-art results on standard short-term benchmarks and it outperforms the current best-performing tracker on the long-term UAV20L benchmark by over 19%. It has an order of magnitude smaller memory footprint than its best-performing competitors and runs at 15Â fps in a single CPU thread. © 2019, Springer Nature Switzerland AG."}
]