[
{"id": "85061065196", "title": "Automatic segmentation of ethnomusicological field recordings", "authors": ["Marolt, M.", "Bohak, C.", "Kavčič, A.", "Pesek, M."], "abstract": "The article presents a method for segmentation of ethnomusicological field recordings. Field recordings are integral documents of folk music performances captured in the field, and typically contain performances, intertwined with interviews and commentaries. As these are live recordings, captured in non-ideal conditions, they usually contain significant background noise. We present a segmentation method that segments field recordings into individual units labelled as speech, solo singing, choir singing, and instrumentals. Classification is based on convolutional deep networks, and is augmented with a probabilistic approach for segmentation. We describe the dataset gathered for the task and the tools developed for gathering the reference annotations. We outline a deep network architecture based on residual modules for labelling short audio segments and compare it to the more standard feature based approaches, where an improvement in classification accuracy of over 10% was obtained. We also present the SeFiRe segmentation tool that incorporates the presented segmentation method. © 2019 by the authors."},
{"id": "85063458254", "title": "Relationship between particulate matter pollution and acute coronary syndrome incidence", "authors": ["Ravljen, M.", "Hovelja, T.", "Vavpotič, D."], "abstract": "(1) Background: In recent decades, studies have reported on the increased cardiovascular risk associated with increased levels of air pollutants, especially particulate matters (PM). It remains unclear whether the specific subgroups share the same involvement and whether the effect is delayed. (2) Methods: Data for acute coronary syndrome (ACS) incidences from 2008 to 2011 were gathered in two major medical centres in Slovenia. A time series analysis was conducted in which daily ACS incidence data were linked with daily concentrations of PM<sub>10</sub> (PM with a median aerodynamic diameter less than 10 μm) using a well-established generalized linear model with a log link function and a Poisson distribution of ACS.We specifically focused on groups based simultaneously on age and gender. (3) Results: On the basis of the presented models, it appears that daily average concentrations of PM<sub>10</sub> have a significant impact on ACS incidence for the entire population, with a higher impact on older populations and the highest impact on older men. The analysis of the delayed effect in PM<sub>10</sub>-related ACS incidences observed the strongest effect at a one day lag. (4) Conclusions: Our study detected the presence of a \"rise and fall\" lag pattern observed in three aforementioned population groups; however, no significant association was detected for women and younger populations. © 2019 by the authors. Licensee MDPI, Basel, Switzerland."},
{"id": "85056707453", "title": "A multi-attribute modelling approach to evaluate the efficient implementation of ICT in schools", "authors": ["Čampelj, B.", "Karnet, I.", "Brodnik, A.", "Jereb, E.", "Rajkovič, U."], "abstract": "Comprehensive implementation of Information and Communication Technologies in schools is a key factor in empowering students in the European Union (EU) for their future roles. The framework, DigCompOrg, was proposed in 2015 under the direction of the European Commission to encourage self-assessment within EU schools and to update the level of digitalization. This article presents a computer-supported model based on this framework and a multi-attribute decision-making methodology named, DEX. The model was built by a group of experts and tested on selected schools in Slovenia. The main advantages of the model are: the use of qualitative value scales for attributes which do not have exact values; the use of a hierarchical structure for attributes; a transparent presentation of the interconnectedness of these attributes; and the use of simple if–then aggregation rules to allow the use of non-fixed weights. An application of our model to a selected school demonstrates the potential for knowledge modelling to facilitate upgrades of existing assessment tools and to provide a better understanding and analysis of assessment results. © 2018, Springer-Verlag GmbH Germany, part of Springer Nature."},
{"id": "85057214432", "title": "Mobility-aware cross-layer routing for peer-to-peer networks", "authors": ["Deokate, B.", "Lal, C.", "Trček, D.", "Conti, M."], "abstract": "In remote locations, the best way to establish a communication infrastructure is to deploy Peer-to-Peer (P2P) network over Mobile Ad-hoc Network (MANET). However, the node mobility and efficient cross-layer communication between the overlay and MANET routing protocols remains a challenge for reliable data transmission. In this paper, we propose a novel Mobility Aware Cross-layer Routing approach for Peer-to-Peer Networks (MACARON) over MANET. MACARON provides reliable communication and high lifetime routes to support efficient data transmission in the network. For this purpose, it uses cross-layer communications to share routing updates between MANET and overlay routing protocols. MACARON provides guaranteed routes with low path stretch by maintaining O˜(n) routing entries per node, where n is the number of nodes in the network. It provides scalability without using any landmark directory to store routing state, and it can effectively handle moderate mobility by using Last Encounter Routing (LER) protocol. © 2018 Elsevier Ltd"},
{"id": "85045092804", "title": "AgroDSS: A decision support system for agriculture and farming", "authors": ["Rupnik, R.", "Kukar, M.", "Vračar, P.", "Košir, D.", "Pevec, D.", "Bosnić, Z."], "abstract": "Decision support systems, data analysis and data mining have become significant tools for improving business in professional world. The emerging technologies are making the precision agriculture omnipresent and allow potential for enriching it with computer-assisted decision support systems for farm management. In this paper we describe a novel system AgroDSS that bridges the gap between agricultural systems and state-of-the-art decision support methodology. The described system is intended for integration into the existing farm management information systems and provides a cloud-based decision support toolbox, allowing farmers to upload their own data, utilize several data analysis methods and retrieve their outputs. The implemented tools include predictive modeling with explanation, accuracy evaluation, time series clustering and decomposition, and structural change detection. They can help users make predictions for simulated scenarios and better understand the dependencies (interactions) within their domain. We apply the AgroDSS system on a case study of pest population dynamics, illustrating the potential for its use. © 2018 Elsevier B.V."},
{"id": "85060402072", "title": "An ancient germ cell-specific RNA-binding protein protects the germline from cryptic splice site poisoning", "authors": ["Ehrmann, I.", "Crichton, J.", "Gazzara, M.", "James, K.", "Liu, Y.", "Grellscheid, S.", "Curk, T.", "de Rooij, D.", "Steyn, J.", "Cockell, S.", "Adams, I.", "Barash, Y.", "Elliott, D."], "abstract": "Male germ cells of all placental mammals express an ancient nuclear RNA binding protein of unknown function called RBMXL2. Here we find that deletion of the retrogene encoding RBMXL2 blocks spermatogenesis. Transcriptome analyses of age-matched deletion mice show that RBMXL2 controls splicing patterns during meiosis. In particular, RBMXL2 represses the selection of aberrant splice sites and the insertion of cryptic and premature terminal exons. Our data suggest a Rbmxl2 retrogene has been conserved across mammals as part of a splicing control mechanism that is fundamentally important to germ cell biology. We propose that this mechanism is essential to meiosis because it buffers the high ambient concentrations of splicing activators, thereby preventing poisoning of key transcripts and disruption to gene expression by aberrant splice site selection. © 2019, Ehrmann et al."},
{"id": "85065842141", "title": "Chronic subthalamic nucleus stimulation in Parkinson's disease: Optimal frequency for gait depends on stimulation site and axial symptoms", "authors": ["Giulio, I.", "Kalliolia, E.", "Georgiev, D.", "Peters, A.", "Voyce, D.", "Akram, H.", "Foltynie, T.", "Limousin, P.", "Day, B."], "abstract": "Axial symptoms emerge in a significant proportion of patients with Parkinson's disease (PD) within 5 years of deep brain stimulation (STN-DBS). Lowering the stimulation frequency may reduce these symptoms. The objectives of the current study were to establish the relationship between gait performance and STN-DBS frequency in chronically stimulated patients with PD, and to identify factors underlying variability in this relationship. Twenty-four patients treated chronically with STN-DBS (&gt;4 years) were studied off-medication. The effect of stimulation frequency (40–140 Hz, 20 Hz-steps, constant energy) on gait was assessed in 6 sessions spread over 1 day. Half of the trials/session involved walking through a narrow doorway. The influence of stimulation voltage was investigated separately in 10 patients. Gait was measured using 3D motion capture and axial symptoms severity was assessed clinically. A novel statistical method established the optimal frequency(ies) for each patient by operating on frequency-tuning curves for multiple gait parameters. Narrowly-tuned optimal frequencies (20 Hz bandwidth) were found in 79% of patients. Frequency change produced a larger effect on gait performance than voltage change. Optimal frequency varied between patients (between 60 and 140 Hz). Contact site in the right STN and severity of axial symptoms were independent predictors of optimal frequency (P = 0.009), with lower frequencies associated with more dorsal contacts and worse axial symptoms. We conclude that gait performance is sensitive to small changes in STN-DBS frequency. The optimal frequency varies considerably between patients and is associated with electrode contact site and severity of axial symptoms. Between-subject variability of optimal frequency may stem from variable pathology outside the basal ganglia. Copyright © 2019 Di Giulio, Kalliolia, Georgiev, Peters, Voyce, Akram, Foltynie, Limousin and Day."},
{"id": "85065487045", "title": "Dopaminergic pathway genes influence adverse events related to dopaminergic treatment in Parkinson's disease", "authors": ["Redenšek, S.", "Flisar, D.", "Kojovic, M.", "Kramberger, M.", "Georgiev, D.", "Pirtošek, Z.", "Trošt, M.", "Dolžan, V."], "abstract": "Dopaminergic pathway is the most disrupted pathway in the pathogenesis of Parkinson's disease. Several studies reported associations of dopaminergic genes with the occurrence of adverse events of dopaminergic treatment. However, none of these studies adopted a pathway based approach. The aim of this study was to comprehensively evaluate the influence of selected single nucleotide polymorphisms of key dopaminergic pathway genes on the occurrence of motor and non-motor adverse events of dopaminergic treatment in Parkinson's disease. In total, 231 Parkinson's disease patients were enrolled. Demographic and clinical data were collected. Genotyping was performed for 16 single nucleotide polymorphisms from key dopaminergic pathway genes. Logistic and Cox regression analyses were used for evaluation. Results were adjusted for significant clinical data. We observed that carriers of at least one COMT rs165815 C allele had lower odds for developing visual hallucinations (OR = 0.34; 95% CI = 0.16-0.72; p = 0.004), while carriers of at least one DRD3 rs6280 C allele and CC homozygotes had higher odds for this adverse event (OR = 1.88; 95% CI = 1.00-3.54; p = 0.049 and OR = 3.31; 95% CI = 1.37-8.03; p = 0.008, respectively). Carriers of at least one DDC rs921451 C allele and CT heterozygotes had higher odds for orthostatic hypotension (OR = 1.86; 95% CI = 1.07-3.23; p = 0.028 and OR = 2.30; 95% CI = 1.26-4.20; p = 0.007, respectively). Heterozygotes for DDC rs3837091 and SLC22A1 rs628031 AA carriers also had higher odds for orthostatic hypotension (OR = 1.94; 95% CI = 1.07 - 3.51; p = 0.028 and OR = 2.57; 95% CI = 1.11 - 5.95; p = 0.028, respectively). Carriers of the SLC22A1 rs628031 AA genotype had higher odds for peripheral edema and impulse control disorders (OR = 4.00; 95% CI = 1.62 - 9.88; p = 0.003 and OR = 3.16; 95% CI = 1.03 - 9.72; p = 0.045, respectively). Finally, heterozygotes for SLC22A1 rs628031 and carriers of at least one SLC22A1 rs628031 A allele had lower odds for dyskinesia (OR = 0.48; 95% CI = 0.24 - 0.98, p = 0.043 and OR = 0.48; 95% CI = 0.25 - 0.92; p = 0.027, respectively). Gene-gene interactions, more specifically DDC-COMT, SLC18A2-SV2C, and SLC18A2-SLC6A3, also significantly influenced the occurrence of some adverse events. Additionally, haplotypes of COMT and SLC6A3 were associated with the occurrence of visual hallucinations (AT vs. GC: OR = 0.34; 95% CI = 0.16 - 0.72; p = 0.005) and orthostatic hypotension (ATG vs. ACG: OR = 2.48; 95% CI: 1.01 - 6.07; p = 0.047), respectively. Pathway based approach allowed us to identify new potential candidates for predictive biomarkers of adverse events of dopaminergic treatment in Parkinson's disease, which could contribute to treatment personalization. © 2007 - 2019 Frontiers Media S.A. All Rights Reserved."},
{"id": "85062980257", "title": "Deep Learning-Based Channel Prediction in Realistic Vehicular Communications", "authors": ["Joo, J.", "Park, M.", "Han, D.", "Pejovic, V."], "abstract": "Access to reliable estimates of the wireless channel, such as the channel state information (CSI) and the received signal strength would open opportunities for timely adaptation of transmission parameters and consequently increased throughput and transmission efficiency in vehicular communications. To design the adaptive transmission schemes, it is important to understand the realistic channel properties, especially in vehicular environments where the mobility of communication devices causes rapid channel variation. However, getting CSI estimates is challenging due to the lack of support for obtaining CSI from the chipset. In this paper, we present our efforts towards enabling reliable, up-to-date channel estimates in vehicular communications. We begin by designing and conducting a measurement campaign where we collect IQ (in-phase and quadrature) samples of the IEEE 802.11p transmission and implement CSI extraction algorithms to obtain and analyze wireless channel estimates from various real-world environments. We then propose a deep learning-based channel prediction for predicting future CSI and received signal levels. The trace-based evaluation demonstrates that our prediction approach improves the future power level estimate by 15% to 25% in terms of the root-mean-square-error compared to the latest known channel properties, thus, providing a sound basis for future efforts in anticipatory vehicular communication transmission adaptation. © 2019 IEEE."},
{"id": "85066755727", "title": "Implementation and evaluation of algorithms with ALGATOr", "authors": ["Dobravec, T."], "abstract": "In this paper we present an automatic algorithm evaluation system called ALGATOR, which was developed to facilitate the algorithm design and evaluation process. The system enables unbiased tests of the correctness of the algorithm’s results on given test cases and comparisons of the quality of implemented algorithms for solving various kinds of problems (e.g. sorting data, matrix multiplication, traveler salesman problem, shortest path problem, and the like). Within the ALGATOR one can define a problem by specifying the problem descriptors, test sets with corresponding test cases, input parameters and output indicators, algorithm specifications and criteria for measuring the quality of algorithms. When a user of the system submits an algorithm for solving a given problem, ALGATOR automatically executes this algorithm on predefined tests, measures the quality indicators and prepares the results to be compared with the results of other algorithms in the system. The ALGATOR is meant to be used by algorithm developers to perform independent quality tests for their solutions. © 2019 Slovene Society Informatika. All rights reserved."},
{"id": "85059819610", "title": "Formal Quality of Service assurances, ranking and verification of cloud deployment options with a probabilistic model checking method", "authors": ["Kochovski, P.", "Drobintsev, P.", "Stankovski, V."], "abstract": "Context: Existing software workbenches allow for the deployment of cloud applications across a variety of Infrastructure-as-a-Service (IaaS) providers. The expected workload, Quality of Service (QoS) and Non-Functional Requirements (NFRs) must be considered before an appropriate infrastructure is selected. However, this decision-making process is complex and time-consuming. Moreover, the software engineer needs assurances that the selected infrastructure will lead to an adequate QoS of the application. Objective: The goal is to develop a new method for selection of an optimal cloud deployment option, that is, an infrastructure and configuration for deployment and to verify that all hard and as many soft QoS requirements as possible will be met at runtime. Method: A new Formal QoS Assurances Method (FoQoSAM), which relies on stochastic Markov models is introduced to facilitate an automated decision-making process. For a given workload, it uses QoS monitoring data and a user-related metric in order to automatically generate a probabilistic model. The probabilistic model takes the form of a finite automaton. It is further used to produce a rank list of cloud deployment options. As a result, any of the cloud deployment options can be verified by applying a probabilistic model checking approach. Results: Testing was performed by ranking deployment options for two cloud applications, File Upload and Video-conferencing. The FoQoSAM method was compared to a baseline Analytic Hierarchy Process (AHP). The results show that the first ranked cloud deployment options satisfy all hard and at least one of the soft requirements for both methods, however, the FoQoSAM method always satisfies at least an additional QoS requirement compared to the baseline AHP method. Conclusions: The proposed new FoQoSAM method is appropriate and can be used in decision-making when ranking and verifying cloud deployment options. Due to its practical utility it was integrated into the SWITCH workbench. © 2019 Elsevier B.V."},
{"id": "85064093147", "title": "sonicLamination – From a concept to artistic binding of visual and sound domains by using advanced technology", "authors": ["Trček, D.", "Trček, G."], "abstract": "Layers can be considered as powerful mental concept with proven suitability in numerous areas ranging from fine arts to engineering. To further expand their potential and apply them to computers-based art, sonicLamination method is presented here. The method builds upon computer-based (programmatic) transformations that take into account various enriching perspectives, e.g., physiological laws of human perception. By doing so, it achieves higher levels of semantic relationships when binding visual and sound domains. Put another way, sonicLamination is not just about a new kind of conceptual art, but about exploring new venues in fine arts through technology. Therefore, this paper presents how sonicLamination can be used to exceed its conceptual roots in order to lead to new ways of artistic deployment ranging from enhancing humans sensations to artificially generated soundscapes. This is due to the fact that the core principles of sonicLamination can be naturally extended to provide means for a plethora of artistic approaches when technologically transforming visual inputs into their sonic representations. Copyright © 2019 Inderscience Enterprises Ltd."},
{"id": "85065130799", "title": "Cardiac autonomic regulation and PR interval determination for enhanced atrial fibrillation risk prediction after cardiac surgery", "authors": ["Kališnik, J.", "Avbelj, V.", "Vratanar, J.", "Santarpino, G.", "Geršak, B.", "Fischlein, T.", "Trobec, R.", "Žibert, J."], "abstract": "Background: Changes in cardiac autonomic regulation and P-wave characteristics are associated with the occurrence of atrial fibrillation. The purpose of this study was to evaluate whether combined preoperative non-invasive determination of cardiac autonomic regulation and PR interval allows for the identification of patients at risk of new-onset atrial fibrillation after cardiac surgery. Methods: RR, PR and QT intervals, and linear and non-linear heart rate variability parameters from 20 min high-resolution electrocardiographic recordings were determined one day before surgery in 150 patients on chronic beta blockers undergoing elective coronary artery bypass grafting, aortic valve replacement, or both, electively. Results: Thirty-one patients (21%)developed postoperative atrial fibrillation. In the atrial fibrillation group, more arterial hypertension, a greater age, a higher EuroSCORE II, a higher heart rate variability index (pNN50: 9 ± 20 vs. 4 ± 10, p = 0.050), a short PR interval (156 ± 23 vs. 173 ± 31 ms; p = 0.011), and a reduced short-term scaling exponent of the detrended fluctuation analysis (DFA1, 0.96 ± 0.36 vs. 1.11 ± 0.30 ms; p = 0.032)were found compared to the sinus rhythm group. Logistic regression modeling confirmed PR interval, DFA1 and age as the strongest preoperative predictors of postoperative atrial fibrillation (area under the receiver operating characteristic curve = 0.804). Conclusions: Patients developing atrial fibrillation after cardiac surgery presented with severe cardiac autonomic derangement and a short PR interval preoperatively. The observed state characterizes both altered heart rate regulation and arrhythmic substrate and is strongly related to an increased risk of postoperative atrial fibrillation. © 2019 Elsevier B.V."},
{"id": "85058676745", "title": "The Image of the Monolingual Dictionary Across Europe. Results of the European Survey of Dictionary use and Culture", "authors": ["Kosem, I.", "Lew, R.", "Müller-Spitzer, C.", "Silveira, M.", "Wolfer, S.", "Dorn, A.", "Gurrutxaga, A.", "Ceberio, K.", "Etxeberria, E.", "Lefer, M.", "Geeraerts, D.", "Despot, K.", "Stojanov, T.", "Ljubešić, N.", "Škrabal, M.", "Štěpánková, B.", "Vodrážková, V.", "Lorentzen, H.", "Trap-Jensen, L.", "Kallas, J.", "Tuulik, M.", "Koppel, K.", "Langemets, M.", "Heinonen, T.", "Thomas, I.", "Margilitadze, T.", "Markantonatou, S.", "Giouli, V.", "Mulhall, C.", "Kernerman, I.", "Ben-Moshe, Y.", "Sadan, T.", "Abel, A.", "Curcio, M.", "Tanturovska, L.", "Nikovska, B.", "Tiberius, C.", "Grønvik, O.", "Hovdenak, M.", "Berg-Olsen, S.", "Karlsen, K.", "Ore, C.", "Biesaga, M.", "Kuhn, T.", "Silvestre, J.", "Tamba, E.", "Haja, G.", "Clim, M.", "Patrascu, M.", "Tasovac, T.", "Petrović, S.", "Holdt, Š.", "Riveiro, C.", "Vázquez, M.", "Volodina, E.", "Pilán, I.", "Sköldberg, E.", "Holmer, L.", "Nesi, H."], "abstract": "The article presents the results of a survey on dictionary use in Europe, focusing on general monolingual dictionaries. The survey is the broadest survey of dictionary use to date, covering close to 10,000 dictionary users (and non-users) in nearly thirty countries. Our survey covers varied user groups, going beyond the students and translators who have tended to dominate such studies thus far. The survey was delivered via an online survey platform, in language versions specific to each target country. It was completed by 9,562 respondents, over 300 respondents per country on average. The survey consisted of the general section, which was translated and presented to all participants, as well as country-specific sections for a subset of 11 countries, which were drafted by collaborators at the national level. The present report covers the general section. © 2018 Oxford University Press. All rights reserved."},
{"id": "85057585433", "title": "Convexity in scientific collaboration networks", "authors": ["Šubelj, L.", "Fiala, D.", "Ciglarič, T.", "Kronegger, L."], "abstract": "Convexity in a network (graph) has been recently defined as a property of each of its subgraphs to include all shortest paths between the nodes of that subgraph. It can be measured on the scale [0, 1] with 1 being assigned to fully convex networks. The largest convex component of a graph that emerges after the removal of the least number of edges is called a convex skeleton. It is basically a tree of cliques, which has been shown to have many interesting features. In this article the notions of convexity and convex skeletons in the context of scientific collaboration networks are discussed. More specifically, we analyze the co-authorship networks of Slovenian researchers in computer science, physics, sociology, mathematics, and economics and extract convex skeletons from them. We then compare these convex skeletons with the residual graphs (remainders) in terms of collaboration frequency distributions by various parameters such as the publication year and type, co-authors' birth year, status, gender, discipline, etc. We also show the top-ranked scientists by four basic centrality measures as calculated on the original networks and their skeletons and conclude that convex skeletons may help detect influential scholars that are hardly identifiable in the original collaboration network. As their inherent feature, convex skeletons retain the properties of collaboration networks. These include high-level structural properties but also the fact that the same authors are highlighted by centrality measures. Moreover, the most important ties and thus the most important collaborations are retained in the skeletons. © 2018 Elsevier Ltd. All rights reserved."},
{"id": "85062329074", "title": "Genetic variability of inflammation and oxidative stress genes does not play a major role in the occurrence of adverse events of dopaminergic treatment in Parkinson's disease", "authors": ["Redenšek, S.", "Flisar, D.", "Kojović, M.", "Kramberger, M.", "Georgiev, D.", "Pirtošek, Z.", "Trošt, M.", "Dolžan, V."], "abstract": "Background: Inflammation and oxidative stress are recognized as important contributors to Parkinson's disease pathogenesis. As such, genetic variability in these pathways could have a role in susceptibility for the disease as well as in the treatment outcome. Dopaminergic treatment is effective in management of motor symptoms, but poses a risk for motor and non-motor adverse events. Our aim was to evaluate the impact of selected single-nucleotide polymorphisms in genes involved in inflammation and oxidative stress on Parkinson's disease susceptibility and the occurrence of adverse events of dopaminergic treatment. Methods: In total, 224 patients were enrolled, and their demographic and clinical data on the disease course were collected. Furthermore, a control group of 146 healthy Slovenian blood donors were included for Parkinson's disease' risk evaluation. Peripheral blood was obtained for DNA isolation. Genotyping was performed for NLRP3 rs35829419, CARD8 rs2043211, IL1β rs16944, IL1β rs1143623, IL6 rs1800795, CAT rs1001179, CAT rs10836235, SOD2 rs4880, NOS1 rs2293054, NOS1 rs2682826, TNF-α rs1800629, and GPX1 rs1050450. Logistic regression was used for analysis of possible associations. Results: We observed a nominally significant association of the IL1β rs1143623 C allele with the risk for Parkinson's disease (OR = 0.59; 95%CI = 0.38-0.92, p = 0.021). CAT rs1001179 A allele was significantly associated with peripheral edema (OR = 0.32; 95%CI = 0.15-0.68; p = 0.003). Other associations observed were only nominally significant after adjustments: NOS1 rs2682826 A allele and excessive daytime sleepiness and sleep attacks (OR = 1.75; 95%CI = 1.00-3.06, p = 0.048), SOD2 rs4880 T allele and nausea/vomiting (OR = 0.49, 95%CI = 0.25-0.94; p = 0.031), IL1β rs1143623 C allele and orthostatic hypotension (OR = 0.57, 95%CI = 0.32-1.00, p = 0.050), and NOS1 rs2682826 A allele and impulse control disorders (OR = 2.59; 95%CI = 1.09-6.19; p = 0.032). We did not find any associations between selected polymorphisms and motor adverse events. Conclusions: Apart from some nominally significant associations, one significant association between CAT genetic variability and peripheral edema was observed as well. Therefore, the results of our study suggest some links between genetic variability in inflammation- and oxidative stress-related pathways and non-motor adverse events of dopaminergic treatment. However, the investigated polymorphisms do not play a major role in the occurrence of the disease and the adverse events of dopaminergic treatment. © 2019 The Author(s)."},
{"id": "85061212953", "title": "Effect of low versus high frequency subthalamic deep brain stimulation on speech intelligibility and verbal fluency in Parkinson's disease: A double-blind study", "authors": ["Grover, T.", "Georgiev, D.", "Kalliola, R.", "Mahlknecht, P.", "Zacharia, A.", "Candelario, J.", "Hyam, J.", "Zrinzo, L.", "Hariz, M.", "Foltynie, T.", "Limousin, P.", "Jahanshahi, M.", "Tripoliti, E."], "abstract": "Background: Subthalamic deep brain stimulation (STN-DBS) is an established treatment for late stage Parkinson's disease (PD). Speech intelligibility (SI) and verbal fluency (VF) have been shown to deteriorate following chronic STN-DBS. It has been suggested that speech might respond favourably to low frequency stimulation (LFS). Objective: We examined how SI, perceptual speech characteristics, phonemic and semantic VF and processes underlying it (clustering and switching) respond to LFS of 60 and 80 Hz in comparison to high frequency stimulation (HFS) (110, 130 and 200 Hz). Methods: In this double-blind study, 15 STN-DBS PD patients (mean age 65, SD = 5.8, 14 right handed, three females), were assessed at five stimulation frequencies: 60 Hz, 80 Hz, 110 Hz, 130 Hz and 200 Hz. In addition to the clinical neurological assessment of speech, VF and SI were assessed. Results: SI and in particular articulation, respiration, phonation and prosody improved with LFS (all p &lt; 0.05). Phonemic VF switching improved with LFS (p = 0.005) but this did not translate to an improved phonemic VF score. A trend for improved semantic VF was found. A negative correlation was found between perceptual characteristics of speech and duration of chronic stimulation (all p &lt; 0.05). Conclusions: These findings highlight the need for meticulous programming of frequency to maximise SI in chronic STNDBS. The findings further implicate stimulation frequency in changes to specific processes underlying VF, namely phonemic switching and demonstrate the potential to address such deficits through advanced adjustment of stimulation parameters. © 2019 IOS Press and the authors. All rights reserved."},
{"id": "85054394355", "title": "Simplicity matters: user evaluation of the Slovene reference corpus", "authors": ["Arhar Holdt, Š.", "Dobrovoljc, K.", "Logar, N."], "abstract": "The latest reference corpus of written Slovene, the Gigafida corpus, was created as part of the ‘Communication in Slovene’ project. In the same project, a web concordancer was designed for the broadest possible use, and tailored to the needs and abilities of user groups such as translators, writers, proofreaders and teachers. Two years after the corpus was published within the new tool, its features were assessed by the users. With an average rate of 4.36 on a scale between 1 and 5 (1 = I strongly disagree, 5 = I strongly agree), the results indicate that most survey participants agreed or strongly agreed with positive statements about the new implementations (e.g. “The corpus results are displayed in a clear manner”). This is a considerable improvement in user experience from the previous reference corpus of Slovene, i.e. the FidaPLUS corpus within the ASP32 concordancer (rated with 3.67). In the user feedback, the simplicity of search options and the interface clarity are highlighted as the main advantages, while for the future development, advanced visualizations of corpus data and improved search of word-phrases are suggested. The evaluation also highlighted some relevant user habits, such as not taking the time to learn systematically about the tool before they start using it. The findings will be implemented in future editions of the Gigafida corpus, but are relevant to any project that aims at facilitating a wider use of reference corpora and corpus-based resources. © 2018, Springer Nature B.V."},
{"id": "85058159495", "title": "A Nordhaus–Gaddum conjecture for the minimum number of distinct eigenvalues of a graph", "authors": ["Levene, R.", "Oblak, P.", "Šmigoc, H."], "abstract": "We propose a Nordhaus–Gaddum conjecture for q(G), the minimum number of distinct eigenvalues of a symmetric matrix corresponding to a graph G: for every graph G excluding four exceptions, we conjecture that q(G)+q(G<sup>c</sup>)≤|G|+2, where G<sup>c</sup> is the complement of G. We compute q(G<sup>c</sup>) for all trees and all graphs G with q(G)=|G|−1, and hence we verify the conjecture for trees, unicyclic graphs, graphs with q(G)≤4, and for graphs with |G|≤7. © 2018 Elsevier Inc."},
{"id": "85049077640", "title": "Extreme value correction: a method for correcting optimistic estimations in rule learning", "authors": ["Možina, M.", "Demšar, J.", "Bratko, I.", "Žabkar, J."], "abstract": "Machine learning algorithms rely on their ability to evaluate the constructed hypotheses for choosing the optimal hypothesis during learning and assessing the quality of the model afterwards. Since these estimates, in particular the former ones, are based on the training data from which the hypotheses themselves were constructed, they are usually optimistic. The paper shows three different solutions; two for the artificial boundary cases with the smallest and the largest optimism and a general correction procedure called extreme value correction (EVC) based on extreme value distribution. We demonstrate the application of the technique to rule learning, specifically to estimating classification accuracy of a single rule, and evaluate it on an artificial data set and on a number of UCI data sets. We observed that the correction successfully improved the accuracy estimates. We also describe an approach for combining rules into a linear global classifier and show that using EVC estimates leads to more accurate classifiers. © 2018, The Author(s)."},
{"id": "85037728402", "title": "Frame–based classification for cross-speed gait recognition", "authors": ["Kovač, J.", "Štruc, V.", "Peer, P."], "abstract": "The use of human gait as the means of biometric identification has gained a lot of attention in the past few years, mostly due to its enormous potential. Such biometrics can be captured at public places from a distance without subjects collaboration, awareness and even consent. However, there are still numerous challenges caused by influence of covariate factors like changes of walking speed, view, clothing, footwear etc., that have negative impact on recognition performance. In this paper we tackle walking speed changes with a skeleton model-based gait recognition system focusing on improving algorithm robustness and improving the performance at higher walking speed changes. We achieve these by proposing frame based classification method, which overcomes the main shortcoming of distance based classification methods, which are very sensitive to gait cycle starting point detection. The proposed technique is starting point invariant with respect to gait cycle starts and as such ensures independence of classification from gait cycle start positions. Additionally, we propose wavelet transform based signal approximation, which enables the analysis of feature signals on different frequency space resolutions and diminishes the need for using feature transformation that require training. With the evaluation on OU-ISIR gait dataset we demonstrate state of the art performance of proposed methods. © 2017, Springer Science+Business Media, LLC, part of Springer Nature."},
{"id": "85062642330", "title": "Approximate multiple kernel learning with least-angle regression", "authors": ["Stražar, M.", "Curk, T."], "abstract": "Kernel methods provide a principled way for general data representations. Multiple kernel learning and kernel approximation are often treated as separate tasks, with considerable savings in time and memory expected if the two are performed simultaneously. Our proposed Mklaren algorithm selectively approximates multiple kernel matrices in regression. It uses Incomplete Cholesky Decomposition and Least-angle regression (LAR) to select basis functions, achieving linear complexity both in the number of data points and kernels. Since it approximates kernel matrices rather than functions, it allows to combine an arbitrary set of kernels. Compared to single kernel-based approximations, it selectively approximates different kernels in different regions of the input spaces. The LAR criterion provides a robust selection of inducing points in noisy settings, and an accurate modelling of regression functions in continuous and discrete input spaces. Among general kernel matrix decompositions, Mklaren achieves minimal approximation rank required for performance comparable to using the exact kernel matrix, at a cost lower than 1% of required operations. Finally, we demonstrate the scalability and interpretability in settings with millions of data points and thousands of kernels. © 2019 The Authors"},
{"id": "85058189198", "title": "Sensory trick efficacy in cervical dystonia is linked to processing of neck proprioception", "authors": ["Brugger, F.", "Peters, A.", "Georgiev, D.", "Kägi, G.", "Balint, B.", "Bhatia, K.", "Day, B."], "abstract": "Background: Muscle vibration activates muscle spindles and when applied over posterior neck muscles during stance modulates global body orientation. This is characterised by a tonic forward sway response that is reportedly diminished or absent in patients with idiopathic cervical dystonia. Objective: To investigating the impact of the sensory trick on vibration-induced postural responses. Methods: 20 patients with idiopathic cervical dystonia and a sensory trick, 15 patients without a trick, and 16 healthy controls were recruited. Neck muscle vibration was applied bilaterally over the upper trapezius under three different conditions: 1) Quiet standing; 2) standing while performing the trick (or trick-like movement in non-responders); 3) standing while elevating the flexed arm without touching any part of the body. Centre of pressure position and whole-body orientation in the sagittal plane were analysed. Results: Patients with a sensory trick responded similarly to healthy controls: neck muscle vibration led to an initial forward sway of the body that slowly increased during the prolonged vibration for all three conditions. This response was mainly mediated by ankle flexion. In patients without a trick, the initial sagittal sway was significantly reduced in all three conditions and the later slow increase was absent. Performance of the trick did not have an effect on any aspect of the response in either cervical dystonia group. Conclusions: The whole-body response to neck vibration in cervical dystonia differs depending on the effectiveness of the sensory trick to alleviate the dystonic neck posture. Variable pathophysiology of proprioceptive processing may be the common factor. © 2018 Elsevier Ltd"},
{"id": "85062696925", "title": "Kanban in software engineering education: An outline of the literature", "authors": ["Mahnič, V."], "abstract": "Kanban, an agile software development methodology, is growing increasingly popular in the software industry. In order to meet industry needs, universities must find a way to integrate Kanban into their software engineering courses. In this article is provided an outline of existing literature on this topic. The search of studies in the Scopus database revealed 13 papers that were identified as primary studies relevant to this research. These studies are classified by their main topic into four groups, viz. 1) teaching Kanban through practical work on student projects; 2)teaching Kanban through educational games; 3) reporting students' perceptions of Kanban and/or Scrumban(a related methodology) and 4) position papers. A short description of each study and its main results are provided. It was found that the literature on the use of Kanban in software engineering education is sparse and of limited quality. Only a few studies contain discussions on teaching the most important Kanban concepts (i.e. the structure of the Kanban board, setting of work-in-progress limits, maximising workflow and measuring lead time) in sufficient detail. © 2019 WIETE."},
{"id": "85055878156", "title": "Average Step Length Estimation Models' Evaluation Using Inertial Sensors: A Review", "authors": ["Vezocnik, M.", "Juric, M."], "abstract": "Inertial sensors of smartphones and other Internet-of-Things devices present a very promising tool to monitor users' activity including their step length. In this review paper, we deal with an in-depth analysis and comparison of 13 representative step length estimation models using smartphone inertial sensors: step-frequency-based, acceleration-based, angle-based, and multiparameter. Hereby, we have studied the influence of different walking speeds and four typical sensor positions on the models' performance. Results indicate that smartphone position affected the performance of most acceleration-based models derived from a gait model. Their performance deteriorated if smartphone was carried in hand or pocket. Walking speed affected the performance of models that include step frequency when tuned with personalized sets of constants. Most of them performed better for fast and normal walking speeds. During this research, we also established an open-source dataset that contains over 22 km of gait measurements obtained from a group of 15 healthy adults. © 2001-2012 IEEE."},
{"id": "85064811447", "title": "Lightning may pose a danger to patients receiving deep brain stimulation: Case report", "authors": ["Prezelj, N.", "Trošt, M.", "Georgiev, D.", "Flisar, D."], "abstract": "Deep brain stimulation (DBS) is an established treatment option for advanced stages of Parkinson’s disease and other movement disorders. It is known that DBS is susceptible to strong electromagnetic fields (EMFs) that can be generated by various electrical devices at work, home, and in medical environments. EMFs can interfere with the proper functioning of implantable pulse generators (IPGs). Very strong EMFs can generate induction currents in implanted electrodes and even damage the brain. Manufacturers of DBS devices have issued a list of warnings on how to avoid this danger. Strong EMFs can result from natural forces as well. The authors present the case of a 66-year-old woman who was being treated with a rechargeable DBS system for neck dystonia when her apartment was struck by lightning. Domestic electronic devices that were operating during the event were burned and destroyed. The woman’s IPG switched off but remained undamaged, and she suffered no neurological consequences. ©AANS 2019."},
{"id": "85061750502", "title": "The sixth visual object tracking VOT2018 challenge results", "authors": ["Kristan, M.", "Leonardis, A.", "Matas, J.", "Felsberg, M.", "Pflugfelder, R.", "Zajc, L.", "Vojír̃, T.", "Bhat, G.", "Lukežič, A.", "Eldesokey, A.", "Fernández, G.", "García-Martín, Á.", "Iglesias-Arias, Á.", "Alatan, A.", "González-García, A.", "Petrosino, A.", "Memarmoghadam, A.", "Vedaldi, A.", "Muhič, A.", "He, A.", "Smeulders, A.", "Perera, A.", "Li, B.", "Chen, B.", "Kim, C.", "Xu, C.", "Xiong, C.", "Tian, C.", "Luo, C.", "Sun, C.", "Hao, C.", "Kim, D.", "Mishra, D.", "Chen, D.", "Wang, D.", "Wee, D.", "Gavves, E.", "Gundogdu, E.", "Velasco-Salido, E.", "Khan, F.", "Yang, F.", "Zhao, F.", "Li, F.", "Battistone, F.", "De Ath, G.", "Subrahmanyam, G.", "Bastos, G.", "Ling, H.", "Galoogahi, H.", "Lee, H.", "Li, H.", "Zhao, H.", "Fan, H.", "Zhang, H.", "Possegger, H.", "Li, H.", "Lu, H.", "Zhi, H.", "Li, H.", "Lee, H.", "Chang, H.", "Drummond, I.", "Valmadre, J.", "Martin, J.", "Chahl, J.", "Choi, J.", "Li, J.", "Wang, J.", "Qi, J.", "Sung, J.", "Johnander, J.", "Henriques, J.", "Choi, J.", "van de Weijer, J.", "Herranz, J.", "Martínez, J.", "Kittler, J.", "Zhuang, J.", "Gao, J.", "Grm, K.", "Zhang, L.", "Wang, L.", "Yang, L.", "Rout, L.", "Si, L.", "Bertinetto, L.", "Chu, L.", "Che, M.", "Maresca, M.", "Danelljan, M.", "Yang, M.", "Abdelpakey, M.", "Shehata, M.", "Kang, M.", "Lee, N.", "Wang, N.", "Miksik, O.", "Moallem, P.", "Vicente-Moñivar, P.", "Senna, P.", "Li, P.", "Torr, P.", "Raju, P.", "Ruihe, Q.", "Wang, Q.", "Zhou, Q.", "Guo, Q.", "Martín-Nieto, R.", "Gorthi, R.", "Tao, R.", "Bowden, R.", "Everson, R.", "Wang, R.", "Yun, S.", "Choi, S.", "Vivas, S.", "Bai, S.", "Huang, S.", "Wu, S.", "Hadfield, S.", "Wang, S.", "Golodetz, S.", "Ming, T.", "Xu, T.", "Zhang, T.", "Fischer, T.", "Santopietro, V.", "Štruc, V.", "Wei, W.", "Zuo, W.", "Feng, W.", "Wu, W.", "Zou, W.", "Hu, W.", "Zhou, W.", "Zeng, W.", "Zhang, X.", "Wu, X.", "Wu, X.", "Tian, X.", "Li, Y.", "Lu, Y.", "Law, Y.", "Wu, Y.", "Demiris, Y.", "Yang, Y.", "Jiao, Y.", "Li, Y.", "Zhang, Y.", "Sun, Y.", "Zhang, Z.", "Zhu, Z.", "Feng, Z.", "Wang, Z.", "He, Z."], "abstract": "The Visual Object Tracking challenge VOT2018 is the sixth annual tracker benchmarking activity organized by the VOT initiative. Results of over eighty trackers are presented; many are state-of-the-art trackers published at major computer vision conferences or in journals in the recent years. The evaluation included the standard VOT and other popular methodologies for short-term tracking analysis and a “real-time” experiment simulating a situation where a tracker processes images as if provided by a continuously running sensor. A long-term tracking subchallenge has been introduced to the set of standard VOT sub-challenges. The new subchallenge focuses on long-term tracking properties, namely coping with target disappearance and reappearance. A new dataset has been compiled and a performance evaluation methodology that focuses on long-term tracking capabilities has been adopted. The VOT toolkit has been updated to support both standard short-term and the new long-term tracking subchallenges. Performance of the tested trackers typically by far exceeds standard baselines. The source code for most of the trackers is publicly available from the VOT page. The dataset, the evaluation kit and the results are publicly available at the challenge website (http://votchallenge.net). © Springer Nature Switzerland AG 2019."},
{"id": "85063055727", "title": "Smart contracts for container based video conferencing services: Architecture and implementation", "authors": ["Gec, S.", "Lavbič, D.", "Bajec, M.", "Stankovski, V."], "abstract": "Today, container-based virtualization is very popular due to the lightweight nature of containers and the ability to use them flexibly in various heterogeneously composed systems. This makes it possible to collaboratively develop services by sharing various types of resources, such as infrastructures, software and digitalized content. In this work, our home made video-conferencing (VC) system is used to study resource usage optimisation in business context. An application like this, does not provide monetization possibilities to all involved stakeholders including end users, cloud providers, software engineers and similar. Blockchain related technologies, such as Smart Contracts (SC) offer a possibility to address some of these needs. We introduce a novel architecture for monetization of added-value according to preferences of the stakeholders that participate in joint software service offers. The developed architecture facilitates use case scenarios of service and resource offers according to fixed and dynamic pricing schemes, fixed usage period, prepaid quota for flexible usage, division of income, consensual decisions among collaborative service providers, and constrained based usage of resources or services. Our container-based VC service, which is based on the Jitsi Meet Open Source software is used to demonstrate the proposed architecture and the benefits of the investigated use cases. © 2019, Springer Nature Switzerland AG."},
{"id": "85065573982", "title": "Prediction of music pairwise preferences from facial expressions", "authors": ["Tkalčič, M.", "Elahi, M.", "Maleki, N.", "Ricci, F.", "Pesek, M.", "Marolt, M."], "abstract": "Users of a recommender system may be requested to express their preferences about items either with evaluations of items (e.g. a rating) or with comparisons of item pairs. In this work we focus on the acquisition of pairwise preferences in the music domain. Asking the user to explicitly compare music, i.e., which, among two listened tracks, is preferred, requires some user effort. We have therefore developed a novel approach for automatically extracting these preferences from the analysis of the facial expressions of the users while listening to the compared tracks. We have trained a predictor that infers user's pairwise preferences by using features extracted from these data. We show that the predictor performs better than a commonly used baseline, which leverages the user's listening duration of the tracks to infer pairwise preferences. Furthermore, we show that there are differences in the accuracy of the proposed method between users with different personalities and we have therefore adapted the trained model accordingly. Our work shows that by introducing a low user effort preference elicitation approach, which, however, requires to access information that may raise potential privacy issues (face expression), one can obtain good prediction accuracy of pairwise music preferences. © 2019 Copyright held by the owner/author(s). Publication rights licensed to ACM."},
{"id": "85053504027", "title": "Teaching with Open-Source Robotic Manipulator", "authors": ["Čehovin Zajc, L.", "Rezelj, A.", "Skočaj, D."], "abstract": "In this paper we present and evaluate the usage of an open-source robotic manipulator platform, that we have developed, in the context of various educational scenarios that we have conducted. The system was tested in multiple diverse learning scenarios, ranging from a summer school for primary-school students, to the course at the university level study. We show that the introduction of the system in the educational process improves the motivation as well as acquired knowledge of the participants. © 2019, Springer Nature Switzerland AG."},
{"id": "85063335992", "title": "Discovering language of the stocks", "authors": ["Poženel, M.", "Lavbič, D."], "abstract": "Stock prediction has always been attractive area for researchers and investors since the financial gains can be substantial. However, stock prediction can be a challenging task since stocks are influenced by a multitude of factors whose influence vary rapidly through time. This paper proposes a novel approach (Word2Vec) for stock trend prediction combining NLP and Japanese candlesticks. First, we create a simple language of Japanese candlesticks from the source OHLC data. Then, sentences of words are used to train the NLP Word2Vec model where training data classification also takes into account trading commissions. Finally, the model is used to predict trading actions. The proposed approach was compared to three trading models Buy &amp; Hold, MA and MACD according to the yield achieved. We first evaluated Word2Vec on three shares of Apple, Microsoft and Coca-Cola where it outperformed the comparative models. Next we evaluated Word2Vec on stocks from Russell Top 50 Index where our Word2Vec method was also very successful in test phase and only fall behind the Buy &amp; Hold method in validation phase. Word2Vec achieved positive results in all scenarios while the average yields of MA and MACD were still lower compared to Word2Vec. © 2019 The authors and IOS Press."},
{"id": "85059018486", "title": "Deep ear recognition pipeline", "authors": ["Emeršič, Ž.", "Križaj, J.", "Štruc, V.", "Peer, P."], "abstract": "Ear recognition has seen multiple improvements in recent years and still remains very active today. However, it has been approached from recognition and detection perspective separately. Furthermore, deep-learning-based approaches that are popular in other domains have seen limited use in ear recognition and even more so in ear detection. Moreover, to obtain a usable recognition system a unified pipeline is needed. The input in such system should be plain images of subjects and the output identities based only on ear biometrics. We conduct separate analysis through detection and identification experiments on the challenging dataset and, using the best approaches, present a novel, unified pipeline. The pipeline is based on convolutional neural networks (CNN) and presents, to the best of our knowledge, the first CNN-based ear recognition pipeline. The pipeline incorporates both, the detection of ears on arbitrary images of people, as well as recognition on these segmented ear regions. The experiments show that the presented system is a state-of-the-art system and, thus, a good foundation for future real-word ear recognition systems. © Springer Nature Switzerland AG 2019."}
]